<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'badges', language 'km', branch 'MOODLE_36_STABLE'
 *
 * @package   badges
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['actions'] = 'សកម្មភាព';
$string['activate'] = 'ដាក់ឲ្យដំណើរការ';
$string['activatesuccess'] = 'ផ្លាកសញ្ញាត្រូវបានដាក់ឲ្យដំណើរការដោយជោគជ័យ។';
$string['addbadgecriteria'] = 'បន្ថែមលក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញា';
$string['addcourse'] = 'បន្ថែមវគ្គសិក្សា';
$string['addcourse_help'] = 'ជ្រើសវគ្គសិក្សាទាំងអស់ដែលជាតម្រូវការសម្រាប់ផ្លាកសញ្ញានេះ។ សង្កត់គ្រាប់ចុច CTRL ដើម្បីជ្រើសវគ្គសិក្សាច្រើន។';
$string['addcriteria'] = 'បន្ថែមលក្ខណៈវិនិច្ឆ័យ';
$string['addcriteriatext'] = 'ដើម្បីបន្ថែមលក្ខណៈវិនិច្ឆ័យ សូមជ្រើសរើសជម្រើសមួយពីម៉ឺនុយទម្លាក់ចុះ';
$string['addtobackpack'] = 'ដាក់ទៅក្នុងកាបូបស្ពាយ';
$string['adminonly'] = 'ទំព័រនេះគឺសម្រាប់តែអ្នកគ្រប់គ្រងបណ្តាញប៉ុណ្ណោះ។';
$string['after'] = 'បន្ទាប់ពីថ្ងៃដែលផ្លាកសញ្ញាត្រូវបានប្រគល់ជូន';
$string['aggregationmethod'] = 'វិធីសរុប';
$string['all'] = 'ទាំងអស់';
$string['allmethod'] = 'លក្ខខណ្ឌទាំងអស់ដែលបានជ្រើសរើសត្រូវបានបំពេញ';
$string['allmethodactivity'] = 'សកម្មភាពទាំងអស់ដែលបានជ្រើសរើសត្រូវបានបំពេញ';
$string['allmethodcourseset'] = 'វគ្គសិក្សាទាំងអស់ដែលបានជ្រើសរើសត្រូវបានបំពេញ';
$string['allmethodmanual'] = 'អ្នកមានតួនាទីទាំងអស់ដែលបានជ្រើសរើសបានផ្តល់ផ្លាកសញ្ញា';
$string['allmethodprofile'] = 'ប្រអប់ទិន្នន័យទាំងអស់ក្នុងទំព័រប្រវត្តិរូបដែលបានជ្រើសរើសត្រូវបានបំពេញ';
$string['allowcoursebadges'] = 'ដាក់ដំណើរការផ្លាកសញ្ញាក្នុងវគ្គសិក្សា';
$string['allowcoursebadges_desc'] = 'អនុញ្ញាតការបង្កើតនិងប្រគល់ជូនផ្លាកសញ្ញាក្នុងវគ្គសិក្សា។';
$string['allowexternalbackpack'] = 'អនុុញ្ញាតការភ្ជាប់ទៅកាន់កាបូបស្ពាយខាងក្រៅ (external backpacks)';
$string['allowexternalbackpack_desc'] = 'អនុញ្ញាតឲ្យអ្នកប្រើអាចភ្ជាប់និងបង្ហាញផ្លាកសញ្ញាពីកាបូបស្ពាយខាងក្រៅ។

ចំណាំ៖ សូមកុំុអនុញ្ញាត ប្រសិនបើតំបន់បណ្តាញមិនអាចតភ្ជាប់តាមអ៊ីនធឺណិត';
$string['any'] = 'ណាមួយ';
$string['anymethod'] = 'លក្ខខណ្ឌណាមួយក្នុងចំណោមលក្ខខណ្ឌដែលបានជ្រើសរើសត្រូវបានបំពេញ';
$string['anymethodactivity'] = 'សកម្មភាពណាមួយក្នុងចំណោមសកម្មភាពដែលបានជ្រើសរើសត្រូវបានបំពេញ';
$string['anymethodcourseset'] = 'វគ្គសិក្សាណាមួយក្នុងចំណោមវគ្គសិក្សាដែលបានជ្រើសរើសត្រូវបានបំពេញ';
$string['anymethodmanual'] = 'នរណាម្នាក់ក្នុងចំណោមអ្នកមានតួនាទីទាំងអស់ដែលបានជ្រើសរើសបានផ្តល់ផ្លាកសញ្ញា';
$string['anymethodprofile'] = 'ប្រអប់ទិន្នន័យណាមួយក្នុងចំណោមប្រអប់ទិន្នន័យទាំងអស់ក្នុងទំព័រប្រវត្តិរូបដែលបានជ្រើសត្រូវបានបំពេញ';
$string['archivebadge'] = 'តើអ្នកចង់លុបផ្លាកសញ្ញា \'{$a}\' ប៉ុន្តែរក្សាទុកផ្លាកសញ្ញាដែលបានប្រគល់ឲ្យសិស្សហើយដែរឬទេ?';
$string['archiveconfirm'] = 'លុប ហើយរក្សាទុកផ្លាកសញ្ញាដែលបានប្រគល់ឲ្យសិស្សហើយ';
$string['archivehelp'] = '<p> ជម្រើសនេះមានន័យថាផ្លាកសញ្ញានេះនឹងត្រូវបានសម្គាល់ថា "ចូលនិវត្តន៍" ហើយនឹងលែងបង្ហាញនៅក្នុងបញ្ជីផ្លាកសញ្ញាទៀតហើយ។ អ្នកប្រើនឹងមិនអាចទទួលបានផ្លាកសញ្ញានេះទៀតទេ ប៉ុន្តែអ្នកដែលបានទទួលផ្លាកសញ្ញានេះពីមុន នឹងនៅតែអាចបង្ហាញផ្លាកសញ្ញានេះនៅលើទំព័រព័ត៌មានរបស់ពួកគេ ហើយដាក់វាក្នុងកាបូបស្ពាយខាងក្រៅរបស់ពួកគេ។ </p>
<p> ប្រសិនបើអ្នកចង់អោយអ្នកប្រើរបស់អ្នកនៅតែអាចចូលទៅកាន់ផ្លាកសញ្ញាដែលគេទទួលបាន អ្នកត្រូវជ្រើសរើសជម្រើសនេះជំនួសឱ្យការលុបផ្លាកសញ្ញាទាំងស្រុង។ </p>';
$string['attachment'] = 'ភ្ជាប់ផ្លាកសញ្ញាជាមួយនឹងសារ';
$string['attachment_help'] = 'ប្រសិនបើជ្រើសរើសវា រូបភាពផ្លាកសញ្ញានឹងត្រូវបានភ្ជាប់ជាមួយអ៊ីម៉ែលទៅកាន់អ្នកទទួល។';
$string['award'] = 'ប្រគល់ផ្លាកសញ្ញា';
$string['awardedtoyou'] = 'បានប្រគល់ឲ្យខ្ញុំ';
$string['awardoncron'] = 'ផ្លាកសញ្ញាត្រូវបានបើកដំណើរដោយជោគជ័យ។ អ្នកប្រើច្រើនអាចទទួលបានផ្លាកសញ្ញាភ្លាមៗ។ ដើម្បីធានាប្រតិបត្តការរបស់តំបន់បណ្តាញ ការប្រគល់ជូនផ្លាកសញ្ញាអាចចំណាយពេលយូរបន្តិច។';
$string['awards'] = 'អ្នកទទួល';
$string['backpackavailability'] = 'ការផ្ទៀងផ្ទាត់ផ្លាកសញ្ញាពីខាងក្រៅ';
$string['backpackavailability_help'] = 'ដើម្បីឲ្យអ្នកទទួលផ្លាកសញ្ញាអាចបញ្ជាក់ថាពួកគេពិតជាទទួលបានផ្លាកសញ្ញាពីអ្នកមែននោះ សេវាកម្មកាបូបស្ពាយខាងក្រៅគួរតែអាចចូលទៅកាន់តំបន់បណ្តាញរបស់អ្នកនិងអាចផ្ទៀងផ្ទាត់ផ្លាកសញ្ញាដែលបានចេញពីវា។ នៅពេលនេះតំបន់បណ្តាញរបស់អ្នកអាចត្រូវបានចូលដំណើរការបានទេ ដូចនេះផ្លាកសញ្ញាដែលអ្នកបានប្រគល់ឲ្យ ឬនឹងប្រគល់ឲ្យនៅពេលអនាគតមិនអាចផ្ទៀងផ្ទាត់បានទេ។

** ហេតុអ្វីខ្ញុំឃើញសារនេះ? **
វាប្រហែលជា
- របាំងការពាររបស់អ្នករារាំងការចូលប្រើពីអ្នកប្រើក្រៅបណ្តាញរបស់អ្នក
- តំបន់បណ្ដាញរបស់អ្នកត្រូវបានការពារដោយពាក្យសម្ងាត់
- ឬអ្នកកំពុងដំណើរការតំបន់បណ្ដាញនៅលើកុំព្យូទ័រដែលមិនមានអ៊ិនធឺណិត (ដូចជាម៉ាស៊ីនសម្រាប់អភិវឌ្ឍន៏) ។

** តើនេះគឺជាបញ្ហាដែរឬទេ? **
អ្នកគួរតែដោះស្រាយបញ្ហានេះនៅលើតំបន់បណ្តាញផលិតកម្មណាដែលអ្នកគ្រោងនឹងចេញផ្លាកសញ្ញា បើមិនដូច្នោះទេអ្នកទទួលមិនអាចបញ្ជាក់ថាពួកគេពិតជាទទួលបានផ្លាកសញ្ញាពីអ្នកទេ។ ប្រសិនបើតំបន់បណ្ដាញរបស់អ្នកមិនទាន់ដំណើរជាសារធារណៈ អ្នកអាចបង្កើតនិងចេញផ្លាកសញ្ញាសាកល្បង ដរាបណាគេហទំព័រនេះអាចចូលមើលបានមុនពេលអ្នកដាក់វាដំណើរការជាសារធារណៈ។

** តើធ្វើដូចម្តេច ប្រសិនបើខ្ញុំមិនអាចធ្វើឱ្យគេហទំព័រទាំងមូលរបស់ខ្ញុំអាចចូលប្រើជាសាធារណៈបានទេ? **
URL តែមួយដែលតម្រូវឱ្យមានការបញ្ជាក់គឺ [your-site-url]/badges/assertion.php ដូច្នេះប្រសិនបើអ្នកអាចកែប្រែរបាំងការពារ firewall របស់អ្នក ឲ្យអនុញ្ញាតការចូលពីខាងក្រៅទៅឯកសារនោះ នោះការផ្ទៀងផ្ទាត់ផ្លាកសញ្ញានឹងនៅតែដំណើរការ។';
$string['backpackbadges'] = 'អ្នកមានផ្លាកសញ្ញា {$a->totalbadges} ដែលបានបង្ហាញពីបណ្តុំ {$a->totalcollections}។ <a href="mybackpack.php">ប្ដូរការកំណត់សម្រាប់កាបូបស្ពាយ</a>។';
$string['backpackcannotsendverification'] = 'មិនអាចផ្ញើសារផ្ទៀងផ្ទាត់បានទេ';
$string['backpackconnection'] = 'ការភ្ជាប់ទៅកាបូបស្ពាយ';
$string['backpackconnectioncancelattempt'] = 'ភ្ជាប់ដោយប្រើអាសយដ្ឋានអ៊ីម៉ែលផ្សេង';
$string['backpackconnectionconnect'] = 'ភ្ជាប់ទៅកាបូបស្ពាយ';
$string['backpackdetails'] = 'ការកំណត់សម្រាប់កាបូបស្ពាយ';
$string['backpackimport_help'] = 'បន្ទាប់ពីការភ្ជាប់កាបូបស្ពាយត្រូវបានបង្កើតឡើងដោយជោគជ័យ នោះផ្លាកសញ្ញាពីកាបូបស្ពាយរបស់អ្នកអាចត្រូវបានបង្ហាញនៅលើទំព័រផ្លាកសញ្ញារបស់អ្នកនិងទំព័រប្រវត្តិរូបរបស់អ្នក។

នៅទីនេះ អ្នកអាចជ្រើសរើសបណ្តុំផ្លាកសញ្ញាពីកាបូបស្ពាយរបស់អ្នកដែលអ្នកចង់បង្ហាញនៅក្នុងទំព័រប្រវត្តិរូបរបស់អ្នក។';
$string['badgedetails'] = 'ព័ត៌មានអំពីផ្លាកសញ្ញា';
$string['badgeimage'] = 'រូបភាព';
$string['badgeimage_help'] = 'នេះគឺជារូបភាពដែលនឹងត្រូវបានប្រើនៅពេលផ្លាកសញ្ញានេះត្រូវបានប្រគល់ឲ្យសិស្ស។

ដើម្បីបន្ថែមរូបភាពថ្មី សូមរកមើល និងជ្រើសរូបភាព (ជាប្រភេទ JPG ឬ PNG) បន្ទាប់មកចុចលើ "រក្សាទុកការផ្លាស់ប្តូរ" ។ រូបភាពនឹងត្រូវបានច្រឹបទៅជាការ៉េនិងប្តូរទំហំឲ្យត្រូវនឹងទំហំស្តង់ដាររបស់ផ្លាកសញ្ញា។';
$string['badgeprivacysetting'] = 'ការកំណត់សមា្រប់ភាពឯកជននៃផ្លាកសញ្ញា';
$string['badgeprivacysetting_help'] = 'ផ្លាកសញ្ញាដែលអ្នកទទួល អាចត្រូវបានបង្ហាញនៅលើទំព័រប្រវត្តិរូបរបស់អ្នក។ ការកំណត់នេះអនុញ្ញាតឱ្យអ្នកកំណត់ដោយស្វ័យប្រវត្តិថាគេអាចមើលឃើញផ្លាកសញ្ញាដែលអ្នកទើបទទួលបានថ្មីឬយ៉ាងណា។

អ្នកនៅតែអាចកំណត់ពីភាពឯកជននៃផ្លាកសញ្ញានីមួយៗនៅលើទំព័រផ្លាកសញ្ញារបស់អ្នក។';
$string['badgeprivacysetting_str'] = 'បង្ហាញផ្លាកសញ្ញាដែលខ្ញុំបានទទួលនៅលើទំព័រប្រវត្តិរូបរបស់ខ្ញុំដោយស្វ័យប្រវត្តិ';
$string['badges'] = 'ផ្លាកសញ្ញា';
$string['badgesdisabled'] = 'ផ្លាកសញ្ញាមិនបានបើកឲ្យដំណើរការក្នុងតំបន់បណ្តាញនេះទេ។';
$string['badgesearned'] = 'ចំនួនផ្លាកសញ្ញាដែលទទួលបានៈ {$a}';
$string['badgesettings'] = 'ការកំណត់សម្រាប់ផ្លាកសញ្ញា';
$string['badgestatus_0'] = 'មិនមានសម្រាប់អ្នកប្រើទេ';
$string['badgestatus_1'] = 'មានសម្រាប់អ្នកប្រើ';
$string['badgestatus_2'] = 'មិនមានសម្រាប់អ្នកប្រើទេ';
$string['badgestatus_3'] = 'មានសម្រាប់អ្នកប្រើ';
$string['badgestatus_4'] = 'ទុកក្នុងប័ណ្ណសារ';
$string['badgestoearn'] = 'មានផ្លាកសញ្ញាចំនួន {$a}';
$string['badgesview'] = 'ផ្លាកសញ្ញាក្នុងវគ្គសិក្សា';
$string['bawards'] = 'អ្នកទទួល ({$a})';
$string['bcriteria'] = 'លក្ខណៈវិនិច្ឆ័យ';
$string['bdetails'] = 'កែប្រែព័ត៌មាន';
$string['bmessage'] = 'សារ';
$string['boverview'] = 'ព័ត៌មានទូទៅ';
$string['bydate'] = 'បញ្ចប់មុនថ្ងៃ';
$string['clearsettings'] = 'លុបការកំណត់';
$string['completioninfo'] = 'ផ្លាកសញ្ញានេះត្រូវបានប្រគល់ជូនសម្រាប់ការបញ្ចប់ៈ';
$string['completionnotenabled'] = 'ការបញ្ចប់វគ្គសិក្សាមិនត្រូវបានបើកសម្រាប់វគ្គសិក្សានេះទេដូច្នេះវាមិនអាចបញ្ចូលក្នុងលក្ខណៈវិនិច្ឆ័យទេ។ អ្នកអាចបើកការបញ្ចប់វគ្គសិក្សានៅក្នុងការកំណត់វគ្គសិក្សា។';
$string['configenablebadges'] = 'នៅពេលវាដំណើរការ អ្នកអាចបង្កើតផ្លាកសញ្ញា និងប្រគល់វាឲ្យទៅអ្នកប្រើក្នុងតំបន់បណ្តាញ';
$string['configuremessage'] = 'សារសម្រាប់ផ្លាកសញ្ញា';
$string['connect'] = 'ភ្ជាប់';
$string['connected'] = 'បានភ្ជាប់';
$string['connecting'] = 'កំពុងភ្ជាប់...';
$string['contact'] = 'ព័ត៌មានសម្រាប់ទាក់ទង';
$string['contact_help'] = 'អាសយដ្ឋានអ៊ីម៉ែលមួយដែលមានទំនាក់ទំនងជាមួយអ្នកចេញផ្លាកសញ្ញានេះ។';
$string['copyof'] = 'ច្បាប់ចម្លងនៃ {$a}';
$string['coursebadges'] = 'ផ្លាកសញ្ញា';
$string['coursebadgesdisabled'] = 'ផ្លាកសញ្ញាក្នុងវគ្គសិក្សាមិនត្រូវបានឲ្យដំណើរការក្នុងតំបន់បណ្តាញនេះទេ។';
$string['coursecompletion'] = 'អ្នកប្រើត្រូវបញ្ចប់វគ្គសិក្សានេះ';
$string['create'] = 'ផ្លាកសញ្ញាថ្មី';
$string['createbutton'] = 'បង្កើតផ្លាកសញ្ញា';
$string['creatorbody'] = '<p>{$a->user} បានបំពេញការទាមទារទាំងអស់សម្រាប់ផ្លាកសញ្ញា ហើយបានទទួលផ្លាកសញ្ញា. មើលផ្លាកសញ្ញាដែលបានប្រគល់នៅ {$a->link} </p>';
$string['creatorsubject'] = '\'{$a}\' ត្រូវបានប្រគល់ជូន។';
$string['criteria_0'] = 'ផ្លាកសញ្ញានេះត្រូវបានប្រគល់ជូននៅពេល...';
$string['criteria_1'] = 'ការបញ្ចប់សកម្មភាព';
$string['criteria_1_help'] = 'ផ្លាកសញ្ញានឹងត្រូវបានប្រគល់ជូនដល់អ្នកប្រើដោយផ្អែកលើការបញ្ចប់នៃសំណុំសកម្មភាពនៅក្នុងវគ្គសិក្សា។';
$string['criteria_2'] = 'ប្រគល់ឲ្យដោយផ្ទាល់';
$string['criteria_2_help'] = 'ផ្លាកសញ្ញានឹងត្រូវបានប្រគល់ជូនដល់អ្នកប្រើដោយផ្ទាល់ពីអ្នកដែលមានតួនាទីជាក់លាក់មួយក្នុងតំបន់បណ្តាញ ឬក្នុងវគ្គសិក្សា។';
$string['criteria_3'] = 'ការចូលរួមក្នុងសង្គម';
$string['criteria_3_help'] = 'ក្នុងសង្គម';
$string['criteria_4'] = 'ការបញ្ចប់វគ្គសិក្សា';
$string['criteria_4_help'] = 'អនុញ្ញាតឲ្យផ្លាកសញ្ញាអាចនឹងត្រូវបានប្រគល់ជូនដល់អ្នកប្រើដែលបានបញ្ចប់វគ្គសិក្សា។ លក្ខណៈវិនិច្ឆ័យនេះអាចមានកត្តាមួយចំនួនទៀតដូចជាពិន្ទុអប្បរមា និងការបរិច្ឆេទការបញ្ចប់វគ្គសិក្សា។';
$string['criteria_5_help'] = 'អនុញ្ញាតឲ្យផ្លាកសញ្ញាអាចនឹងត្រូវបានប្រគល់ជូនដល់អ្នកប្រើដែលបានបញ្ចប់សំនុំវគ្គសិក្សា។ វគ្គសិក្សានីមួយៗអាចមានកត្តាមួយចំនួនទៀតដូចជាពិន្ទុអប្បបរមា និងកាលបរិច្ឆេទនៃការបញ្ចប់វគ្គសិក្សា។';
$string['criteria_6_help'] = 'ផ្លាកសញ្ញានឹងត្រូវបានប្រគល់ជូនដល់អ្នកប្រើដែលបានផ្តល់ព័ត៌មានជាក់លាក់ណាមួយក្នុងទំព័រប្រវត្តិរូបរបស់គេ។ អ្នកអាចជ្រើសរើសប្រអប់ទិន្នន័យណាខ្លះដែលអ្នកប្រើត្រូវតែបំពេញដើម្បីទទួលបានផ្លាកសញ្ញា។';
$string['criteriacreated'] = 'លក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញាត្រូវបានបង្កើតបានសម្រេច';
$string['criteriadeleted'] = 'លក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញាត្រូវបានលុបចេញបានសម្រេច';
$string['criteria_descr'] = 'អ្នកប្រើទទួលបានផ្លាកសញ្ញានេះនៅពេលដែលគេបំពេលការទាមទារខាងក្រោមៈ';
$string['criteria_descr_2'] = 'ផ្លាកសញ្ញានេះត្រូវបានផ្តល់ដោយអ្នកប្រើដែលមានតួនាទី <strong>{$a}</strong>ខាងក្រោម:';
$string['criteria_descr_single_1'] = 'សកម្មភាពដូចខាងក្រោមត្រូវតែបញ្ចប់:';
$string['criteriasummary'] = 'សេចក្តីសង្ខេបនៃលក្ខណៈវិនិច្ឆ័យ';
$string['criteriaupdated'] = 'លក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញាត្រូវបានកែប្រែបានសម្រេច';
$string['currentimage'] = 'រូបភាពបច្ចុប្បន្ន';
$string['dateawarded'] = 'ប្រគល់នៅថ្ងៃ';
$string['defaultissuercontact_desc'] = 'អាសយដ្ឋានអ៊ីម៉ែលមួយដែលមានទំនាក់ទំនងជាមួយអ្នកចេញផ្លាកសញ្ញានេះ។';
$string['defaultissuername'] = 'ឈ្មោះអ្នកចេញផ្លាកសញ្ញាលំនាំដើម';
$string['defaultissuername_desc'] = 'ឈ្មោះភ្នាក់ងារឬអាជ្ញាធរដែលចេញផ្លាកសញ្ញានេះ។';
$string['delbadge'] = 'តើអ្នកចង់លុបផ្លាកសញ្ញា \'{$a}\' និងលុបផ្លាកសញ្ញាទាំងអស់ដែលបានប្រគល់ឲ្យសិស្សហើយដែរឬទេ?';
$string['delconfirm'] = 'លុប និងដកចេញនូវផ្លាកសញ្ញាទាំងអស់ដែលបានប្រគល់ឲ្យសិស្សហើយ';
$string['delcritconfirm'] = 'តើអ្នកពិតជាចង់លុបលក្ខណៈវិនិច្ឆ័យនេះមែនទេ?';
$string['deletehelp'] = '<p>លុបផ្លាកសញ្ញាទាំងស្រុងមានន័យថារាល់ព័ត៌មាន និងកំណត់ត្រាលក្ខណៈវិនិច្ឆ័យទាំងអស់នឹងត្រូវលុបចេញជាដរាប។ អ្នកប្រើដែលទទួលបានផ្លាកសញ្ញានេះនឹងមិនអាចមើលវា និងបង្ហាញវានៅលើទំព័រប្រវត្តិរូបរបស់គេឡើយ។</p>
<p>ចំណាំ៖ ចំពោះអ្នកប្រើដែលបានទទួលផ្លាកសញ្ញានេះហើយ និងបានទាញយកវាទៅដាក់ក្នុងកាបូបស្ពាយខាងក្រៅ (external backpack) ពួកគេនៅតែមានផ្លាកសញ្ញានេះនៅក្នុងកាបូបស្ពាយនោះ។ ទោះជាយ៉ាងណាក៏ដោយ ពួកគេនឹងមិនអាចមើលទំព័រលក្ខណៈវិនិច្ឆ័យ និងភស្តុតាងដែលភ្ជាប់ជាមួយទំព័រនេះឡើយ។</p>';
$string['delparamconfirm'] = 'តើអ្នកពិតជាចង់លុបប៉ារ៉ាម៉ែត្រនេះមែនទេ?';
$string['description'] = 'សេចក្តីពិពណ៌នា';
$string['error:invalidcriteriatype'] = 'ប្រភេទលក្ខណៈវិនិច្ឆ័យមិនត្រឹមត្រូវ';
$string['error:invalidexpiredate'] = 'កាលបរិច្ឆេទផុតកំណត់ត្រូវតែស្ថិតក្នុងពេលអនាគត។';
$string['error:noactivities'] = 'មិនមានសកម្មភាពដែលមានលក្ខណៈវិនិច្ឆ័យក្នុងការបញ្ចប់ក្នុងវគ្គសិក្សានេះទេ';
$string['error:nocourses'] = 'ការបញ្ចប់វគ្គសិក្សាមិនត្រូវបានបើកសម្រាប់វគ្គសិក្សានេះទេដូច្នេះវាមិនអាចបញ្ចូលក្នុងលក្ខណៈវិនិច្ឆ័យទេ។ អ្នកអាចបើកការបញ្ចប់វគ្គសិក្សានៅក្នុងការកំណត់វគ្គសិក្សា។';
$string['error:nopermissiontoview'] = 'អ្នកមិនមានសិទ្ធិមើលអ្នកទទួលផ្លាកសញ្ញាទេ។';
$string['error:notifycoursedate'] = 'សូមប្រយ័ត្នព្រោះផ្លាកសញ្ញាដែលទាក់ទងនឹងការបញ្ចប់វគ្គសិក្សា និងសកម្មភាព នឹងមិនត្រូវប្រគល់ឲ្យសិស្សទេទាល់តែដល់ការបរិច្ឆេទចាប់ផ្តើមវគ្គសិក្សា។';
$string['error:save'] = 'មិនអាចរក្សាទុកផ្លាកសញ្ញាទេ';
$string['eventbadgecriteriacreated'] = 'លក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញានេះត្រូវបានបង្កើត';
$string['eventbadgecriteriadeleted'] = 'លក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញានេះត្រូវបានលុបចេញ';
$string['eventbadgecriteriaupdated'] = 'លក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញានេះត្រូវបានកែប្រែ';
$string['existingrecipients'] = 'អ្នកទទួលបានផ្លាកសញ្ញាបច្ចុប្បន្ន';
$string['expirydate'] = 'កាលបរិច្ឆេទផុតកំណត់';
$string['expirydate_help'] = 'ផ្លាកសញ្ញាអាចផុតកំណត់នៅថ្ងៃជាក់លាក់មួយ ។ កាលបរិច្ឆេទផុតកំណត់ក៏អាចគណនាដោយផ្អែកលើកាលបរិច្ឆេទដែលផ្លាកសញ្ញានេះត្រូវបានចេញឱ្យអ្នកប្រើដែរ។';
$string['externalbadges'] = 'ផ្លាកសញ្ញារបស់ខ្ញុំពីវេបសាយដទៃ';
$string['externalbadges_help'] = 'នេះជាទីសម្រាប់បង្ហាញផ្លាកសញ្ញាពីកាបូបស្ពាយខាងក្រៅរបស់អ្នក។';
$string['externalbadgesp'] = 'ផ្លាកសញ្ញាពីវេបសាយដទៃ';
$string['externalconnectto'] = 'ដើម្បីបង្ហាញផ្លាកសញ្ញាខាងក្រៅអ្នកត្រូវ<a href="{$a}">ភ្ជាប់ជាមួយនឹងកម្មវិធីកាបូបស្ពាយមួយ</a>។';
$string['fixed'] = 'កាលបរិច្ឆេទជាក់លាក់';
$string['issuancedetails'] = 'ការផុតកំណត់របស់ផ្លាកសញ្ញា';
$string['issuerdetails'] = 'ព័ត៌មានអំពីអ្នកចេញផ្លាកសញ្ញា';
$string['issuername'] = 'ឈ្មោះអ្នកចេញផ្លាកសញ្ញា';
$string['issuername_help'] = 'ឈ្មោះភ្នាក់ងារឬអាជ្ញាធរដែលចេញផ្លាកសញ្ញានេះ។';
$string['localbadges'] = 'ផ្លាកសញ្ញារបស់ខ្ញុំពី {$a}';
$string['localbadgesh'] = 'ផ្លាកសញ្ញារបស់ខ្ញុំពីវេបសាយនេះ';
$string['localbadgesh_help'] = '
ផ្លាកសញ្ញាទាំងអស់ដែលអ្នកទទួលបានក្នុងតំបន់បណ្ដាញនេះតាមរយៈការបញ្ចប់វគ្គសិក្សា ការបញ្ចប់សកម្មភាព និង កត្តាចាំបាច់មួយចំនួនទៀត។

អ្នកអាចគ្រប់គ្រងផ្លាកសញ្ញារបស់អ្នកនៅទីនេះបាន ដូចជាបង្ហាញវាជាសាធារណ ឬទុកជាឯកជនក្នុងទំព័រប្រវត្តិរូបរបស់អ្នក។

អ្នកអាចទាញយកផ្លាកសញ្ញាទាំងអស់ ឬផ្លាកសញ្ញាណាមួយ ហើយរក្សាវាទុកក្នុងកុំព្យូទ័ររបស់អ្នក។ អ្នកអាចដាក់ផ្លាកសញ្ញាទាំងនោះក្នុងសេវាកាបូបស្ពាយខាងក្រៅរបស់អ្នក (external backpack)។';
$string['localbadgesp'] = 'ផ្លាកសញ្ញាពី {$a}:';
$string['managebadges'] = 'គ្រប់គ្រងផ្លាកសញ្ញា';
$string['message'] = 'តួសេចក្តីរបស់សារ';
$string['messagebody'] = '<p> អ្នកបានទទួលផ្លាកសញ្ញា "%badgename%"! </p>
<p> ព័ត៌មានបន្ថែមអំពីផ្លាកសញ្ញានេះអាចរកបាននៅលើទំព័រព័ត៌មាន %badgelink% ។ </p>
<p> អ្នកអាចគ្រប់គ្រងនិងទាញយកផ្លាកសញ្ញាពីទំព័រ {$a} របស់អ្នក។ </p>';
$string['messagesubject'] = 'អបអរសាទរ! អ្នកទើបតែទទួលបានផ្លាកសញ្ញាមួយ!';
$string['method'] = 'លក្ខណៈវិនិច្ឆ័យនេះត្រូវបំពេញនៅពេលដែល...';
$string['mingrade'] = 'ទាមទារពិន្ទុយ៉ាងតិច';
$string['never'] = 'មិនកំណត់';
$string['newbadge'] = 'បន្ថែមផ្លាកសញ្ញាថ្មីមួយ';
$string['newimage'] = 'រូបភាពថ្មី';
$string['noawards'] = 'មិនទាន់មានអ្នកទទួលបានផ្លាកសញ្ញានេះទេ។';
$string['nobadges'] = 'មិនមានផ្លាកសញ្ញាទេ';
$string['nocriteria'] = 'លក្ខណៈវិនិច្ឆ័យសម្រាប់ផ្លាកសញ្ញានេះមិនទាន់ត្រូវបានកំណត់នៅឡើយទេ។';
$string['noexpiry'] = 'ផ្លាកសញ្ញានេះមិនមានកាលបរិច្ឆេទផុតកំណត់ទេ។';
$string['notconnected'] = 'មិនបានភ្ជាប់';
$string['nothingtoadd'] = 'មិនមានលក្ខណៈវិនិច្ឆ័យសម្រាប់បន្ថែមទេ';
$string['notification'] = 'ជូនដំណឹងដល់អ្នកបង្កើតផ្លាកសញ្ញា';
$string['notification_help'] = 'កំណត់ការជូនដំណឹងដែលនឹងត្រូវផ្ញើទៅអ្នកបង្កើតផ្លាកសញ្ញាដើម្បីឲ្យគេដឹងថាផ្លាកសញ្ញាត្រូវបានប្រគល់ឲ្យសិស្ស។';
$string['notifydaily'] = 'មួយថ្ងៃម្តង';
$string['notifyevery'] = 'គ្រប់ពេលផ្លាកសញ្ញាត្រូវបានប្រគល់';
$string['notifymonthly'] = 'មួយខែម្តង';
$string['notifyweekly'] = 'មួយសប្តាហ៌ម្តង';
$string['overallcrit'] = 'ក្នុងចំណោមលក្ខណៈវិនិច្ឆ័យដែលបានជ្រើសរើសគឺបានបំពេញ';
$string['potentialrecipients'] = 'អ្នកដែលទំនងនឹងទទួលបានផ្លាកសញ្ញា';
$string['preferences'] = 'ការកំណត់សម្រាប់ផ្លាកសញ្ញា';
$string['recipientdetails'] = 'ព័ត៌មានអំពីអ្នកទទួល';
$string['recipients'] = 'អ្នកទទួលបានផ្លាកសញ្ញា';
$string['relative'] = 'ពេលវេលា';
$string['reviewconfirm'] = '<p>ការធ្វើបែបនេះនឹងធ្វើឱ្យគេអាចមើលឃើញផ្លាកសញ្ញារបស់អ្នក ហើយពួកគេអាចចាប់ផ្ដើមទទួលវាបាន។ </p>

<p>អ្នកប្រើមួយចំនួនប្រហែលជាបានបំពេញតាមលក្ខណៈវិនិច្ឆ័យរបស់ផ្លាកសញ្ញានេះរួចទៅហើយ ហើយពួកគេនឹងទទួលបានផ្លាកសញ្ញានេះភ្លាមៗបន្ទាប់ពីអ្នកបើកឲ្យវាដំណើរការ។ </p>

<p>នៅពេលផ្លាកសញ្ញាត្រូវបានប្រគល់ឲ្យនរណាម្នាក់ហើយ វានឹងត្រូវបាន<strong>ជាប់សោ</strong> ។ នេះមានន័យថាការកំណត់មួយចំនួនរួមមាន លក្ខណៈវិនិច្ឆ័យ និងការកំណត់អំពីការផុតកំណត់ មិនអាចប្តូរបានទៀតទេ។</p>

<p>តើអ្នកប្រាកដជាចង់ដាក់ដំណើរការផ្លាកសញ្ញា \'{$a}\' នេះមែនទេ?</p>';
$string['save'] = 'រក្សាទុក';
$string['searchname'] = 'ស្វែងរកតាមឈ្មោះ';
$string['status'] = 'ស្ថានភាពរបស់ផ្លាកសញ្ញា';
$string['statusmessage_0'] = 'ផ្លាកសញ្ញានេះមិនទាន់អាចប្រើបាននៅឡើយទេ។ សូមដាក់វាឲ្យដំណើរការ ប្រសិនបើអ្នកចង់ឲ្យអ្នកប្រើអាចទទួលបានផ្លាកសញ្ញានេះ។';
$string['statusmessage_2'] = 'ផ្លាកសញ្ញានេះមិនអាចប្រើបានទេពេលនេះ ហើយលក្ខណៈវិនិច្ឆ័យរបស់វាត្រូវបានចាក់សោ។ សូមធ្វើការអនុញ្ញាតឲ្យវាដំណើរការ ប្រសិនបើអ្នកចង់ឱ្យអ្នកប្រើអាចទទួលបានផ្លាកសញ្ញានេះ។';
$string['statusmessage_3'] = 'ផ្លាកសញ្ញានេះអាចប្រើប្រាស់បាន ហើយលក្ខណៈវិនិច្ឆ័យរបស់វាត្រូវបានចាក់សោ។';
$string['subject'] = 'ប្រធានបទរបស់សារ';
$string['variablesubstitution_help'] = 'នៅក្នុងសារនេះ អ្នកអាចបញ្ចូលអថេរមួយចំនួនទៅក្នុងប្រធានបទនិង / ឬតួសេចក្តីនៃសារ។ អថេរទាំងនេះនឹងត្រូវបានជំនួសដោយតម្លៃពិតនៅពេលដែលសារត្រូវបានផ្ញើចេញ។ អថេរគួរតែត្រូវបានបញ្ចូលទៅក្នុងអត្ថបទដូចដែលបានបង្ហាញខាងក្រោម។

%badgename%
: នឹងត្រូវជំនួសដោយឈ្មោះពេញរបស់ផ្លាកសញ្ញា។

%username%
: នឹងត្រូវជំនួសដោយឈ្មោះពេញរបស់អ្នកទទួល។

%badgelink%
: នឹងត្រូវជំនួសដោយ URL សាធារណៈមួយ ជាមួយព័ត៌មានអំពីផ្លាកសញ្ញាដែលបានប្រគល់ឲ្យ។';
