<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'mnet', language 'km', branch 'MOODLE_36_STABLE'
 *
 * @package   mnet
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['aboutyourhost'] = 'អំពីម៉ាស៊ីនបម្រើរបស់អ្នក';
$string['accesslevel'] = 'កម្រិតចូលដំណើរការ';
$string['addhost'] = 'បន្ថែមម៉ាស៊ីន';
$string['addnewhost'] = 'បន្ថែមម៉ាស៊ីនថ្មី';
$string['addtoacl'] = 'បន្ថែមទៅការត្រួតពិនិត្យការចូលដំណើរការ';
$string['allow'] = 'អនុញ្ញាត';
$string['authfail_nosessionexists'] = 'ការផ្ដល់សេចក្ដីអនុញ្ញាតបានបរាជ័យ ៖ មិនមានសម័យ mnet ទេ ។';
$string['authfail_sessiontimedout'] = 'ការផ្ដល់សេចក្ដីអនុញ្ញាតបានបរាជ័យ ៖ សម័យ mnet បានអស់ពេល ។';
$string['authfail_usermismatch'] = 'ការផ្ដល់សេចក្ដីអនុញ្ញាតបានបរាជ័យ ៖ អ្នកប្រើមិនផ្គូផ្គងគ្នាទេ ។';
$string['authmnetdisabled'] = 'ការផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវក្នុងការតបណ្ដាញ Moodle ត្រូវបានបិទ ។';
$string['badcert'] = 'នេះមិនមែនជាវិញ្ញាបនបត្រត្រឹមត្រូវទេ ។';
$string['couldnotgetcert'] = 'រកមិនឃើញវិញ្ញាបនបត្រនៅ <br />{$a} ទេ ។ <br />ម៉ាស៊ីនអាចគាំង ឬកំណត់រចនាសម្ព័ន្ធមិនត្រឹមត្រូវ ។';
$string['couldnotmatchcert'] = 'វាមិនផ្គូផ្គងនឹងវិញ្ញាបនបត្របច្ចុប្បន្នដែលចេញផ្សាយដោយម៉ាស៊ីនបម្រើតំបន់បណ្ដាញនៅពេលបច្ចុប្បន្នទេ ។';
$string['courses'] = 'វគ្គសិក្សា';
$string['courseson'] = 'វគ្គសិក្សាលើ';
$string['currentkey'] = 'កូនសោរសាធារណៈបច្ចុប្បន្ន';
$string['current_transport'] = 'ការដឹកជញ្ជូនបច្ចុប្បន្ន';
$string['databaseerror'] = 'មិនអាចសរសេរសេចក្ដីលម្អិតទៅមូលដ្ឋានទិន្នន័យបានឡើយ ។';
$string['deleteaserver'] = 'លុបម៉ាស៊ីនបម្រើ';
$string['deletehost'] = 'លុបម៉ាស៊ីន';
$string['deletekeycheck'] = 'តើអ្នកពិតជាចង់លុបកូនសោនេះឬ ?';
$string['deleteoutoftime'] = 'បង្អួច ៦០ វិនាទីរបស់អ្នកសម្រាប់លុបកូនសោនេះបានផុតកំណត់ ។ សូមចាប់ផ្ដើមម្ដងទៀត ។';
$string['deleteuserrecord'] = 'SSO ACL ៖ លុបកំណត់ត្រាសម្រាប់អ្នកប្រើ \'{$a}[0]\' ពី {$a}[1] ។';
$string['deletewrongkeyvalue'] = 'កំហុសមួយបានកើតឡើង ។ ប្រសិនបើអ្នកមិនលុបកូនសោ SSL របស់ម៉ាស៊ីនបម្រើរបស់អ្នកទេ \'.
\'អ្នកអាចនឹងពាក់ព័ន្ធការវាយប្រហាររំខានពីនរណាម្នាក់ ។ គ្មានសកម្មភាពដែលបានជ្រើសឡើយ ។';
$string['deny'] = 'បដិសេធ';
$string['description'] = 'ការពិពណ៌នា';
$string['duplicate_usernames'] = 'យើងបានបរាជ័យក្នុងការបង្កើតលិបិក្រមលើជួរឈរ "mnethostid" និង "ឈ្មោះអ្នកប្រើ" ក្នុងតារាងអ្នកប្រើ ។<br />\'.
\'វាអាចកើតឡើងនៅពេលអ្នកមាន<a href="{$a}" target="_blank">ឈ្មោះអ្នកប្រើស្ទួននៅក្នុងតារាងអ្នកប្រើរបស់អ្នក</a> ។<br />\'.
\'ការធ្វើឲ្យប្រសើររបស់អ្នកគឺនៅតែអាចបញ្ចប់ដោយជោគជ័យ ។ ចុចលើតំណខាងលើ និងសេចក្ដីណែនាំអំពីការជួសជុល\' ។
\'បញ្ហានេះនឹងលេចឡើងក្នុងបង្អួចថ្មី ។ អ្នកអាចចូលរួមបាននៅចុងបញ្ចប់នៃការធ្វើឲ្យប្រសើរ ។<br />';
$string['enabled_for_all'] = '(សេវានេះបានបើកសម្រាប់ម៉ាស៊ីនទាំងអស់) ។';
$string['enterausername'] = 'សូមបញ្ចូលឈ្មោះអ្នកប្រើ ឬបញ្ជីឈ្មោះអ្នកប្រើដោយបំបែកដោយសញ្ញាក្បៀស ។';
$string['error7020'] = 'កំហុសនេះជាធម្មតាកើតឡើង បើម៉ាស៊ីនពីចម្ងាយបានបង្កើតកំណត់ត្រាសម្រាប់អ្នកដែលមាន wwwroot ខុស, ឧទាហរណ៍ http://yoursite.com ជំនួសឲ្យ http://www.yoursite.com ។ អ្នកគួរតែទាក់ទងអ្នកគ្រប់គ្រងរបស់តំបន់បណ្ដាញពីចម្ងាយជាមួយ wwwroot របស់អ្នក (ដូចបានបញ្ជាក់ក្នុង config.php) សូមឲ្យវាធ្វើឲ្យកំណត់ត្រារបស់វាទាន់សម័យសម្រាប់ម៉ាស៊ីនរបស់អ្នក ។';
$string['error7022'] = 'សារដែលអ្នកផ្ញើទៅតំបន់បណ្ដាញពីចម្ងាយត្រូវបានអ៊ីនគ្រីបយ៉ាងត្រឹមត្រូវ ។ វានឹកស្មានមិនដល់';
$string['error7023'] = 'តំបន់បណ្ដាញពីចម្ងាយបានព្យាយាមឌីគ្រីបសាររបស់អ្នកជាមួយកូនសោ ដែលវាមាននៅលើកំណត់ត្រាសម្រាប់តំបន់បណ្ដាញរបស់អ្នក ។ ពួកវាទាំអស់បរាជ័យ ។ អ្នកប្រហែលជាអាចជួសជុលបញ្ហានេះដោយកំណត់កូនសោដោយដៃជាមួយតំបន់បណ្ដាញពីចម្ងាយ ។ នេះហាក់ដូចជាមិនកើតឡើងទេ ទាល់តែអ្នកមិនបានទាក់ទងជាមួយម៉ាស៊ីនពីចម្ងាយជាច្រើនខែ ។';
$string['error7024'] = 'អ្នកបានផ្ញើសារដែលមិនបានអ៊ីនគ្រីបទៅតំបន់បណ្ដាញពីចម្ងាយ ប៉ុន្តែតំបន់បណ្ដាញពីចម្ងាយមិនទទួលការទំនាក់ទំនងដែលមិនបានអ៊ីនគ្រីបពីតំបន់បណ្ដាញរបស់អ្នកទេ ។ វានឹកស្មានមិនដល់';
$string['error7026'] = 'កូនសោដែលសាររបស់អ្នកបានចុះហត្ថលេខាជាមួយ ខុសពីកូនសោដែលម៉ាស៊ីនពីចម្ងាយមាននៅលើឯកសារសម្រាប់ម៉ាស៊ីនបម្រើរបស់អ្នក ។ លើសពីនេះ ម៉ាស៊ីនពីចម្ងាយប៉ុនប៉ងទៅយកកូនសោបច្ចុប្បន្នរបស់អ្នក ប៉ុន្តែបរាជ័យ ។ សូមកំណត់កូនសោឡើងវិញដោយដៃជាមួយម៉ាស៊ីនពីចម្ងាយ និងព្យាយាមម្ដងទៀត ។';
$string['error709'] = 'តំបន់បណ្ដាញពីចម្ងាយបរាជ័យក្នុងការទទួលកូនសោ SSL ពីអ្នក ។';
$string['expired'] = 'កូនសោនេះផុតកំណត់នៅ';
$string['expires'] = 'ត្រឹមត្រូវរហូតដល់';
$string['expireyourkey'] = 'លុបកូនសោនេះ';
$string['expireyourkeyexplain'] = 'Moodle បង្វិលកូនសោរបស់អ្នកដោយស្វ័យប្រវត្តិនៅរាល់ ២៨ ថ្ងៃ (តាមលំនាំដើម) ប៉ុន្តែអ្នកអាចមានជម្រើស \'.
\'ធ្វើឲ្យកូនសោនេះផុតកំណត់<em>ដោយដៃ</em>នៅពេលណាមួយបាន ។ វានឹងមានប្រយោជន៍ បើអ្នកជឿទុកចិត្តវា \'.
\'កូនសោត្រូវបានសម្រុះសម្រួល ។ ការជំនួសនឹងត្រូវបានបង្កើតដោយស្វ័យប្រវត្តិភ្លាមៗ ។<br />\'.
\'ការលុបកូនសោនេះនឹងធ្វើឲ្យវាអាចមានសម្រាប់ Moodle ផ្សេងទៀតដើម្បីទាក់ទងជាមួយអ្នក រហូតទាល់តែអ្នក \'.
\'ទាក់ទងអ្នកគ្រប់គ្រងនីមួយៗដោយដៃ និងផ្ដល់ឲ្យពួកគេនូវកូនសោថ្មីរបស់អ្នក ។';
$string['failedaclwrite'] = 'បរាជ័យក្នុងការសរសេរទៅបញ្ជីត្រួតពិនិត្យការចូលដំណើរការ MNET សម្រាប់អ្នកប្រើ \'{$a}\' ។';
$string['forbidden-function'] = 'មុខងារនោះមិនត្រូវបានបើកសម្រាប់ RPC ទេ ។';
$string['forbidden-transport'] = 'វិធីសាស្ត្រផ្ទេរដែលអ្នកកំពុងប្រើមិនត្រូវបានអនុញ្ញាតទេ ។';
$string['forcesavechanges'] = 'តម្រូវឲ្យរក្សាទុកការផ្លាស់ប្ដូរ';
$string['helpnetworksettings'] = 'កំណត់រចនាសម្ព័ន្ធអន្តរទំនាក់ទំនង Moodle';
$string['hidelocal'] = 'លាក់អ្នកប្រើមូលដ្ឋាន';
$string['hideremote'] = 'លាក់អ្នកប្រើពីចម្ងាយ';
$string['host'] = 'ម៉ាស៊ីន';
$string['hostcoursenotfound'] = 'រកមិនឃើញម៉ាស៊ីន ឬវគ្គសិក្សាឡើយ';
$string['hostdeleted'] = 'យល់ព្រម - បានលុបម៉ាស៊ីន';
$string['hostexists'] = 'មានកំណត់ត្រារួចហើយសម្រាប់ម៉ាស៊ីននោះ និងការអភិវឌ្ឍ Moodle ដែលមានលេខសម្គាល់ {$a} ។<br />ចុចលើ <em>បន្ត</em> ដើម្បីកែសម្រួលកំណត់ត្រានោះ ។';
$string['hostname'] = 'ឈ្មោះម៉ាស៊ីន';
$string['hostnamehelp'] = 'ឈ្មោះដែនដែលមានគុណភាពពេញលេញនៃម៉ាស៊ីនពីចម្ងាយ ឧ. www.example.com';
$string['hostnotconfiguredforsso'] = 'Hub របស់ Moodle ពីចម្ងាយនេះមិនត្រូវបានកំណត់រចនាសម្ព័ន្ធសម្រាប់ការចូលពីចម្ងាយទេ ។';
$string['hostsettings'] = 'ការកំណត់ម៉ាស៊ីន';
$string['http_self_signed_help'] = 'អនុញ្ញាតការតភ្ជាប់ដោយប្រើវិញ្ញាបនបត្រ DIY SSL ដែលបានចុះហត្ថលេខាផ្ទាល់ខ្លួនលើម៉ាស៊ីនពីចម្ងាយ ។';
$string['https_self_signed_help'] = 'អនុញ្ញាតការតភ្ជាប់ដោយប្រើ DIY SSL ដែលចុះហត្ថលេខាផ្ទាល់ខ្លួនជា PHP លើម៉ាស៊ីនពីចម្ងាយតាមរយៈ http ។';
$string['https_verified_help'] = 'អនុញ្ញាតការតភ្ជាប់ដោយប្រើវិញ្ញាបនបត្រ SSL ដែលបានផ្ទៀងផ្ទាត់នៅលើម៉ាស៊ីនពីចម្ងាយ ។';
$string['http_verified_help'] = 'អនុញ្ញាតការតភ្ជាប់ដោយប្រើវិញ្ញាបនបត្រ SSL ដែលបានផ្ទៀងផ្ទាត់ជា PHP លើម៉ាស៊ីនពីចម្ងាយ ប៉ុន្តែតាមរយៈ http (មិនមែន https) ។';
$string['id'] = 'លេខសម្គាល់';
$string['idhelp'] = 'តម្លៃនេះត្រូវបានផ្ដល់ឲ្យដោយស្វ័យប្រវត្តិ និងមិនអាចផ្លាស់ប្ដូរបានទេ';
$string['invalidaccessparam'] = 'ប៉ារ៉ាម៉ែត្រចូលដំណើរការមិនត្រឹមត្រូវ ។';
$string['invalidactionparam'] = 'ប៉ារ៉ាម៉ែត្រសកម្មភាពមិនត្រឹមត្រូវ ។';
$string['invalidhost'] = 'អ្នកត្រូវតែផ្ដល់ឧបករណ៍សម្គាល់ម៉ាស៊ីនត្រឹមត្រូវ';
$string['invalidpubkey'] = 'កូនសោគឺមិនមែនជាកូនសោ SSL ត្រឹមត្រូវទេ ។';
$string['invalidurl'] = 'ប៉ារ៉ាម៉ែត្រ URL មិនត្រឹមត្រូវ ។';
$string['ipaddress'] = 'អាសយដ្ឋាន IP';
$string['is_in_range'] = 'អាសយដ្ឋាន IP  &nbsp';
$string['ispublished'] = '{$a} Moodle បានបើកសេវានេះសម្រាប់អ្នក ។';
$string['issubscribed'] = '{$a} Moodle កំពុងជាវជាប្រចាំសេវានេះលើម៉ាស៊ីនរបស់អ្នក ។';
$string['keydeleted'] = 'បានលុប និងជំនួសកូនសោរបស់អ្នកដោយជោគជ័យ ។';
$string['keymismatch'] = 'កូនសោសាធារណៈដែលអ្នកកំពុងកាន់សម្រាប់ម៉ាស៊ីននេះ គឺខុសគ្នាពីកូនសោសាធារណៈដែលវាកំពុងបោះពុម្ពផ្សាយបច្ចុប្បន្ន ។';
$string['last_connect_time'] = 'ពេលវេលាតភ្ជាប់ចុងក្រោយ';
$string['last_connect_time_help'] = 'ពេលវេលាដែលអ្នកបានតភ្ជាប់ចុងក្រោយទៅម៉ាស៊ីននេះ ។';
$string['last_transport_help'] = 'ការដឹកជញ្ជូនដែលអ្នកបានប្រើសម្រាប់ការតភ្ជាប់ចុងក្រោយទៅម៉ាស៊ីននេះ ។';
$string['loginlinkmnetuser'] = '<br/>ប្រសិនបើអ្នកជាអ្នកប្រើបណ្ដាញ Moodle ពីចម្ងាយ ហើយអាច<a href="{$a}">អះអាងអាសយដ្ឋានអ៊ីមែលរបស់អ្នកទីនេះ</a> អ្នកអាចត្រូវបានប្ដូរទិសទៅទំព័រចូលរបស់អ្នក ។<br />';
$string['logs'] = 'កំណត់ហេតុ';
$string['mnet'] = 'ការតបណ្ដាញ Moodle';
$string['mnet_concatenate_strings'] = 'ដាក់បន្តគ្នា (រហូតដល់) ខ្សែអក្សរ ៣ ហើយត្រឡប់លទ្ធផលវិញ';
$string['mnetdisabled'] = 'បណ្ដាញ Moodle គឺ<strong>ត្រូវបានបិទ</strong> ។';
$string['mnetpeers'] = 'ម៉ាស៊ីនដូចគ្នា';
$string['mnetservices'] = 'សេវាបណ្ដាញ Moodle';
$string['mnet_session_prohibited'] = 'បច្ចុប្បន្ន អ្នកប្រើពីម៉ាស៊ីនបម្រើមូលដ្ឋានរបស់អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យចូលទៅ {$a} ឡើយ ។';
$string['mnetsettings'] = 'ការកំណត់បណ្ដាញ Moodle';
$string['moodle_home_help'] = 'ផ្លូវទៅគេហទំព័ររបស់ Moodle លើម៉ាស៊ីនពីចម្ងាយ ឧ. /moodle/ ។';
$string['name'] = 'ឈ្មោះ';
$string['net'] = 'ការតបណ្ដាញ';
$string['networksettings'] = 'ការកំណត់បណ្ដាញ';
$string['never'] = 'កុំ';
$string['noaclentries'] = 'គ្មានធាតុក្នុងបញ្ជីត្រួតពិនិត្យការចូលដំណើរការ SSO ឡើយ ។';
$string['nocurl'] = 'មិនបានដំឡើងបណ្ណាល័យ Curl របស់ PHP ទេ';
$string['nolocaluser'] = 'គ្មានកំណត់ត្រាមូលដ្ឋានសម្រាប់អ្នកប្រើពីចម្ងាយទេ ។';
$string['nomodifyacl'] = 'អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យកែប្រែបញ្ជីត្រួតពិនិត្យការចូលដំណើរការ MNET ឡើយ ។';
$string['nonmatchingcert'] = 'ប្រធានបទនៃវិញ្ញាបនបត្រ ៖ <br /><em>{$a}[0]</em><br />មិនផ្គូផ្គងនឹងម៉ាស៊ីនដែលវាមកពី ៖<br /><em>{$a}[1]</em> ។';
$string['nopubkey'] = 'មានបញ្ហាក្នុងការទៅយកកូនសោសាធារណៈ ។<br />ប្រហែលជាម៉ាស៊ីនមិនអនុញ្ញាត ការតភ្ជាប់ Moodle ឬកូនសោមិនត្រឹមត្រូវ ។';
$string['nosite'] = 'មិនអាចរកវគ្គសិក្សាកម្រិតតំបន់បណ្ដាញបានទេ';
$string['nosuchfile'] = 'មិនមានឯកសារ/មុខងារ {$a} ទេ ។';
$string['nosuchfunction'] = 'មិនអាចដាក់ទីតាំងមុខងារ ឬមុខងារដែលបានហាមឃាត់សម្រាប់ RPC ។';
$string['nosuchmodule'] = 'មុខងារត្រូវបានដាក់អាសយដ្ឋានមិនត្រឹមត្រូវ ហើយមិនអាចដាក់ទីតាំងបាន ។ សូមប្រើទ្រង់ទ្រាយ mod/modulename/lib/functionname ។';
$string['nosuchpublickey'] = 'មិនអាចទទួលកូនសោសាធារណៈសម្រាប់ការបញ្ជាក់ហត្ថលេខាបានទេ ។';
$string['nosuchservice'] = 'សេវា RPC គឺមិនកំពុងរត់លើម៉ាស៊ីននេះទេ ។';
$string['nosuchtransport'] = 'មិនមានការដឹកជញ្ជូនដែលមាន ID នោះទេ ។';
$string['notBASE64'] = 'ខ្សែអក្សរនេះមិនមែនទ្រង់ទ្រាយដែលអ៊ីនកូដ Base64 ទេ ។ វាមិនអាចជាកូនសោត្រឹមត្រូវឡើយ ។';
$string['not_in_range'] = 'អាសយដ្ឋាន IP &nbsp';
$string['notPEM'] = 'កូនសោមិនមែនជាទ្រង់ទ្រាយ PEM ទេ ។ វានឹងមិនដំណើរការឡើយ ។';
$string['notpermittedtojump'] = 'អ្នកមិនមានសិទ្ធិដើម្បីចាប់ផ្ដើមសម័យពីចម្ងាយពី hub របស់ Moodle ទេ ។';
$string['notpermittedtoland'] = 'អ្នកមិនមានសិទ្ធិដើម្បីចាប់ផ្ដើមសម័យពីចម្ងាយទេ ។';
$string['off'] = 'បិទ';
$string['on'] = 'បើក';
$string['permittedtransports'] = 'បានអនុញ្ញាតការដឹកជញ្ជូន';
$string['phperror'] = 'កំហុស PHP ខាងក្នុងបានរារាំងសំណើដែលកំពុងត្រូវបានបំពេញ ។';
$string['postrequired'] = 'មុខងារលុបទាមទារសំណើ POST ។';
$string['promiscuous'] = 'រួមគ្នា';
$string['publickey'] = 'កូនសោសាធារណៈ';
$string['publickey_help'] = 'កូនសោសាធារណៈត្រូវបានទទួលដោយស្វ័យប្រវត្តិពីម៉ាស៊ីនបម្រើពីចម្ងាយ ។';
$string['publish'] = 'បោះពុម្ពផ្សាយ';
$string['reallydeleteserver'] = 'តើអ្នកពិតជាចង់លុបម៉ាស៊ីនបម្រើ';
$string['receivedwarnings'] = 'បានទទួលការព្រមានដូចខាងក្រោម';
$string['recordnoexists'] = 'មិនមានកំណត់ត្រាឡើយ ។';
$string['reenableserver'] = 'ទេ - ជ្រើសជម្រើសនេះដើម្បីបើកម៉ាស៊ីនបម្រើនេះឡើងវិញ ។';
$string['registerallhosts'] = 'ចុះឈ្មោះម៉ាស៊ីនទាំងអស់ (<em>របៀប Hub</em>)';
$string['registerallhostsexplain'] = 'អ្នកអាចជ្រើសចុះឈ្មោះម៉ាស៊ីនទាំងអស់ ដែលព្យាយាមតភ្ជាប់ទៅអ្នកដោយស្វ័យប្រវត្តិ ។
មានន័យថា កំណត់ត្រានឹងលេចឡើងក្នុងបញ្ជីម៉ាស៊ីនរបស់អ្នកសម្រាប់តំបន់ \'.
\'បណ្ដាញ Moodle ណាមួយដែលតភ្ជាប់ទៅអ្នក ហើយស្នើកូនសោសាធារណៈរបស់អ្នក ។<br />\'.
\'អ្នកមានជម្រើសខាងក្រោមដើម្បីកំណត់រចនាសម្ព័ន្ធសេវាសម្រាប់ \'ម៉ាស៊ីនទាំងអស់\' ហើយដោយបើកសេវាមួយចំនួននៅទីនោះ អ្នកអាចផ្ដល់សេវាទៅឲ្យ \'.
\'ម៉ាស៊ីនបម្រើ Moodle ណាមួយដោយមិនប្រកាន់ ។';
$string['remotecourses'] = 'វគ្គសិក្សាពីចម្ងាយ';
$string['remotehost'] = 'Hub ពីចម្ងាយ';
$string['remotehosts'] = 'ម៉ាស៊ីនពីចម្ងាយ';
$string['requiresopenssl'] = 'ការតបណ្ដាញទាមទារផ្នែកបន្ថែម OpenSSL';
$string['restore'] = 'ស្ដារ';
$string['reviewhostdetails'] = 'ពិនិត្យសេចក្ដីលម្អិតរបស់ម៉ាស៊ីនឡើងវិញ';
$string['reviewhostservices'] = 'ពិនិត្យសេវាម៉ាស៊ីនឡើងវិញ';
$string['RPC_HTTP_PLAINTEXT'] = 'HTTP មិនបានអ៊ីនគ្រីប';
$string['RPC_HTTP_SELF_SIGNED'] = 'HTTP (បានចុះហត្ថលេខាផ្ទាល់ខ្លួន)';
$string['RPC_HTTPS_SELF_SIGNED'] = 'HTTPS (បានចុះហត្ថលេខាផ្ទាល់ខ្លួន)';
$string['RPC_HTTPS_VERIFIED'] = 'HTTPS (បានចុះហត្ថលេខា)';
$string['RPC_HTTP_VERIFIED'] = 'HTTP (បានចុះហត្ថលេខា)';
$string['selectaccesslevel'] = 'សូមជ្រើសកម្រិតចូលដំណើរការពីបញ្ជី ។';
$string['selectahost'] = 'សូមជ្រើសម៉ាស៊ីន Moodle ពីចម្ងាយ ។';
$string['serviceswepublish'] = 'សេវាដែលយើងបោះពុម្ពផ្សាយទៅ {$a} ។';
$string['serviceswesubscribeto'] = 'សេវានៅលើ {$a} ដែលយើងជាវប្រចាំ ។';
$string['settings'] = 'ការកំណត់';
$string['showlocal'] = 'បង្ហាញអ្នកប្រើមូលដ្ឋាន';
$string['showremote'] = 'បង្ហាញអ្នកប្រើពីចម្ងាយ';
$string['ssl_acl_allow'] = 'SSO ACL ៖ អនុញ្ញាតអ្នកប្រើ {$a}[0] ពី {$a}[1]';
$string['ssl_acl_deny'] = 'SSO ACL ៖ បដិសេធអ្នកប្រើ {$a}[0] ពី {$a}[1]';
$string['ssoaccesscontrol'] = 'ការត្រួតពិនិត្យការចូលដំណើរការ SSO';
$string['ssoacldescr'] = 'ប្រើទំព័រនេះដើម្បីផ្ដល់/បដិសេធការចូលដំណើរការចំពោះអ្នកប្រើជាក់លាក់ពីម៉ាស៊ីនបណ្ដាញ Moodle ពីចម្ងាយ ។ នេះជាមុខងារពេលអ្នកកំពុងផ្ដល់សេវា SSO ទៅអ្នកប្រើពីចម្ងាយ ។ ដើម្បីត្រួតពិនិត្យសមត្ថភាពរបស់អ្នកប្រើ<em>មូលដ្ឋាន</em>ក្នុងការចូលទៅកាន់ម៉ាស៊ីមបណ្ដាញ Moodle ផ្សេងទៀត គឺត្រូវប្រើប្រព័ន្ធតួនាទីដើម្បីផ្ដល់សមត្ថភាព <em>mnetlogintoremote</em> ដល់ពួកគេ ។';
$string['ssoaclneeds'] = 'ដើម្បីឲ្យមុខងារនេះធ្វើការបាន អ្នកត្រូវតែបើកការតបណ្ដាញ Moodle រួមទាំងបើកកម្មវិធីជំនួយការផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវបណ្ដាញ Moodle ដោយបើកការបន្ថែមអ្នកប្រើដោយស្វ័យប្រវត្តិផងដែរ ។';
$string['strict'] = 'តឹងរ៉ឹង';
$string['subscribe'] = 'ជាវជាប្រចាំ';
$string['system'] = 'ប្រព័ន្ធ';
$string['testtrustedhosts'] = 'សាកល្បងអាសយដ្ឋាន';
$string['testtrustedhostsexplain'] = 'បញ្ចូលអាសយដ្ឋាន IP ដើម្បីមើលថាតើវាជាម៉ាស៊ីនដែលទុកចិត្តឬអត់ ។';
$string['transport_help'] = 'ជម្រើសទាំងនេះគឺទៅវិញទៅមក ដូច្នេះអ្នកអាចតម្រូវឲ្យម៉ាស៊ីនពីចម្ងាយប្រើវិញ្ញាបនបត្រ SSL ដែលបានចុះហត្ថលេខា ប្រសិនបើម៉ាស៊ីនបម្រើរបស់អ្នកមានវិញ្ញាបនបត្រ SSL ដែលបានចុះហត្ថលេខាដែរនោះ ។';
$string['trustedhosts'] = 'ម៉ាស៊ីន XML-RPC';
$string['trustedhostsexplain'] = '<p>យន្តកម្មម៉ាស៊ីនដែលទុកចិត្តអនុញ្ញាតឲ្យម៉ាស៊ីនជាក់លាក់ប្រតិបត្តិការហៅតាមរយៈ XML-RPC ទៅផ្នែកណាមួយនៃ Moodle API ។ វាមានសម្រាប់ស្គ្រីបដែលត្រូវត្រួតពិនិត្យឥរិយាបថ Moodle ហើយអាចជាជម្រើសគ្រោះថ្នាក់បំផុតដែលបើកនោះ ។ ប្រសិនបើមិនច្បាស់ សូមកុំប៉ះពាល់វា ។</p>
<p>វា<strong>មិន</strong>ត្រូវការសម្រាប់ការតបណ្ដាញ Moodle ទេ ។</p>
<p>ដើម្បីបើកវា គឺត្រូវបញ្ចូលបញ្ជីអាសយដ្ឋាន IP ឬបណ្ដាញមួយលើបន្ទាត់នីមួយៗ ។
ឧទាហរណ៍ខ្លះៗ ៖</p>\'.
\'ម៉ាស៊ីនបម្រើមូលដ្ឋាន ៖<br />\'.
\'127.0.0.1<br />\'.
\'ម៉ាស៊ីនមូលដ្ឋានរបស់អ្នក (ជាមួយប្លុកបណ្ដាញ) ៖<br />\'.
\'127.0.0.1/32<br />\'.
\'មានតែម៉ាស៊ីនដែលមានអាសយដ្ឋាន IP 192.168.0.7 ៖<br />\'.
\'192.168.0.7/32<br />\'.
\'ម៉ាស៊ីនណាដែលមានអាសយដ្ឋាន IP ពីចន្លោះ 192.168.0.1 និង 192.168.0.255 ៖<br />\'.
\'192.168.0.0/24<br />\'.
\'ម៉ាស៊ីនណាមួយក៏ដោយ ៖<br />\'.
\'192.168.0.0/0<br />\'.
\'ឧទាហរណ៍ចុងក្រោយគឺ<strong>មិន</strong>មែនជាការកំណត់រចនាសម្ព័ន្ធដែលផ្ដល់អនុសាសន៍ទេ ។';
$string['unknownerror'] = 'កំហុសមិនស្គាល់បានកើតឡើងកំឡុងពេលចរចារ ។';
$string['usercannotchangepassword'] = 'អ្នកមិនអាចផ្លាស់ប្ដូរពាក្យសម្ងាត់របស់អ្នកនៅទីនេះទេ ពីព្រោះអ្នកជាអ្នកប្រើពីចម្ងាយ ។';
$string['userchangepasswordlink'] = '<br />អ្នកអាចផ្លាស់ប្ដូរពាក្យសម្ងាត់របស់អ្នកនៅក្រុមហ៊ុនផ្ដល់<a href="{$a->wwwroot}/login/change_password.php">{$a->description}</a>របស់អ្នក ។';
$string['usersareonline'] = 'ការព្រមាន ៖ បច្ចុប្បន្ន អ្នកប្រើ {$a} ពីម៉ាស៊ីនបម្រើនោះត្រូវបានចូលទៅតំបន់បណ្ដាញរបស់អ្នក ។';
$string['validated_by'] = 'វាត្រូវបានធ្វើឲ្យមានសុពលភាពដោយបណ្ដាញ ៖ &nbsp';
$string['verifysignature-error'] = 'ការផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវហត្ថលេខាបានបរជ័យ ។ កំហុសបានកើតឡើង ។';
$string['verifysignature-invalid'] = 'ការផ្ទៀងផ្ទាត់ភាពត្រឹមត្រូវហត្ថលេខាបានបរាជ័យ ។ វាហាក់ដូចជាបន្ទុកចំណាយនេះមិនត្រូវបានចុះហត្ថលេខាដោយអ្នកនោះទេ ។';
$string['version'] = 'កំណែ';
$string['warning'] = 'ការព្រមាន';
$string['wrong-ip'] = 'អាសយដ្ឋាន IP របស់អ្នកមិនផ្គូផ្គងនឹងអាសយដ្ឋានដែលយើងមាននៅលើកំណត់ត្រាទេ ។';
$string['xmlrpc-missing'] = 'អ្នកត្រូវតែមាន XML-RPC ដំឡើងនៅក្នុងសំណង់ PHP របស់អ្នកដើម្បីអាចប្រើលក្ខណៈពិសេសនេះ ។';
$string['yourhost'] = 'ម៉ាស៊ីនរបស់អ្នក';
$string['yourpeers'] = 'ម៉ាស៊ីនដូចគ្នារបស់អ្នក';
