<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'qtype_ordering', language 'km', branch 'MOODLE_36_STABLE'
 *
 * @package   qtype_ordering
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['absoluteposition'] = 'ទីតាំងដាច់ខាត';
$string['allornothing'] = 'ត្រូវតែត្រូវទាំងអស់';
$string['answer'] = 'អត្ថបទធាតុ';
$string['answerheader'] = 'ធាតុដែលអាចអូសបាន {no}';
$string['correctorder'] = 'លំដាប់ត្រឹមត្រូវនៃធាតុទាំងនេះ គឺដូចខាងក្រោម៖';
$string['defaultanswerformat'] = 'ទ្រង់ទ្រាយចម្លើយលំនាំដើម';
$string['defaultquestionname'] = 'អូសធាតុខាងក្រោមទៅដាក់ក្នុងលំដាប់ត្រឹមត្រូវ។';
$string['editingordering'] = 'កែសម្រួលសំណួរ "រៀបលំដាប់"';
$string['gradedetails'] = 'ព័ត៌មានលំអិតពីពិន្ទុ';
$string['gradingtype'] = 'ប្រភេទនៃការដាក់ពិន្ទុ';
$string['gradingtype_help'] = 'ជ្រើសប្រភេទនៃការគណនាពិន្ទុ

**ត្រូវតែត្រូវទាំងអស់**
: ប្រសិនបើធាតុទាំងអស់ស្ថិតក្នុងទីតាំងត្រឹមត្រូវ នោះសិស្សនឹងទទួលបានពិន្ទុពេញ។ បើមិនដូច្នោះទេ គាត់នឹងបានពិន្ទុសូន្យ

**ទីតាំងដាច់ខាត**
: ធាតុមួយអាចត្រូវបានចាត់ទុកថាត្រឹមត្រូវ ប្រសិនបើវាស្ថិតនៅក្នុងទីតាំងដូចនៅក្នុងចម្លើយត្រឹមត្រូវ។ ពិន្ទុខ្ពស់បំផុតសម្រាប់សំណួរគឺ **ដូចគ្នានឹង** ចំនួនធាតុដែលបានបង្ហាញដល់សិស្ស។

**ធៀបនឹងទីតាំងត្រឹមត្រូវ**
: ធាតុមួយអាចត្រូវបានចាត់ទុកថាត្រឹមត្រូវ ប្រសិនបើវាស្ថិតនៅក្នុងទីតាំងដូចនៅក្នុងចម្លើយត្រឹមត្រូវ។ ធាតុដែលត្រឹមត្រូវទទួលបានពិន្ទុស្មើនឹងចំនូនធាតុដែលបានបង្ហាញ ដកមួយ។ ធាតុដែលមិនត្រឹមត្រូវទទួលបានពិន្ទុស្មើនឹងចំនួនធាតុដែលបានបង្ហាញ ដកមួយ ហើយដកនឹងចម្ងាយរបស់ធាតុនោះពីទីតាំងត្រឹមត្រូវរបស់វា។ ដូច្នេះប្រសិនបើមានធាតុ ***n*** ត្រូវបានបង្ហាញទៅសិស្ស នោះចំនួនពិន្ទុដែលអាចមានសម្រាប់ធាតុនីមួយៗគឺ ***(n-1)*** ហើយពិន្ទុខ្ពស់បំផុតដែលអាចមានសម្រាប់សំណួរទាំងមូលគឺ ***n × (n-1)*** ដែលស្មើនឹង ***((n² - n))***។

**ធៀបនឹងធាតុបន្ទាប់ (មិនរួមបញ្ចូលធាតុចុងក្រោយ)**
: ធាតុមួយអាចត្រូវបានចាត់ទុកថាត្រឹមត្រូវ ប្រសិនបើវាស្ថិតនៅពីមុខធាតុមួយដូចនៅក្នុងចម្លើយត្រឹមត្រូវ។ ធាតុដែលនៅចុងក្រោយគេនឹងមិនត្រូវបានពិនិត្យទេ។ ដូច្នេះពិន្ទុខ្ពស់បំផុតដែលអាចមានសម្រាប់សំណួរមួយ គឺស្មើនឹងចំនួនធាតុដែលបានបង្ហាញដល់សិស្ស ដកមួយ។

**ធៀបនឹងធាតុបន្ទាប់ (រួមបញ្ចូលធាតុចុងក្រោយ)**
: ធាតុមួយអាចត្រូវបានចាត់ទុកថាត្រឹមត្រូវ ប្រសិនបើវាស្ថិតនៅពីមុខធាតុមួយដូចនៅក្នុងចម្លើយត្រឹមត្រូវ។ នេះរួមបញ្ចូលទាំងធាតុដែលនៅចុងក្រោយគេដែរ ហើយធាតុនេះមិនត្រូវមានធាតុណាមួយនៅពីក្រោយវាទេ។ ដូច្នេះពិន្ទុខ្ពស់បំផុតដែលអាចមានសម្រាប់សំណួរមួយ គឺស្មើនឹងចំនួនធាតុដែលបានបង្ហាញដល់សិស្ស។

**ធៀបនឹងធាតុមុន និងធាតុបន្ទាប់**
: ធាតុមួយអាចត្រូវបានចាត់ទុកថាត្រឹមត្រូវ ប្រសិនបើវាស្ថិតនៅចន្លោះធាតុពីរដូចនៅក្នុងចម្លើយត្រឹមត្រូវ។ ធាតុដំបូងមិនគួរមានធាតុពីមុខទេ ហើយធាតុចុងក្រោយមិនគួរមានធាតុពីក្រោយទេ។ ដូច្នេះធាតុនីមួយៗអាចទទួលបានពីរពិន្ទុ ហើយពិន្ទុខ្ពស់បំផុតដែលអាចមានសម្រាប់សំណួរមួយ គឺស្មើនឹងចំនួនធាតុដែលបានបង្ហាញទៅសិស្ស គុណនឹងពីរ។

**ធៀបនឹងធាតុមុន និងធាតុបន្ទាប់ទាំងអស់**
: ធាតុមួយអាចត្រូវបានចាត់ទុកថាត្រឹមត្រូវ ប្រសិនបើវាស្ថិតនៅពីក្រោយធាតុទាំងអស់ដូចនៅក្នុងចម្លើយត្រឹមត្រូវ ហើយវាស្ថិតនៅពីមុខធាតុទាំងអស់ដូចនៅក្នុងចម្លើយត្រឹមត្រូវ។ លំដាប់នៃធាតុខាងមុខមិនសំខាន់ទេ ហើយលំដាប់នៃធាតុខាងក្រោយក៏មិនសំខាន់ដែរ។ ដូច្នេះប្រសិនបើមានធាតុ ***n*** ត្រូវបានបង្ហាញទៅសិស្ស នោះចំនួនពិន្ទុដែលអាចមានសម្រាប់ធាតុនីមួយៗគឺ ***(n-1)*** ហើយពិន្ទុខ្ពស់បំផុតដែលអាចមានសម្រាប់សំណួរទាំងមូលគឺ ***n × (n-1)*** ដែលស្មើនឹង ***((n² - n))***។

**សំនុំរងមានលំដាប់មួយដែលវែងជាងគេ**
: ពិន្ទុស្មើនឹងចំនួនធាតុនៅក្នុងសំនុំរងមានលំដាប់មួយដែលវែងជាងគេ។ ពិន្ទុខ្ពស់បំផុតដែលអាចមាន គឺស្មើនឹងចំនួនធាតុដែលបានបង្ហាញ។ សំនុំរងត្រូវតែមានយ៉ាងហោចណាស់ពីរ។ សំនុំរងមិនចាំបាច់ចាប់ផ្តើមដោយធាតុទីមួយទេ ហើយសំនុំរងមិនចាំបាច់នៅជាប់ៗគ្នាទេ។ នៅពេលដែលមានសំនុំរងច្រើនដែលមានប្រវែងស្មើគ្នា នោះធាតុនៅក្នុងសំនុំរងដែលត្រូវបានរកឃើញមុនគេនឹងត្រូវបានបង្ហាញថាត្រឹមត្រូវ។ ធាតុដទៃដែលត្រូវបានដាក់សម្គាល់ថាមិនត្រឹមត្រូវ។

**សំនុំរងជាប់គ្នាដែលវែងជាងគេ**
: ពិន្ទុស្មើនឹងចំនួនធាតុនៅក្នុងសំនុំរងមានលំដាប់មួយដែលវែងជាងគេ។ ពិន្ទុខ្ពស់បំផុតដែលអាចមាន គឺស្មើនឹងចំនួនធាតុដែលបានបង្ហាញ។ សំនុំរងត្រូវតែមានយ៉ាងហោចណាស់ពីរ។ សំនុំរងមិនចាំបាច់ចាប់ផ្តើមដោយធាតុទីមួយទេ ហើយសំនុំរងចាំបាច់ត្រូវនៅជាប់ៗគ្នា។ នៅពេលដែលមានសំនុំរងច្រើនដែលមានប្រវែងស្មើគ្នា នោះធាតុនៅក្នុងសំនុំរងដែលត្រូវបានរកឃើញមុនគេនឹងត្រូវបានបង្ហាញថាត្រឹមត្រូវ។ ធាតុដទៃដែលត្រូវបានដាក់សម្គាល់ថាមិនត្រឹមត្រូវ។';
$string['horizontal'] = 'ដេក';
$string['layouttype'] = 'ប្លង់នៃធាតុ';
$string['layouttype_help'] = 'ជ្រើសថាត្រូវបង្ហាញធាតុជាជួរដេក ឬជួរឈរ។';
$string['longestcontiguoussubset'] = 'សំនុំរងជាប់គ្នាដែលវែងជាងគេ';
$string['longestorderedsubset'] = 'សំនុំរងមានលំដាប់មួយដែលវែងជាងគេ';
$string['noresponsedetails'] = 'មិនមានព័ត៌មានលម្អិតសម្រាប់ចម្លើយលើសំណួរនេះទេ';
$string['noscore'] = 'គ្មានពិន្ទុ';
$string['notenoughanswers'] = 'សំណួរ "រៀបលំដាប់" ត្រូវតែមានចម្លើយយ៉ាងហោចណាស់ {$a} ។';
$string['pluginname'] = 'រៀបលំដាប់';
$string['pluginnameadding'] = 'បន្ថែមសំណួរ "រៀបលំដាប់"';
$string['pluginnameediting'] = 'កែសម្រួលសំណួរ "រៀបលំដាប់"';
$string['pluginname_help'] = 'ធាតុជាច្រើនត្រូវបានបង្ហាញក្នុងលំដាប់ច្របល់គ្នា។ ធាតុអាចត្រូវបានអូសទៅដាក់ក្នុងលំដាប់ត្រឹមត្រូវមួយ។';
$string['pluginnamesummary'] = 'ដាក់ធាតុដែលត្រូវបានច្របល់ទៅក្នុងលំដាប់ត្រឹមត្រូវមួយ។';
$string['relativeallpreviousandnext'] = 'ធៀបនឹងធាតុមុន និងធាតុបន្ទាប់ទាំងអស់';
$string['relativenextexcludelast'] = 'ធៀបនឹងធាតុបន្ទាប់ (មិនរួមបញ្ចូលធាតុចុងក្រោយ)';
$string['relativenextincludelast'] = 'ធៀបនឹងធាតុបន្ទាប់ (រួមបញ្ចូលធាតុចុងក្រោយ)';
$string['relativeonepreviousandnext'] = 'ធៀបនឹងធាតុមុន និងធាតុបន្ទាប់';
$string['relativetocorrect'] = 'ធៀបនឹងទីតាំងត្រឹមត្រូវ';
$string['removeeditor'] = 'ទីតាំងដាច់ខាត';
$string['removeitem'] = 'ដកធាតុដែលអាចអូសបានចេញ';
$string['scoredetails'] = 'នេះជាពិន្ទុសម្រាប់ធាតុនីមួយៗក្នុងចម្លើយនេះ៖';
$string['selectall'] = 'ជ្រើសធាតុទាំងអស់';
$string['selectcontiguous'] = 'ជ្រើសសំនុំរងជាប់គ្នា';
$string['selectcount'] = 'ទំហំរបស់សំនុំរង';
$string['selectcount_help'] = 'ចំនួនធាតុដែលនឹងត្រូវបានបង្ហាញនៅពេលសំណួរលេចឡើងក្នុងកម្រងសំណួរ។';
$string['selectrandom'] = 'ជ្រើសសំនុំរងចៃដន្យនៃធាតុ';
$string['selecttype'] = 'ប្រភេទជម្រើសធាតុ';
$string['selecttype_help'] = 'ជ្រើសថាត្រូវបង្ហាញធាតុទាំងអស់ ឬតែសំនុំធាតុ';
$string['showgrading'] = 'ព័ត៌មានលម្អិតពីការដាក់ពិន្ទុ';
$string['showgrading_help'] = 'ជ្រើសរើសថាតើត្រូវបង្ហាញឬលាក់ព័ត៌មានលំអិតនៃការគណនាពិន្ទុនៅពេលសិស្សពិនិត្យការឆ្លើយតបទៅនឹងសំណួរលំដាប់នេះ។';
$string['vertical'] = 'ឈរ';
