<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'quiz', language 'km', branch 'MOODLE_36_STABLE'
 *
 * @package   quiz
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['accessnoticesheader'] = 'អ្នកអាចមើលកម្រងសំណួរនេះបាន ប៉ុន្តែប្រសិនបើនេះជាការសាកល្បងពិតប្រាកដ នោះអ្នកនឹងត្រូវបានរារាំងដោយសារ៖';
$string['action'] = 'សកម្មភាព';
$string['activityoverview'] = 'អ្នកមានកម្រងសំណួរដែលដល់ពេលកំណត់';
$string['adaptive'] = 'របៀបប្រែប្រួល';
$string['adaptive_help'] = 'ប្រសិនបើបើក សិស្សអាចឆ្លើយសំណួរមួយច្រើនដងនៅក្នុងកម្រងសំណួរតែមួយ។ ដូច្នេះឧទាហរណ៍ប្រសិនបើចម្លើយមួយត្រូវបានដាក់សម្គាល់ថាមិនត្រឹមត្រូវ នោះសិស្សនឹងអាចសាកល្បងឆ្លើយសំណួរដដែលនោះម្តងទៀតភ្លាមៗ។ ទោះជាយ៉ាងណាក៏ដោយ អាស្រ័យទៅលើការកំណត់ "ដាក់ពិន័យ" ពិន្ទុនឹងត្រូវដកចេញសម្រាប់រាល់ចម្លើយដែលមិនត្រឹមត្រូវ។';
$string['add'] = 'បន្ថែម';
$string['addaquestion'] = 'សំណួរថ្មីមួយ';
$string['addarandomquestion'] = 'សំណួរចៃដន្យមួយ';
$string['addarandomquestion_help'] = 'នៅពេលដែលអ្នកបន្ថែមសំណួរចៃដន្យមួយ នោះសំណួរមួយនឹងត្រូវបានជ្រើសរើសដោយចៃដន្យពីប្រភេទសំណួរដែលត្រូវបានដាក់បញ្ចូលក្នុងកម្រងសំណួរ។ នេះមានន័យថាសិស្សនឹងត្រូវទទួលបានសំណួរផ្សេងៗគ្នា ហើយនៅពេលកម្រងសំណួរមួយអនុញ្ញាតឲ្យមានការសាកល្បងច្រើនដង នោះការសាកល្បងនីមួយៗនឹងមានជម្រើសសំណួរថ្មី។';
$string['addarandomselectedquestion'] = 'បន្ថែមសំណួរដែលបានជ្រើសរើសចៃដន្យ ...';
$string['addasection'] = 'ចំណងជើងផ្នែកថ្មីមួយ';
$string['adddescriptionlabel'] = 'បន្ថែមធាតុពិពណ៌នាមួយ';
$string['addingquestion'] = 'បន្ថែមសំណួរ';
$string['addingquestions'] = '<p>នៅចំហៀងទំព័រ គឺជាកន្លែងដែលអ្នកអាចគ្រប់គ្រងមូលដ្ឋានទិន្នន័យសំណួររបស់អ្នកបាន ។ សំណួរគឺត្រូវបានទុកនៅក្នុងប្រភេទដើម្បីជួយអ្នកក្នុងការរៀបចំពួកវា ហើយអាចត្រូវបានប្រើដោយកម្រងសំណួរណាក៏បានដែលនៅក្នុងវគ្គសិក្សារបស់អ្នក ឬវគ្គសិក្សាផ្សេងនៅពេលដែលអ្នកជ្រើស \'បោះពុម្ពផ្សាយ\' ពួកវា ។</p>
<p>បន្ទាប់ពីអ្នកជ្រើស ឬបង្កើតប្រភេទសំណួររួច អ្នកនឹងអាចបង្កើត ឬកែសម្រួលសំណួរបាន ។ អ្នកអាចជ្រើសសំណួរណាក៏បានដើម្បីបន្ថែមកម្រងសំណួរនៅលើចំហៀងផ្សេងទៀតនៃទំព័រនេះ ។</p>';
$string['addmoreoverallfeedbacks'] = 'បន្ថែមប្រអប់ទិន្នន័យសម្រាប់មូលវិចារណ៍ {no} ទៀត';
$string['addnewgroupoverride'] = 'បន្ថែមការលើកលែងសម្រាប់ក្រុម';
$string['addnewpagesafterselected'] = 'បន្ថែមទំព័រថ្មីបន្ទាប់ពីសំណួរដែលបានជ្រើស';
$string['addnewquestionsqbank'] = 'បន្ថែមសំណួរទៅកាន់ប្រភេទ {$a->catname}៖ {$a->link}';
$string['addnewuseroverride'] = 'បន្ថែមការលើកលែងសម្រាប់អ្នកប្រើ';
$string['addpagebreak'] = 'បន្ថែមធាតុបំបែកទំព័រ';
$string['addpagehere'] = 'បន្ថែមទំព័រទីនេះ';
$string['addquestion'] = 'បន្ថែមសំណួរ';
$string['addquestionfrombankatend'] = 'បន្ថែមពីឃ្លាំងសំណួរទៅកាន់ខាងចុងបង្អស់';
$string['addquestionfrombanktopage'] = 'បន្ថែមពីឃ្លាំងសំណួរទៅកាន់ទំព័រ {$a}';
$string['addquestions'] = 'បន្ថែមសំណួរ';
$string['addquestionstoquiz'] = 'បន្ថែមសំណួរទៅកាន់កម្រងសំណួរបច្ចុប្បន្ន';
$string['addrandom'] = 'បន្ថែមសំណួរចៃដន្យ {$a}';
$string['addrandom1'] = '<< បន្ថែម';
$string['addrandom2'] = 'សំណួរចៃដន្យ';
$string['addrandomfromcategory'] = 'បន្ថែមសំណួរចៃដន្យពីប្រភេទ៖';
$string['addrandomquestion'] = 'បន្ថែមសំណួរចៃដន្យ';
$string['addrandomquestionatend'] = 'បន្ថែមសំណួរចៃដន្យមួយនៅខាងចុងបង្អស់';
$string['addrandomquestiontopage'] = 'បន្ថែមសំណួរចៃដន្យមួយនៅទំព័រ {$a}';
$string['addrandomquestiontoquiz'] = 'បន្ថែមសំណួរចៃដន្យមួយទៅកម្រងសំណួរ {$a}';
$string['addselectedquestionstoquiz'] = 'បន្ថែមសំណួរដែលបានជ្រើសទៅកាន់កម្រងសំណួរ';
$string['addselectedtoquiz'] = 'បន្ថែមសំណួរដែលបានជ្រើសទៅកម្រងសំណួរ';
$string['addtoquiz'] = 'បន្ថែមទៅកម្រងសំណួរ';
$string['affectedstudents'] = 'មានឥទ្ធិពលលើ {$a}';
$string['aftereachquestion'] = 'បន្ទាប់ពីបន្ថែមសំណួរនីមួយៗ';
$string['afternquestions'] = 'បន្ទាប់ពីបន្ថែមសំណួរ {$a}';
$string['age'] = 'អាយុ';
$string['allattempts'] = 'ការសាកល្បងទាំងអស់';
$string['allinone'] = 'មិនកំណត់';
$string['allowreview'] = 'អនុញ្ញាតឲ្យពិនិត្យឡើងវិញ';
$string['alreadysubmitted'] = 'វាទំនងដូចជា អ្នកបានប្រគល់ការសាកល្បងនេះរួចហើយ';
$string['alternativeunits'] = 'ឯកតាជំនួស';
$string['alwaysavailable'] = 'មានជានិច្ច';
$string['analysisoptions'] = 'ជម្រើសវិភាគ';
$string['analysistitle'] = 'តារាងវិភាគធាតុ';
$string['answer'] = 'ចម្លើយ';
$string['answered'] = 'បានឆ្លើយ';
$string['answerhowmany'] = 'ចម្លើយមួយ ឬច្រើន ?';
$string['answers'] = 'ចម្លើយ';
$string['answersingleno'] = 'បានអនុញ្ញាតឲ្យមានចម្លើយច្រើន';
$string['answersingleyes'] = 'ចម្លើយតែមួយប៉ុណ្ណោះ';
$string['answertoolong'] = 'ចម្លើយវែងពេកបន្ទាប់ពីបន្ទាត់ {$a} (តួអក្សរអតិ. ២៥៥)';
$string['aon'] = 'ទ្រង់ទ្រាយ AON';
$string['areyousureremoveselected'] = 'តើអ្នកប្រាកដជាចង់លុបចេញនូវសំណួរទាំងអស់ដែលបានជ្រើសរើសមែនឬ?';
$string['asshownoneditscreen'] = 'ដូចដែលបានបង្ហាញនៅលើអេក្រង់កែសម្រួល';
$string['attempt'] = 'ការសាកល្បង {$a}';
$string['attemptalreadyclosed'] = 'ការសាកល្បងនេះត្រូវបានបញ្ចប់រួចហើយ។';
$string['attemptclosed'] = 'ការសាកល្បងមិនទាន់បានបិទនៅឡើយទេ';
$string['attemptduration'] = 'ចំណាយពេលអស់';
$string['attemptedon'] = 'បានសាកល្បងនៅ';
$string['attempterror'] = 'អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យសាកល្បងកម្រងសំណួរនេះនៅពេលនេះទេព្រោះ៖ {$a}';
$string['attemptfirst'] = 'ការសាកល្បងលើកទីមួយ';
$string['attemptincomplete'] = 'ការសាកល្បងនោះ (ដោយ {$a}) គឺមិនទាន់បានបញ្ចប់នៅឡើយទេ ។';
$string['attemptlast'] = 'ការសាកល្បងចុងក្រោយ';
$string['attemptnumber'] = 'ការសាកល្បង';
$string['attemptquiznow'] = 'សាកល្បងកម្រងសំណួរឥឡូវ';
$string['attempts'] = 'ការសាកល្បង';
$string['attemptsallowed'] = 'ការសាកល្បងបានអនុញ្ញាត';
$string['attemptsdeleted'] = 'បានលុបការសាកល្បងកម្រងសំណួរ';
$string['attemptselection'] = 'ជ្រើសការសាកល្បងដែលត្រូវវិភាគក្នុងអ្នកប្រើម្នាក់៖';
$string['attemptsexist'] = 'អ្នកលែងអាចបន្ថែម ឬដកចេញសំណួរទៀតហើយ។';
$string['attemptsnum'] = 'ចម្លើយ៖ {$a}';
$string['attemptsnumthisgroup'] = 'ចម្លើយ៖ {$a->total} ({$a->group} ពីក្រុមនេះ)';
$string['attemptsnumyourgroups'] = 'ចម្លើយ៖ {$a->total} ({$a->group} ពីក្រុមរបស់អ្នក)';
$string['attemptsonly'] = 'បង្ហាញតែសិស្សដែលបានសាកល្បងប៉ុណ្ណោះ';
$string['attemptstate'] = 'សភាព';
$string['attemptstillinprogress'] = 'ការសាកល្បងកំពុងតែដំណើរការ';
$string['attemptsunlimited'] = 'ការសាកល្បងមិនកំណត់';
$string['autosaveperiod'] = 'ការពន្យាពេលសម្រាប់ការរក្សាទុកដោយស្វ័យប្រវត្តិ';
$string['autosaveperiod_desc'] = 'ចម្លើយអាចត្រូវបានរក្សាទុកដោយស្វ័យប្រវត្តិខណៈសាកល្បងកម្រងសំណួរ។ ចម្លើយត្រូវបានរក្សាទុករាល់ពេលដែលចម្លើយមួយត្រូវបានប្តូរ និងបន្ទាប់ពីការពន្យាពេលនេះ។ ការពន្យាពេលកាន់តែខ្លីនោះបន្ទុកម៉ាស៊ីនបម្រើកាន់តែកើនឡើង ប៉ុន្តែឪកាសដែលសិស្សត្រូវបាត់បង់កិច្ចការរបស់គេក៏ត្រូវបានកាត់បន្ថយដែរ។ អ្នកគួរត្រូតពិនិត្យបន្ទុកម៉ាស៊ីនមេ។ ក្នុងករណីបន្ទុកមានកម្រិតខ្ពស់ខ្លាំងពេក អ្នកគួរតែបង្កើនតម្លៃរបស់ការពន្យាពេល។ ដាក់ 0 សម្រាប់បិទការរក្សាទុកដោយស្វ័យប្រវត្តិ។';
$string['back'] = 'ត្រឡប់ទៅមើលសំណួរជាមុន';
$string['backtocourse'] = 'ត្រឡប់ទៅវគ្គសិក្សា';
$string['backtoquestionlist'] = 'ត្រឡប់ទៅបញ្ជីសំណួរ';
$string['backtoquiz'] = 'ត្រឡប់ទៅការកែសម្រួលកម្រងសំណួរ';
$string['basicideasofquiz'] = 'គំនិតមូលដ្ឋាននៃការបង្កើតកម្រងសំណួរ';
$string['bestgrade'] = 'ពិន្ទុល្អបំផុត';
$string['bothattempts'] = 'បង្ហាញសិស្សដែលបាន និងមិនបានសាកល្បង';
$string['browsersecurity'] = 'សុវត្ថិភាពកម្មវិធីរុករក';
$string['browsersecurity_help'] = 'ប្រសិនបើ "ផ្ទាំងផុសពេញអេក្រង់ដោយមានសុវត្ថិភាព JavaScript មួយចំនួន" ត្រូវបានជ្រើសរើស

* កម្រងសំណួរនឹងចាប់ផ្តើមលុះត្រាតែសិស្សមានកម្មវិធីបើកអ៊ីនធឺណែតដែលប្រើ JavaScript
* កម្រងសំណួរបង្ហាញនៅក្នុងផ្ទាំងលេចឡើងពេញអេក្រង់ដែលគ្របដណ្តប់គ្រប់ផ្ទាំងផ្សេងទៀតនិងមិនមានប៊ូតុងបញ្ជាការផ្លាស់ទី
* សិស្សត្រូវបានរារាំងតាមដែលអាចធ្វើទៅបានពីការប្រើប្រាស់បញ្ជាផ្សេងៗដូចជាចម្លងនិងបិទភ្ជាប់';
$string['calculated'] = 'គណនា';
$string['calculatedquestion'] = 'សំណួរគណនាមិនបានគាំទ្រនៅបន្ទាត់ {$a} ទេ ។ សំណួរនឹងមិនត្រូវបានអើពើ';
$string['cannotcreatepath'] = 'មិនអាចបង្កើតផ្លូវបានឡើយ ({$a})';
$string['cannoteditafterattempts'] = 'អ្នកមិនអាចបន្ថែម ឬយកសំណួរចេញទេ ពីព្រោះកម្រងសំណួរនេះត្រូវបានសាកល្បងរួចហើយ ។ ({$a})';
$string['cannotfindprevattempt'] = 'មិនអាចស្វែងរកការសាកល្បងពីមុនសម្រាប់បន្ថែមពីលើទេ';
$string['cannotfindquestionregard'] = 'បានបរាជ័យក្នុងការយកសំណួរសម្រាប់ដាក់ពិន្ទុម្តងទៀត!';
$string['cannotinsert'] = 'មិនអាចបញ្ចូលសំណួរបានឡើយ';
$string['cannotinsertrandomquestion'] = 'មិនអាចបញ្ចូលសំណួរចៃដន្យថ្មីទេ!';
$string['cannotloadquestion'] = 'មិនអាចដំណើរការជម្រើសសម្រាប់សំណួរទេ';
$string['cannotloadtypeinfo'] = 'មិនអាចដំណើរការព័ត៌មានអំពីសំណួរតាមប្រភេទសំណួរទេ';
$string['cannotopen'] = 'មិនអាចបើកឯកសារនាំចេញ ({$a}) បានឡើយ';
$string['cannotreviewopen'] = 'អ្នកមិនអាចពិនិត្យការសាកល្បងនេះឡើងវិញទេ។ វានៅតែបើក។';
$string['cannotsavenumberofquestion'] = 'មិនអាចរក្សាទុកចំនួនសំណួរក្នុងមួយទំព័រទេ';
$string['cannotsavequestion'] = 'មិនអាចរក្សាទុកបញ្ជីសំណួរទេ';
$string['cannotsetgrade'] = 'មិនអាចកំណត់ពិន្ទុអតិបរមាថ្មីសម្រាប់កម្រងសំណួរទេ';
$string['cannotsetsumgrades'] = 'បានបរាជ័យក្នុងការកំណត់ sumgrades';
$string['cannotstartgradesmismatch'] = 'មិនអាចចាប់ផ្តើមការសាកល្បងសម្រាប់កម្រងសំណួរនេះទេ។ កម្រងសំណួរនេះត្រូវបានកំណត់ឲ្យដាក់ពិន្ទុលើពិន្ទុសរុប {$a->grade} តែមិនមានសំណួរណាមួយមានពិន្ទុទេ។ អ្នកអាចកែវាបាននៅទំព័រ "កែសម្រួលកម្រងសំណួរ"។';
$string['cannotstartmissingquestion'] = 'មិនអាចចាប់ផ្តើមការសាកល្បងសម្រាប់កម្រងសំណួរនេះទេ។ កម្រងសំណួរបានដាក់បញ្ចូលសំណួរដែលមិនមាន។';
$string['cannotstartnoquestions'] = 'មិនអាចចាប់ផ្តើមការសាកល្បងសម្រាប់កម្រងសំណួរនេះទេ។ កម្រងសំណួរនេះមិនត្រូវបានរៀបចំនៅឡើយទេ។ មិនមានសំណួរណាមួយត្រូវបានបន្ថែមនៅឡើយទេ។';
$string['cannotwrite'] = 'មិនអាចសរសេរទៅកាន់ឯកសារនាំចេញ ({$a}) បានឡើយ';
$string['canredoquestions'] = 'អនុញ្ញាតឲ្យធ្វើឡើងវិញនៅក្នុងការសាកល្បងមួយ';
$string['canredoquestions_desc'] = 'ប្រសិនបើបើក នោះនៅពេលសិស្សបានបញ្ចប់ការសាកល្បងសំណួរណាមួយ គេនឹងឃើញប៊ូតុង "ធ្វើសំណួរឡើងវិញ"។ សិស្សនឹងអាចសាកល្បងសំណួរដដែលដោយមិនចាំបាច់ប្រគល់កម្រងសំណួរទាំងមូល ហើយត្រូវចាប់ផ្តើមម្តងទៀត។ ជម្រើសនេះមានប្រយោជន៍សម្រាប់កម្រងសំណួរសម្រាប់ការអនុវត្ត។

ការកំណត់នេះអាចប្រើតែជាមួយសំណួរនិងអាកប្បកិរិយាណាដែលសិស្សអាចបញ្ចប់បានមុនពេលគាត់ត្រូវប្រគល់ចម្លើយសម្រាប់កម្រងសំណួរទាំងមូលប៉ុណ្ណោះ។';
$string['canredoquestions_help'] = 'ប្រសិនបើបើក នោះនៅពេលសិស្សបានបញ្ចប់ការសាកល្បងសំណួរណាមួយ គេនឹងឃើញប៊ូតុង "ធ្វើសំណួរឡើងវិញ"។ សិស្សនឹងអាចសាកល្បងសំណួរដដែលដោយមិនចាំបាច់ប្រគល់កម្រងសំណួរទាំងមូល ហើយត្រូវចាប់ផ្តើមម្តងទៀត។ ជម្រើសនេះមានប្រយោជន៍សម្រាប់កម្រងសំណួរសម្រាប់ការអនុវត្ត។

ការកំណត់នេះអាចប្រើតែជាមួយសំណួរនិងអាកប្បកិរិយាណាដែលសិស្សអាចបញ្ចប់បានមុនពេលគាត់ត្រូវប្រគល់ចម្លើយសម្រាប់កម្រងសំណួរទាំងមូលប៉ុណ្ណោះ។';
$string['canredoquestionsyes'] = 'សិស្សអាចឆ្លើយសំណួរដែលបានឆ្លើយហើយម្តងទៀត';
$string['caseno'] = 'ទេ អក្សរតូចធំមិនសំខាន់ឡើយ';
$string['casesensitive'] = 'ប្រកាន់តួអក្សរតូចធំ';
$string['caseyes'] = 'បាទ/ចាស តួអក្សរតូចធំត្រូវតែផ្គូផ្គង';
$string['categoryadded'] = 'បានបន្ថែមប្រភេទ \'{$a}\'';
$string['categorydeleted'] = 'បានលុបប្រភេទ \'{$a}\'';
$string['categorynoedit'] = 'អ្នកមិនមានសិទ្ធិកែសម្រួលនៅក្នុងប្រភេទ \'{$a}\' ឡើយ ។';
$string['categoryupdated'] = 'ប្រភេទត្រូវបានកែប្រែថ្មីដោយជោគជ័យ';
$string['close'] = 'បិទបង្អួច';
$string['closebeforeopen'] = 'មិនអាចកែប្រែកម្រងសំណួរបានទេ ។ អ្នកបានបញ្ជាក់កាលបរិច្ឆេទបិទមុនកាលបរិច្ឆេទបើក ។';
$string['closed'] = 'បានបិទ';
$string['closepreview'] = 'បិទការមើលជាមុន';
$string['closereview'] = 'បិទការពិនិត្យឡើងវិញ';
$string['comment'] = 'មតិយោបល់';
$string['commentorgrade'] = 'បង្កើតមតិយោបល់ ឬជំនួសពិន្ទុ';
$string['comments'] = 'មតិយោបល់';
$string['completedon'] = 'បានបញ្ចប់នៅ';
$string['completionattemptsexhausted'] = 'ឬការសាកល្បងដែលមានទាំងអស់បានបញ្ចប់';
$string['completionattemptsexhausteddesc'] = 'បញ្ចប់ប្រសិនបើការសាកល្បងដែលមានទាំងអស់ត្រូវបានប្រើអស់';
$string['completionattemptsexhausted_help'] = 'ដាក់សម្គាល់កម្រងសំណួរថាបានបញ្ចប់នៅពេលដែលសិស្សបានប្រើការសាកល្បងទាំងអស់។';
$string['completionpass'] = 'ទាមទារពិន្ទុជាប់';
$string['completionpassdesc'] = 'សិស្សត្រូវទទួលបានពិន្ទុជាប់ដើម្បីបញ្ចប់សកម្មភាពនេះ';
$string['completionpass_help'] = 'ប្រសិនបើបើក សកម្មភាពនេះនឹងត្រូវចាត់ទុកថាបានបញ្ចប់នៅពេលដែលសិស្សទទួលបានពិន្ទុជាប់មួយ ដែលពិន្ទុចាត់ទុកថាជាប់ត្រូវបានកំណត់ក្នុងបញ្ជីពិន្ទុ។';
$string['configadaptive'] = 'ប្រសិនបើអ្នកជ្រើស "បាទ/ចាស" សម្រាប់ជម្រើសនេះ នោះសិស្សនឹងត្រូវបានអនុញ្ញាតឲ្យឆ្លើយច្រើនដងចំពោះសំណួរមួយទោះជានៅក្នុងការសាកល្បងតែមួយក៏ដោយ។';
$string['configattemptsallowed'] = 'ដាក់កំហិតលើចំនួនដងដែលសិស្សអាចសាកល្បងកម្រងសំណួរបាន។';
$string['configdecimaldigits'] = 'ចំនួនលេខក្រោយក្បៀសដែលត្រូវបង្ហាញសម្រាប់ពិន្ទុ។';
$string['configdecimalplaces'] = 'ចំនួនលេខក្រោយក្បៀសដែលត្រូវបង្ហាញសម្រាប់ពិន្ទុសម្រាប់កម្រងសំណួរ។';
$string['configdecimalplacesquestion'] = 'ចំនួនលេខក្រោយក្បៀសដែលត្រូវបង្ហាញសម្រាប់ពិន្ទុសម្រាប់សំណួរនីមួយៗ។';
$string['configdelay1'] = 'ប្រសិនបើអ្នកបានកំណត់ការពន្យាពេល នោះសិស្សត្រូវចាំសិនមុនពេលដែលពួកគេអាចសាកល្បងកម្រងសំណួរម្តងទៀតបន្ទាប់ពីការសាកល្បងលើកទីមួយ។';
$string['configdelay1st2nd'] = 'ប្រសិនបើអ្នកបានកំណត់ការពន្យាពេលនៅទីនេះ នោះសិស្សនឹងមិនអាចចាប់ផ្តើមការសាកល្បងលើកទីពីររបស់គេភ្លាមៗឡើយ។ គេត្រូវរងចាំសិនសម្រាប់រយៈពេលដែលអ្នកបានកំណត់រាប់ចាប់ពីការសាកល្បងលើកទីមួយ។';
$string['configdelay2'] = 'ប្រសិនបើអ្នកបានកំណត់ការពន្យាពេលនៅទីនេះ នោះសិស្សត្រូវចាំសិនមុនពេលដែលពួកគេអាចសាកល្បងកម្រងសំណួរនៅលើកទីបី ឬក្រោយៗទៀត។';
$string['configdelaylater'] = 'ប្រសិនបើអ្នកបានកំណត់ការពន្យាពេលនៅទីនេះ នោះសិស្សនឹងមិនអាចចាប់ផ្តើមការសាកល្បងលើកទីបី ទីបួន ... របស់គេភ្លាមៗឡើយ។ គេត្រូវរងចាំសិនសម្រាប់រយៈពេលដែលអ្នកបានកំណត់រាប់ចាប់ពីការសាកល្បងពីមុន។';
$string['configeachattemptbuildsonthelast'] = 'ប្រសិនបើការសាកល្បងច្រើនដងត្រូវបានអនុញ្ញាត នោះការសាកល្បងនីមួយៗនឹងមានលទ្ធផលពីការសាកល្បងពីមុន។';
$string['configgrademethod'] = 'នៅពេលដែលការសាកល្បងច្រើនដងត្រូវបានអនុញ្ញាត វិធីមួយណាដែលត្រូវប្រើសម្រាប់គណនាពិន្ទុចុងក្រោយរបស់សិស្សសម្រាប់កម្រងសំណួរ។';
$string['configintro'] = 'តម្លៃដែលអ្នកដាក់នៅទីនេះជាតម្លៃលំនាំដើមដែលត្រូវប្រើក្នុងទំព័រនៃការកំណត់នៅពេលដែលអ្នកបង្កើតកម្រងសំណួរថ្មីមួយ។ អ្នកក៏អាចកំណត់ផងដែរថាតើការកំណត់ណាខ្លះដែលត្រូវចាត់ទុកជា "កម្រិតខ្ពស់"។';
$string['configmaximumgrade'] = 'ពិន្ទុលំនាំដើមដែលពិន្ទុសម្រាប់កម្រងសំណួរត្រូវលៃលកឲ្យមានសមាមាត្រ។';
$string['confignavmethod'] = 'ក្នុង "ការផ្លាស់ទីសេរី" សំណួរអាចត្រូវបានឆ្លើយដោយមិនចាំបាច់តាមលំដាប់។ ក្នុង "តាមលំដាប់បន្តបន្ទាប់" សំណួរត្រូវតែបានឆ្លើយតាមលំដាប់លំដោយជាក់លាក់។';
$string['confignewpageevery'] = 'នៅពេលបន្ថែមសំណួរទៅកាន់កម្រងសំណួរ ធាតុបំបែកទំព័រនឹងត្រូវបានដាក់បញ្ចូលដោយស្វ័យប្រវត្តិទៅតាមការកំណត់ដែលអ្នកបានជ្រើសនៅទីនេះ។';
$string['configoutcomesadvanced'] = 'ប្រសិនបើជម្រើសនេះត្រូវបានបើក នោះ "លទ្ធផល" នៅលើទំព័រសម្រាប់កែសម្រួលកម្រងសំណួរ នឹងជាការកំណត់លំដាប់ខ្ពស់។';
$string['configpenaltyscheme'] = 'ពិន័យសម្រាប់ចម្លើយខុសនីមួយៗក្នុងរបៀបប្រែប្រួល។';
$string['configpopup'] = 'បង្ខំឲ្យបើកការសាកល្បងក្នុងផ្ទាំងផុសឡើង ហើយប្រើ JavaScript ដើម្បីការពារកុំឲ្យមានការចម្លងនិងបិទភ្ជាប់ -ល- នៅពេលសាកល្បងកម្រងសំណួរ។';
$string['configrequirepassword'] = 'សិស្សត្រូវបញ្ចូលពាក្យសម្ងាត់នេះមុនពេលគេអាចសាកល្បងកម្រងសំណួរបាន។';
$string['configrequiresubnet'] = 'សិស្សអាចសាកល្បងកម្រងសំណួរនេះតែពីកុំព្យូទ័រទាំងនេះប៉ុណ្ណោះ។';
$string['configreviewoptions'] = 'ជម្រើសទាំងនេះគ្រប់គ្រងព័ត៌មានណាដែលសិស្សអាចមើលបាននៅពេលដែលពួកគេពិនិត្យការសាកល្បងរបស់គេឡើងវិញ ឬមើលរបាយការណ៍កម្រងសំណួរ។';
$string['configshowblocks'] = 'បង្ហាញប្លុកខណៈពេលសាកល្បងកម្រងសំណួរ';
$string['configshowuserpicture'] = 'បង្ហាញរូបតំណាងរបស់អ្នកប្រើនៅលើអេក្រង់នៅពេលសាកល្បង។';
$string['configshufflewithin'] = 'ប្រសិនបើអ្នកបើកជម្រើសនេះ នោះផ្នែកទាំងឡាយដែលបង្កើតបានជាសំណួរនីមួយៗនឹងត្រូវច្របល់ដោយចៃដន្យរាល់ពេលដែលសិស្សចាប់ផ្តើមសាកល្បងកម្រងសំណួរនេះ ប្រសិនបើជម្រើសនេះក៏ត្រូវបានបើកផងដែរនៅក្នុងការកំណត់សម្រាប់សំណួរ។';
$string['configtimelimit'] = 'ពេលកំណត់ជាលំនាំដើមសម្រាប់កម្រងសំណួរជានាទី។ 0 មានន័យថាគ្មានពេលកំណត់។';
$string['configtimelimitsec'] = 'ពេលកំណត់ជាលំនាំដើមសម្រាប់កម្រងសំណួរជាវិនាទី។ 0 មានន័យថាគ្មានពេលកំណត់។';
$string['configurerandomquestion'] = 'កែការកំណត់សម្រាប់សំណួរ';
$string['confirmclose'] = 'នៅពេលដែលអ្នកប្រគល់កម្រងសំណួរហើយ អ្នកនឹងលែងអាចប្តូរចម្លើយរបស់អ្នកក្នុងការសាកល្បងនេះទៀតហើយ។';
$string['confirmremovequestion'] = 'តើអ្នកពិតជាចង់ដកសំណួរ  {$a} នេះចេញមែនទេ?';
$string['confirmremovesectionheading'] = 'តើអ្នកពិតជាចង់ដកចំណងជើងផ្នែក "{$a}" នេះចេញមែនទេ?';
$string['confirmserverdelete'] = 'តើអ្នកពិតជាចង់យកម៉ាស៊ីនបម្រើ <b>{$a}</b> ចេញពីបញ្ជីឬ ?';
$string['connectionerror'] = 'បានដាច់តំណភ្ជាប់បណ្តាញ។ (ការរក្សាទុកដោយស្វ័យប្រវត្តិបានបរាជ័យ)។

ចូរកត់ចំណាំនូវចម្លើយដែលបានបញ្ចូលក្នុងទំព័រនេះកាលពីពេលពីរ បីនាទីមុន។ បន្ទាប់ព្យាយាមតភ្ជាប់ម្តងទៀត។

ខណៈដែលការតភ្ជាប់បណ្តាញបានត្រឡប់មកវិញ នោះចម្លើយរបស់អ្នកគួរតែត្រូវបានរក្សាទុក ហើយសារនេះនឹងបាត់។';
$string['connectionok'] = 'តំណបណ្តាញត្រូវបានស្តារឡើងវិញ។ អ្នកអាចបន្តដោយសុវត្ថិភាព។';
$string['containercategorycreated'] = 'ប្រភេទនេះត្រូវបានបង្កើតឡើងដើម្បីទុកប្រភេទដើមទាំងអស់ដែលបានផ្លាស់ទីទៅកម្រិតតំបន់បណ្ដាញដោយសារវគ្គសិក្សាដែលបានបញ្ជាក់ខាងក្រោម ។';
$string['continueattemptquiz'] = 'បន្តការសាកល្បងចុងក្រោយ';
$string['continuepreview'] = 'បន្តការមើលជាមុនចុងក្រោយ';
$string['copyingfrom'] = 'បង្កើតច្បាប់ចម្លងរបស់សំណួរ \'{$a}\'';
$string['copyingquestion'] = 'ចម្លងសំណួរ';
$string['correct'] = 'ត្រឹមត្រូវ';
$string['correctanswer'] = 'ចម្លើយត្រឹមត្រូវ';
$string['correctanswerformula'] = 'រូបមន្តចម្លើយត្រឹមត្រូវ';
$string['correctansweris'] = 'ចម្លើយត្រឹមត្រូវ៖ {$a}';
$string['correctanswerlength'] = 'តួលេខដែលសំខាន់';
$string['correctanswers'] = 'ចម្លើយត្រឹមត្រូវ';
$string['correctanswershows'] = 'បង្ហាញចម្លើយត្រឹមត្រូវ';
$string['corrresp'] = 'ចម្លើយត្រឹមត្រូវ';
$string['countdown'] = 'រាប់ថយក្រោយ';
$string['countdownfinished'] = 'កំពុងបិទកម្រងសំណួរ អ្នកគួរតែប្រគល់ចម្លើយរបស់អ្នកឥឡូវនេះ ។';
$string['countdowntenminutes'] = 'កម្រងសំណួរនឹងបិទក្នុងរយៈពេល ១០ នាទី ។';
$string['coursetestmanager'] = 'ទ្រង់ទ្រាយកម្មវិធីគ្រប់គ្រងការសាកល្បងវគ្គសិក្សា';
$string['createcategoryandaddrandomquestion'] = 'បង្កើតប្រភេទ និងបន្ថែមសំណួរចៃដន្យ';
$string['createfirst'] = 'អ្នកត្រូវតែបង្កើតសំណួរដែលមានចម្លើយខ្លីៗជាមុនសិន។';
$string['createmultiple'] = 'បន្ថែមសំណួរចៃដន្យជាច្រើនទៅកម្រងសំណួរ';
$string['createnewquestion'] = 'បង្កើតសំណួរថ្មី';
$string['createquestionandadd'] = 'បង្កើតសំណួរថ្មីមួយ ហើយបន្ថែមវាទៅកាន់កម្រងសំណួរ។';
$string['custom'] = 'ទ្រង់ទ្រាយផ្ទាល់ខ្លួន';
$string['dataitemneed'] = 'អ្នកត្រូវតែបន្ថែមយ៉ាងហោចណាស់ធាតុសំណុំទិន្នន័យមួយដើម្បីទទួលនូវសំណួរត្រឹមត្រូវ';
$string['datasetdefinitions'] = 'ការកំណត់សំណុំទិន្នន័យដែលអាចប្រើឡើងវិញបានសម្រាប់ប្រភេទ {$a}';
$string['datasetnumber'] = 'លេខ';
$string['daysavailable'] = 'ថ្ងៃដែលអាចប្រើបាន';
$string['decimaldigits'] = 'តួលេខទសភាពនៅក្នុងពិន្ទុ';
$string['decimalplaces'] = 'ខ្ទង់ទសភាគក្នុងពិន្ទុ';
$string['decimalplaces_help'] = 'នេះជាការកំណត់ពីចំនួនលេខដែលត្រូវបង្ហាញបន្ទាប់ពីសញ្ញាក្បៀសនៅពេលបង្ហាញពិន្ទុ។ ការកំណត់នេះមិនប៉ះពាល់តម្លៃដើមរបស់ពិន្ទុទេ។';
$string['decimalplacesquestion'] = 'ខ្ទង់ទសភាគក្នុងពិន្ទុសំណួរ';
$string['decimalplacesquestion_help'] = 'នេះជាការកំណត់ពីចំនួនលេខដែលត្រូវបង្ហាញបន្ទាប់ពីសញ្ញាក្បៀសនៅពេលបង្ហាញពិន្ទុសម្រាប់សំណួរនីមួយៗ។';
$string['decimalpoints'] = 'សញ្ញាក្បៀស';
$string['default'] = 'លំនាំដើម';
$string['defaultgrade'] = 'ពិន្ទុលំនាំដើមសម្រាប់សំណួរ';
$string['defaultinfo'] = 'ប្រភេទលំនាំដើមសម្រាប់សំណួរ ។';
$string['delay1'] = 'ពេលវេលាពន្យារវាងការសាកល្បងទីមួយ និងទីពីរ';
$string['delay1st2nd'] = 'អនុវត្តការពន្យាពេលរវាងការសាកល្បងទីមួយ និងទីពីរ';
$string['delay1st2nd_help'] = 'ប្រសិនបើបើក នោះសិស្សត្រូវចាំមួយរយៈពេលកំណត់មួយមុនពេលដែលគេអាចសាកល្បងកម្រងសំណួរជាលើកទីពីរ។';
$string['delay2'] = 'ពេលវេលាពន្យារវាងការឆ្លើយក្រោយ';
$string['delaylater'] = 'អនុវត្តការពន្យាពេលរវាងការសាកល្បងក្រោយទៀត';
$string['delaylater_help'] = 'ប្រសិនបើបើក នោះសិស្សត្រូវចាំមួយរយៈពេលកំណត់មួយមុនពេលដែលគេអាចសាកល្បងកម្រងសំណួរជាលើកទីបី និងលើកក្រោយៗទៀត។';
$string['deleteattemptcheck'] = 'តើអ្នកពិតជាចង់លុបការសាកល្បងទាំងនេះមែនឬ ?';
$string['deleteselected'] = 'លុបអ្វីដែលបានជ្រើស';
$string['deletingquestionattempts'] = 'លុបការសាកល្បងលើសំណួរ';
$string['description'] = 'សេចក្ដីពិពណ៌នា';
$string['disabled'] = 'បានបិទ';
$string['displayoptions'] = 'ជម្រើសសម្រាប់ការបង្ហាញ';
$string['donotuseautosave'] = 'កុំប្រើការរក្សាទុកដោយស្វ័យប្រវត្តិ';
$string['download'] = 'ចុចដើម្បីទាញយកឯកសារប្រភេទដែលបាននាំចេញ';
$string['downloadextra'] = '(ឯកសារគឺត្រូវបានទុកនៅក្នុងឯកសារវគ្គសិក្សានៅក្នុងថត /backupdata/quiz)';
$string['dragtoafter'] = 'បន្ទាប់ពី {$a}';
$string['dragtostart'] = 'ទៅចំនុចផ្តើម';
$string['duplicateresponse'] = 'ការប្រគល់នេះត្រូវបានមិនអើពើ ព្រោះអ្នកបានផ្ដល់ចម្លើយដូចគ្នាពីមុនរួចហើយ។';
$string['eachattemptbuildsonthelast'] = 'ការសាកល្បងនីមួយៗធ្វើបន្ថែមលើការសាកល្បងចុងក្រោយ';
$string['eachattemptbuildsonthelast_help'] = 'ប្រសិនបើការសាកល្បងច្រើនដងត្រូវបានអនុញ្ញាត ហើយការកំណត់នេះត្រូវបានបើក នោះការសាកល្បងថ្មីមួយលើកម្រងសំណួរនឹងមានលទ្ធផលពីការសាកល្បងមុន។ បែបនេះធ្វើឲ្យកម្រងសំណួរអាចបញ្ចប់បានដោយការសាកល្បងច្រើនលើក។';
$string['editcategories'] = 'កែសម្រួលប្រភេទ';
$string['editcategory'] = 'កែសម្រួលប្រភេទ';
$string['editcatquestions'] = 'កែសម្រួលសំណួររបស់ប្រភេទ';
$string['editingquestion'] = 'កែសម្រួលសំណួរ';
$string['editingquiz'] = 'កែសម្រួលកម្រងសំណួរ';
$string['editingquiz_help'] = 'នៅពេលបង្កើតកម្រងសំណួរ គោលគំនិតសំខាន់ៗគឺ៖

* កម្រងសំណួរ ដែលមានសំណួរអាចច្រើនលើសពីមួយទំព័រ
* ឃ្លាំងសំណួរ ដែលស្តុកទុកសំណួរដែលបានរៀបចំតាមប្រភេទ
* សំណួរចៃដន្យ -  សិស្សទទួលបានសំណួរផ្សេងៗគ្នារាល់ពេលសាកល្បងកម្រងសំណួរ ហើយសិស្សផ្សេងគ្នាទទួលបានសំណួរផ្សេងគ្នា។';
$string['editingquizx'] = 'កែសម្រួលកម្រងសំណួរ៖ {$a}';
$string['editmaxmark'] = 'កែសម្រួលពិន្ទុអតិបរមា';
$string['editoverride'] = 'កែសម្រួលការលើកលែង';
$string['editqcats'] = 'កែសម្រួលប្រភេទសំណួរ';
$string['editquestion'] = 'កែសម្រួលសំណួរ';
$string['editquestions'] = 'កែសម្រួលសំណួរ';
$string['editquiz'] = 'កែសម្រួលកម្រងសំណួរ';
$string['editquizquestions'] = 'កែសម្រួលសំណួរក្នុងកម្រងសំណួរ';
$string['emailconfirmbody'] = 'សួស្តី {$a->username},

សូមអរគុណចំពោះការប្រគល់ចម្លើយរបស់អ្នកសម្រាប់ \'{$a->quizname}\' ក្នុងវគ្គសិក្សា \'{$a->coursename}\' នៅ {$a->submissiontime} ។

អ៊ីមែលនេះអះអាងថា ចម្លើយរបស់អ្នកត្រូវបានរក្សាទុក។

អ្នកអាចចូលទៅកាន់កម្រងសំណួរនេះនៅ {$a->quizurl} ។';
$string['emailconfirmsmall'] = 'សូមអរគុណចំពោះការប្រគល់ចម្លើយរបស់អ្នកសម្រាប់ \'{$a->quizname}\'';
$string['emailconfirmsubject'] = 'ការអះអាងអំពីការប្រគល់ចម្លើយ៖ {$a->quizname}';
$string['emailnotifybody'] = 'សួស្តី {$a->username},

{$a->studentname} បានបញ្ចប់ \'{$a->quizname}\' ({$a->quizurl}) ក្នុងវគ្គសិក្សា \'{$a->coursename}\'។

អ្នកអាចពិនិត្យការសាកល្បងនេះនៅ {$a->quizreviewurl}។';
$string['emailnotifysmall'] = '{$a->studentname} បានបញ្ចប់ {$a->quizname}។ មើល{$a->quizreviewurl}';
$string['emailnotifysubject'] = '{$a->studentname} បានបញ្ចប់ {$a->quizname}';
$string['emailoverduebody'] = 'សួស្តី {$a->studentname},

អ្នកបានចាប់ផ្តើមសាកល្បង \'{$a->quizname}\' ក្នុងវគ្គសិក្សា \'{$a->coursename}\' ប៉ុន្តែអ្នកមិនបានប្រគល់ចម្លើយទេ។ អ្នកគួរប្រគល់ចម្លើយរបស់អ្នកត្រឹម {$a->attemptduedate}។

ប្រសិនបើអ្នកនៅចង់ប្រគល់ការសាកល្បងនេះជាចម្លើយ សូមទៅកាន់ {$a->attemptsummaryurl} ហើយចុចប៊ូតុងប្រគល់។ អ្នកត្រូវធ្វើបែបនេះឲ្យបានមុន {$a->attemptgraceend} ប្រសិនបើមិនដូច្នោះទេការសាកល្បងរបស់អ្នកនឹងមិនត្រូវបានរាប់ទេ។';
$string['emailoverduesmall'] = 'អ្នកមិនបានប្រគល់ការសាកល្បងរបស់អ្នកសម្រាប់ {$a->quizname} ទេ។ សូមទៅកាន់ {$a->attemptsummaryurl} ឲ្យបានមុន {$a->attemptgraceend} ប្រសិនបើអ្នកនៅចង់ប្រគល់ចម្លើយ។';
$string['emailoverduesubject'] = 'ការសាកល្បងបានហួសកំណត់៖ {$a->quizname}';
$string['empty'] = 'ទទេ';
$string['enabled'] = 'បើក';
$string['endtest'] = 'បញ្ចប់ការសាកល្បង...';
$string['erroraccessingreport'] = 'អ្នកមិនអាចចូលទៅកាន់របាយការណ៍នេះទេ';
$string['errorinquestion'] = 'មានកំហុសនៅក្នុងសំណួរ';
$string['errormissingquestion'] = 'កំហុស៖ ប្រព័ន្ធបាត់សំណួរដែលមានលេខសម្គាល់ {$a}';
$string['errornotnumbers'] = 'កំហុស - ចម្លើយត្រូវតែជាលេខ';
$string['essay'] = 'តែងសេចក្ដី';
$string['essayquestions'] = 'សំណួរ';
$string['eventattemptdeleted'] = 'បានលុបការសាកល្បងលើកម្រងសំណួរ';
$string['eventattemptpreviewstarted'] = 'បានចាប់ផ្តើមការមើលជាមុននូវការសាកល្បងលើកម្រងសំណួរ';
$string['eventattemptreviewed'] = 'បានពិនិត្យការសាកល្បងលើកម្រងសំណួរ';
$string['eventattemptsummaryviewed'] = 'បានមើលសេចក្តីសង្ខេបអំពីការសាកល្បងលើកម្រងសំណួរ';
$string['eventattemptviewed'] = 'បានមើលការសាកល្បងលើកម្រងសំណួរ';
$string['eventeditpageviewed'] = 'បានមើលទំព័រសម្រាប់កែសម្រួលកម្រងសំណួរ';
$string['eventoverridecreated'] = 'បានបង្កើតការលើកលែងសម្រាប់កម្រងសំណួរ';
$string['eventoverridedeleted'] = 'បានលុបការលើកលែងសម្រាប់កម្រងសំណួរ';
$string['eventoverrideupdated'] = 'បានកែប្រែការលើកលែងសម្រាប់កម្រងសំណួរ';
$string['eventquestionmanuallygraded'] = 'បានដាក់ពិន្ទុសំណួរដោយផ្ទាល់';
$string['eventquizattemptabandoned'] = 'បានបោះបង់ការសាកល្បងលើកម្រងសំណួរ';
$string['eventquizattemptstarted'] = 'បានចាប់ផ្តើមការសាកល្បងលើកម្រងសំណួរ';
$string['eventquizattemptsubmitted'] = 'បានប្រគល់ការសាកល្បងលើកម្រងសំណួរ';
$string['eventquizattempttimelimitexceeded'] = 'បានហួសពេលវេលាកំណត់សម្រាប់ការសាកល្បងលើកម្រងសំណួរ';
$string['eventreportviewed'] = 'បានមើលរបាយការណ៍កម្រងសំណួរ';
$string['everynquestions'] = 'រាល់ {$a} សំណួរ';
$string['everyquestion'] = 'រាល់សំណួរ';
$string['everythingon'] = 'អ្វីទាំងអស់លើ';
$string['exportcategory'] = 'នាំប្រភេទចេញ';
$string['exporterror'] = 'មានកំហុសមួយបានកើតឡើងកំឡុងពេលដំណើរការនាំចេញ';
$string['exportingquestions'] = 'សំណួរកំពុងត្រូវបាននាំចេញទៅឯកសារ';
$string['exportname'] = 'ឈ្មោះឯកសារ';
$string['exportquestions'] = 'នាំចេញសំណួរទៅជាឯកសារ';
$string['extraattemptrestrictions'] = 'កំហិតបន្ថែមទៀតលើការសាកល្បង';
$string['false'] = 'ខុស';
$string['feedback'] = 'មូលវិចារណ៍';
$string['feedbackerrorboundaryformat'] = 'ដែនពិន្ទុសម្រាប់មូលវិចារណ៍ត្រូវតែជាភាគរយ ឬជាលេខ ។ តម្លៃដែលអ្នកបានបញ្ចូលនៅក្នុងទីតាំងទី {$a} មិនត្រូវបានទទួលស្គាល់ឡើយ ។';
$string['feedbackerrorboundaryoutofrange'] = 'ដែនពិន្ទុសម្រាប់មូលវិចារណ៍ ត្រូវតែស្ថិតនៅរវាង 0% និង 100% ។ តម្លៃដែលអ្នកបានបញ្ចូលទៅក្នុងទីតាំងទី {$a} គឺមិនស្ថិតនៅក្នុងដែនពិន្ទុឡើយ ។';
$string['feedbackerrorjunkinboundary'] = 'អ្នកត្រូវតែបំពេញប្រអប់ដែនពិន្ទុសម្រាប់មូលវិចារណ៍ដោយគ្មានចន្លោះ ។';
$string['feedbackerrorjunkinfeedback'] = 'អ្នកត្រូវតែបំពេញប្រអប់មូលវិចារណ៍ដោយគ្មានចន្លោះ ។';
$string['feedbackerrororder'] = 'ដែនពិន្ទុសម្រាប់មូលវិចារណ៍ត្រូវតែស្ថិតក្នុងលំដាប់ ខ្ពស់ជាងគេគឺនៅលើគេ ។ តម្លៃដែលអ្នកបានបញ្ចូលនៅក្នុងទីតាំងទី {$a} គឺមិនស្ថិតនៅក្នុងលំដាប់ឡើយ ។';
$string['file'] = 'ឯកសារ';
$string['fileformat'] = 'ទ្រង់ទ្រាយឯកសារ';
$string['fillcorrect'] = 'បំពេញចម្លើយត្រឹមត្រូវ';
$string['filloutnumericalanswer'] = 'អ្នកផ្ដល់យ៉ាងហោចណាស់ចម្លើយដែលអាចមួយ និងចម្លើយស្រដៀងមួយ ។ ចម្លើយផ្គូផ្គងដំបូងនឹងត្រូវប្រើដើម្បីកំណត់ពិន្ទុ និងមូលវិចារណ៍ ។ ប្រសិនបើអ្នកផ្ដល់មូលវិចារណ៍ដោយគ្មានចម្លើយនៅខាងចុង វានឹងត្រូវបានបង្ហាញដល់សិស្ស ដែលការឆ្លើយតបរបស់ពួកគេមិនផ្គូផ្គងនឹងចម្លើយដទៃណាមួយ ។';
$string['filloutoneanswer'] = 'អ្នកត្រូវតែផ្ដល់ចម្លើយដែលសមរម្យយ៉ាងហោចណាស់មួយ ។ ចម្លើយដែលទទេនឹងមិនត្រូវបានប្រើឡើយ ។ \'*\' អាចត្រូវបានប្រើជាតួអក្សរជំនួសដើម្បីផ្គូផ្គងនឹងតួអក្សរមួយចំនួនទៀត ។ ចម្លើយដែលផ្គូផ្គងមុនគេនឹងត្រូវបានប្រើដើម្បីកំណត់ពិន្ទុ និងមូលវិចារណ៍។';
$string['filloutthreequestions'] = 'អ្នកត្រូវតែផ្ដល់សំណួរយ៉ាងហោចណាស់ចំនួនបីដែលមានចម្លើយផ្គូផ្គង ។ អ្នកអាចផ្ដល់ចម្លើយមិនត្រឹមត្រូវបន្ថែមបាន ដោយផ្ដល់ចម្លើយដែលគ្មានសំណួរ ។ ធាតុដែលគ្មានទាំងសំណួរ និងចម្លើយនឹងត្រូវបានមិនអើពើ ។';
$string['fillouttwochoices'] = 'អ្នកត្រូវតែបំពេញយ៉ាងហោចណាស់ជម្រើសពីរ ។ ជម្រើសដែលទទេនឹងមិនត្រូវបានប្រើឡើយ ។';
$string['finishattemptdots'] = 'បញ្ចប់ការសាកល្បង...';
$string['finishreview'] = 'បញ្ចប់ការពិនិត្យឡើងវិញ';
$string['forceregeneration'] = 'តម្រូវឲ្យប្រើការបង្កើតឡើងវិញ';
$string['formatnotfound'] = 'រកមិនឃើញទ្រង់ទ្រាយនាំចូល/នាំចេញ {$a} ឡើយ';
$string['formulaerror'] = 'កំហុសរូបមន្ត!';
$string['fractionsaddwrong'] = 'ពិន្ទុវិជ្ជមានដែលអ្នកបានជ្រើសមិនគ្រប់100% ទេ តែបាន {$a}%<br />តើអ្នកចង់ថយក្រោយវិញ ហើយកែសំណួរនេះឬទេ ?';
$string['fractionsnomax'] = 'ចម្លើយមួយគួរតែទទួលបាន 100% ទើបគេអាច<br />ទទួលពិន្ទុពេញសម្រាប់សំណួរនេះ ។<br />តើអ្នកចង់ថយក្រោយវិញហើយកែសំណួរនេះឬទេ ?';
$string['fromfile'] = 'ពីឯកសារ៖';
$string['functiondisabledbysecuremode'] = 'មុខងារនោះត្រូវបានបិទនាពេលបច្ចុប្បន្ន';
$string['generalfeedback'] = 'មូលវិចារណ៍ទូទៅ';
$string['generalfeedback_help'] = 'មូលវិចារណ៍ទូទៅគឺជាអត្ថបទដែលត្រូវបានបង្ហាញបន្ទាប់ពីសំណួរមួយត្រូវបានគេសាកល្បង។ ខុសពីមូលវិចារណ៍សម្រាប់សំណួរជាក់លាក់ដែលអាស្រ័យលើចម្លើយតបដែលបានផ្តល់ មូលវិចារណ៍ទូទៅដដែលត្រូវបានបង្ហាញជានិច្ច។';
$string['graceperiod'] = 'ពេលអនុគ្រោះសម្រាប់ការប្រគល់ចម្លើយ';
$string['graceperiod_desc'] = 'ប្រសិនបើអ្នកជ្រើស "អនុញ្ញាតឲ្យមានពេលអនុគ្រោះសម្រាប់ប្រគល់ចម្លើយ ប៉ុន្តែមិនប្តូរចម្លើយ" ជាអ្វីដែលត្រូវធ្វើនៅខណៈពេលផុតកំណត់ នោះតម្លៃទីនេះជាពេលវេលាបន្ថែមតាមលំនាំដើមដែលនឹងត្រូវបានផ្តល់ឲ្យ។';
$string['graceperiod_help'] = 'ប្រសិនបើអ្នកជ្រើស "អនុញ្ញាតឲ្យមានពេលអនុគ្រោះសម្រាប់ប្រគល់ចម្លើយ ប៉ុន្តែមិនប្តូរចម្លើយ" ជាអ្វីដែលត្រូវធ្វើនៅខណៈពេលផុតកំណត់ នោះតម្លៃទីនេះជាពេលវេលាបន្ថែមដែលនឹងត្រូវបានផ្តល់ឲ្យ។';
$string['graceperiodmin'] = 'ពេលអនុគ្រោះសម្រាប់ការប្រគល់ចម្លើយចុងក្រោយ';
$string['graceperiodtoosmall'] = 'ពេលអនុគ្រោះត្រូវតែច្រើនជាង {$a}។';
$string['grade'] = 'ដាក់ពិន្ទុ';
$string['gradeall'] = 'ដាក់ពិន្ទុទាំងអស់';
$string['gradeaverage'] = 'ពិន្ទុមធ្យម';
$string['gradeboundary'] = 'ដែនពិន្ទុ';
$string['gradeessays'] = 'ដាក់ពិន្ទុសំណេរ';
$string['gradehighest'] = 'ពិន្ទុខ្ពស់បំផុត';
$string['grademethod'] = 'វិធីដាក់ពិន្ទុ';
$string['grademethod_help'] = 'នៅពេលការសាកល្បងច្រើនដងត្រូវបានអនុញ្ញាត វិធីខាងក្រោមអាចត្រូវបានប្រើសម្រាប់គណនាពិន្ទុចុងក្រោយរបស់កម្រងសំណួរ៖

* ពិន្ទុខ្ពស់បំផុតក្នុងចំណោមការសាកល្បងទាំងអស់
* ពិន្ទុមធ្យម (មធ្យមភាគ) ពីការសាកល្បងទាំងអស់
* ការសាកល្បងដំបូងបង្អស់ (មិនអើពើពីការសាកល្បងដទៃទៀត)
* ការសាកល្បងចុងក្រោយបង្អស់  (មិនអើពើពីការសាកល្បងដទៃទៀត)';
$string['gradesdeleted'] = 'បានលុបពិន្ទុកម្រងសំណួរ';
$string['gradesofar'] = '{$a->method}៖ {$a->mygrade} / {$a->quizgrade} ។';
$string['gradetopassmustbeset'] = 'ពិន្ទុដើម្បីជាប់មិនអាចសូន្យទេ ដោយសារតែកម្រងសំណួរនេះទាមទារឲ្យសិស្សទទួលបានពិន្ទុជាប់មួយដើម្បីអាចបញ្ចប់សកម្មភាពនេះបាន។ សូមដាក់តម្លៃខុសពីសូន្យ។';
$string['gradetopassnotset'] = 'កម្រងសំណួរនេះមិនមានពិន្ទុដើម្បីជាប់ទេដូច្នេះអ្នកមិនអាចប្រើជម្រើសនេះទេ។ សូមប្រើការកំណត់ "ទាមទារពិន្ទុ" ជំនួសវិញ។';
$string['gradingdetails'] = 'ពិន្ទុសម្រាប់ការប្រគល់ចម្លើយនេះ៖ {$a->raw}/{$a->max} ។';
$string['gradingdetailsadjustment'] = 'រួមទាំងការពិន័យមុនៗផង វាផ្ដល់ <strong>{$a->cur}/{$a->max}</strong> ។';
$string['gradingdetailspenalty'] = 'ការប្រគល់ចម្លើយនេះបានធ្វើឲ្យមានការពិន័យ {$a} ។';
$string['gradingdetailszeropenalty'] = 'អ្នកមិនត្រូវបានពិន័យសម្រាប់ការការប្រគល់ចម្លើយនេះទេ ។';
$string['gradingmethod'] = 'វិធីដាក់ពិន្ទុ៖ {$a}';
$string['groupoverrides'] = 'ការលើកលែងសម្រាប់ក្រុម';
$string['groupoverridesdeleted'] = 'ការលើកលែងសម្រាប់ក្រុមត្រូវបានលុប';
$string['groupsnone'] = 'មិនមានក្រុមក្នុងវគ្គសិក្សានេះទេ';
$string['guestsno'] = 'សូមអភ័យទោស ភ្ញៀវមិនអាចមើល ឬសាកល្បងកម្រងសំណួរបានឡើយ';
$string['hidebreaks'] = 'លាក់ធាតុបំបែកទំព័រ';
$string['hidereordertool'] = 'លាក់ឧបករណ៍រៀបលំដាប់';
$string['history'] = 'ប្រវត្តិនៃការឆ្លើយតប៖';
$string['howquestionsbehave_desc'] = 'ការកំណត់លំនាំដើមពីរបៀបដែលសំណួរត្រូវប្រព្រឹត្តិនៅក្នុងកម្រងសំណួរ។';
$string['imagedisplay'] = 'រូបភាពត្រូវបង្ហាញ';
$string['importcategory'] = 'នាំចូលប្រភេទ';
$string['importerror'] = 'មានកំហុសមួយបានកើតឡើងកំឡុងពេលនាំចូលដំណើរការ';
$string['importfilearea'] = 'នាំចូលពីឯកសារដែលមាននៅក្នុងឯកសារវគ្គសិក្សា...';
$string['importfileupload'] = 'នាំចូលពីការផ្ទុកឯកសារឡើង...';
$string['importfromthisfile'] = 'នាំចូលពីឯកសារនេះ';
$string['import_help'] = 'មុខងារនេះអាចឲ្យអ្នកនាំចូលសំណួរពីឯកសារប្រភេទអត្ថបទខាងក្រៅ។

ប្រសិនបើឯកសាររបស់អ្នកមានតែតួអក្សរប្រភេទ non-ascii នោះអ្នកត្រូវប្រើកម្មវិធីបម្លែងកូដ UTF-8។ សូមប្រយ័ត្នជាមួយនឹងឯកសារដែលបានបង្កើតដោយកម្មវិធី Microsoft Office ព្រោះកម្មវិធីទាំងនេះប្រើកម្មវិធីបម្លែងកូដពិសេសដែលធ្វើការងារខុសពីធម្មតា។';
$string['importingquestions'] = 'នាំចូលសំណួរ {$a} ពីឯកសារ';
$string['importmax10error'] = 'មានកំហុសមួយនៅក្នុងសំណួរ ។ អ្នកមិនអាចមានចម្លើយច្រើនជាង ១០ បានឡើយ';
$string['importmaxerror'] = 'មានកំហុសនៅក្នុងសំណួរ ។ មានចម្លើយច្រើនពេក ។';
$string['importquestions'] = 'នាំចូលសំណួរពីឯកសារ';
$string['inactiveoverridehelp'] = '* សិស្សមិនមានក្រុម ឬតួនាទីត្រឹមត្រូវដើម្បីអាចសាកល្បងកម្រងសំណួរទេ';
$string['incorrect'] = 'មិនត្រឹមត្រូវ';
$string['indivresp'] = 'ចម្លើយរបស់បុគ្គលម្នាក់ៗចំពោះធាតុនីមួយៗ';
$string['info'] = 'ព័ត៌មាន';
$string['infoshort'] = 'i';
$string['initialnumfeedbacks'] = 'ចំនួនប្រអប់ទិន្នន័យដំបូងសម្រាប់មូលវិចារណ៍ទូទៅ';
$string['initialnumfeedbacks_desc'] = 'នៅពេលបង្កើតកម្រងសំណួរថ្មីមួយ សូមផ្តល់ប្រអប់ទទេសម្រាប់មូលវិចារណ៍ចំនួនប៉ុណ្ណេះ។ នៅពេលកម្រងសំណួរត្រូវបានបង្កើត ទម្រង់បែបបទនឹងបង្ហាញចំនួនប្រអប់ទិន្នន័យដែលបានទាមទារសម្រាប់ចំនួនមូលវិចារណ៍ក្នុងកម្រងសំណួរ។ ការកំណត់នេះត្រូវតែយ៉ាងហោចណាស់ 1។';
$string['inprogress'] = 'កំពុងដំណើរការ';
$string['introduction'] = 'សេចក្ដីណែនាំ';
$string['invalidattemptid'] = 'មិនមានលេខសម្គាល់ការសាកល្បងអញ្ចឹងទេ';
$string['invalidcategory'] = 'លេខសម្គាល់ប្រភេទមិនត្រឹមត្រូវ';
$string['invalidoverrideid'] = 'លេខសម្គាល់ការលើកលែងមិនត្រឹមត្រូវ';
$string['invalidquestionid'] = 'លេខសម្គាល់សំណួរមិនត្រឹមត្រូវ';
$string['invalidquizid'] = 'លេខសម្គាល់កម្រងសំណួរមិនត្រឹមត្រូវ';
$string['invalidsource'] = 'ប្រភពមិនត្រូវបានទទួលថាត្រឹមត្រូវឡើយ ។';
$string['invalidsourcetype'] = 'ប្រភេទប្រភពមិនត្រឹមត្រូវ ។';
$string['invalidstateid'] = 'លេខសម្គាល់សភាពមិនត្រឹមត្រូវ';
$string['lastanswer'] = 'ចម្លើយចុងក្រោយរបស់អ្នកគឺ';
$string['layout'] = 'ប្លង់';
$string['layoutasshown'] = 'ប្លង់ទំព័រដូចបានបង្ហាញ។';
$string['layoutasshownwithpages'] = 'ប្លង់ទំព័រដូចបានបង្ហាញ។ <small>(ទំព័រថ្មីដោយស្វ័យប្រវត្តិសម្រាប់រាល់ {$a} សំណួរ។)</small>';
$string['layoutshuffledandpaged'] = 'សំណួរត្រូវបានច្របល់ដោយចៃដន្យដោយមាន {$a} សំណួរក្នុងមួយទំព័រ។';
$string['layoutshuffledsinglepage'] = 'សំណួរត្រូវបានច្របល់ដោយចៃដន្យដោយមានសំណួរទាំងអស់ក្នុងទំព័រតែមួយ។';
$string['link'] = 'តំណ';
$string['listitems'] = 'ការរាយធាតុនៅក្នុងកម្រងសំណួរ';
$string['literal'] = 'តម្លៃត្រង់';
$string['loadingquestionsfailed'] = 'បរាជ័យក្នុងការដំណើរការសំណួរ៖ {$a}';
$string['makecopy'] = 'រក្សាទុកជាសំណួរថ្មី';
$string['managetypes'] = 'គ្រប់គ្រងប្រភេទសំណួរ និងម៉ាស៊ីនបម្រើ';
$string['manualgradequestion'] = 'ដាក់ពិន្ទុសំណួរ {$a->question} ក្នុង {$a->quiz} ដោយ {$a->user} ដោយផ្ទាល់';
$string['manualgrading'] = 'ការដាក់ពិន្ទុ';
$string['mark'] = 'ដាក់ស្នើ';
$string['markall'] = 'ដាក់ស្នើទំព័រ';
$string['marks'] = 'ពិន្ទុ';
$string['marks_help'] = 'ពិន្ទុជាលេខសម្រាប់សំណួរនីមួយៗ និងពិន្ទុសរុបសម្រាប់ការសាកល្បង';
$string['match'] = 'ផ្គូផ្គង';
$string['matchanswer'] = 'ចម្លើយផ្គូផ្គង';
$string['matchanswerno'] = 'ចម្លើយផ្គូផ្គង {$a}';
$string['max'] = 'អតិ.';
$string['maxmark'] = 'ពិន្ទុអតិបរមា';
$string['messageprovider:attempt_overdue'] = 'សារព្រមាននៅពេលដែលការសាកល្បងរបស់អ្នកបានហួសពេល';
$string['messageprovider:confirmation'] = 'សារអះអាងពីការប្រគល់ចម្លើយសម្រាប់កម្រងសំណួររបស់អ្នក';
$string['messageprovider:submission'] = 'ការជូនដំណឹងពីការប្រគល់ចម្លើយសម្រាប់កម្រងសំណួរ';
$string['min'] = 'អប្ប.';
$string['minutes'] = 'នាទី';
$string['missingcorrectanswer'] = 'ត្រូវតែបញ្ជាក់ពីចម្លើយត្រឹមត្រូវ';
$string['missingitemtypename'] = 'បាត់ឈ្មោះ';
$string['missingquestion'] = 'សំណួរនេះទំនងជាលែងមានទៀតហើយ';
$string['modulename'] = 'កម្រងសំណួរ';
$string['modulename_help'] = 'សកម្មភាព "កម្រងសំណួរ" អនុញ្ញាតឲ្យគ្រូបង្កើតជាកម្រងសំណួរដែលមានសំណួរក្នុងប្រភេទជាច្រើនដូចជា ពហុជ្រើសរើស ផ្គូផ្គង ចម្លើយខ្លី និងលេខ។

គ្រូអាចឲ្យសិស្សសាកល្បងកម្រងសំណួរច្រើនដង ដោយសំណួរអាចត្រូវបានច្របល់ ឬក៏ជ្រើសដោយចៃដន្យពីឃ្លាំងសំណួរ។ គ្រូក៏អាចដាក់ពេលកំណត់ផងដែរ។

ការសាកល្បងនីមួយៗត្រូវបានដាក់ពិន្ទុដោយស្វ័យប្រវត្តិលើកលែងតែសំណួរតែងសេចក្តី ហើយពិន្ទុត្រូវបានកត់ត្រាទុកក្នុងបញ្ជីពិន្ទុ។

គ្រូអាចជ្រើសពេលដែលត្រូវបង្ហាញព័ត៌មានជំនួយ មូលវិចារណ៍ និងចម្លើយត្រឹមត្រូវទៅកាន់សិស្ស ឬក៏មិនត្រូវបង្ហាញតែម្តង។

កម្រងសំណួរអាចត្រូវបានប្រើ

* ជាវិញ្ញាសារប្រឡងក្នុងវគ្គសិក្សា
* ជាតេស្តតូចមួយសម្រាប់កិច្ចការអាន ឬតេស្តចុងមេរៀន
* ជាការហ្វឹកហាត់សម្រាប់ការប្រឡងដោយប្រើសំណួរពីវិញ្ញាសារប្រឡងពីមុន
* ដើម្បីផ្តល់នូវមូលវិចារណ៍ភ្លាមៗសម្រាប់សមត្ថភាពរបស់សិស្ស
* សម្រាប់ការវាស់ស្ទង់សមត្ថភាពខ្លួនឯង';
$string['modulenameplural'] = 'កម្រងសំណួរ';
$string['moveselectedonpage'] = 'ផ្លាស់ទីសំណួរដែលបានជ្រើសទៅទំព័រ៖ {$a}';
$string['multichoice'] = 'ពហុជ្រើសរើស';
$string['multipleanswers'] = 'ជ្រើសយ៉ាងហោចណាស់ចម្លើយមួយ ។';
$string['mustbesubmittedby'] = 'ការសាកល្បងនេះត្រូវតែប្រគល់ត្រឹម {$a}។';
$string['name'] = 'ឈ្មោះ';
$string['navigatenext'] = 'ទំព័របន្ទាប់';
$string['navigateprevious'] = 'ទំព័រមុន';
$string['navmethod'] = 'វិធីសម្រាប់ផ្លាស់ទី';
$string['navmethod_free'] = 'សេរី';
$string['navmethod_help'] = 'នៅពេលដែលការផ្លាស់ទីតាមលំដាប់បន្តបន្ទាប់ត្រូវបានបើក នោះសិស្សត្រូវឆ្លើយសំណួរក្នុងកម្រងសំណួរតាមលំដាប់លំដោយ និងមិនអាចត្រឡប់ថយក្រោយ ឬក៏រំលងសំណួរបានទេ។';
$string['navmethod_seq'] = 'តាមលំដាប់បន្តបន្ទាប់';
$string['navnojswarning'] = 'ព្រមាន៖ តំណទាំងនេះនឹងមិនរក្សាទុកចម្លើយអ្នកទេ។';
$string['neverallononepage'] = 'ទេ! សំណួរទាំងអស់នៅលើទំព័រតែមួយ';
$string['newattemptfail'] = 'កំហុស៖ មិនអាចចាប់ផ្ដើមការឆ្លើយថ្មីនៅកម្រងសំណួរបានឡើយ';
$string['newpage'] = 'ទំព័រថ្មី';
$string['newpageevery'] = 'ចាប់ផ្តើមទំព័រថ្មីដោយស្វ័យប្រវត្តិ';
$string['newpage_help'] = 'សម្រាប់កម្រងសំណួរដែលវែង អ្នកគួរតែកាត់វាជាច្រើនទំព័រដោយកំណត់ចំនួនសំណួរក្នុងមួយទំព័រ។ នៅពេលបន្ថែមសំណួរទៅកាន់កម្រងសំណួរ ធាតុបំបែកទំព័រនឹងត្រូវបានដាក់បញ្ចូលដោយស្វ័យប្រវត្តិទៅតាមការកំណត់នេះ។ ទោះជាយ៉ាងណាក៏ដោយ ធាតុបំបែកទំព័រអាចត្រូវបានប្តូរទីតាំងនៅពេលក្រោយដោយផ្ទាល់នៅលើទំព័រកែសម្រួល។';
$string['newsectionheading'] = 'ចំណងជើងថ្មី';
$string['noanswers'] = 'មិនបានជ្រើសចម្លើយណាមួយឡើយ!';
$string['noattempts'] = 'មិនមានការសាកល្បងសម្រាប់កម្រងសំណួរនេះនៅឡើយទេ';
$string['noattemptsfound'] = 'រកមិនឃើញការសាកល្បងទេ។';
$string['noattemptstoshow'] = 'គ្មានការសាកល្បងត្រូវបង្ហាញទេ';
$string['nocategory'] = 'មិនត្រឹមត្រូវ ឬមិនបានបញ្ជាក់ប្រភេទ';
$string['noclose'] = 'គ្មានថ្ងៃបិទទេ';
$string['nocommentsyet'] = 'មិនទាន់មានមតិយោបល់ទេ។';
$string['noconnection'] = 'បច្ចុប្បន្ន មិនមានការតភ្ជាប់ទៅកាន់សេវាបណ្ដាញដែលអាចចូលដំណើរការសំណួរនេះទេ ។ សូមទាក់ទងអ្នកគ្រប់គ្រងរបស់អ្នក';
$string['nodataset'] = 'គ្មានអ្វីទាំងអស់ - វាមិនមែនជាតួអក្សរជំនួសទេ';
$string['nodatasubmitted'] = 'មិនមានទិន្នន័យត្រូវបានប្រគល់ឡើយ។';
$string['noessayquestionsfound'] = 'បានរកឃើញសំណួរដែលបានដាក់ពិន្ទុដោយដៃ';
$string['nogradewarning'] = 'កម្រងសំណួរនេះមិនត្រូវបានដាក់ពិន្ទុទេ ដូច្នេះអ្នកមិនអាចកំណត់មូលវិចារណ៍ទូទៅដែលខុសគ្នាទៅតាមពិន្ទុទេ។';
$string['nomoreattempts'] = 'មិនអនុញ្ញាតឲ្យសាកល្បងទៀតទេ';
$string['none'] = 'គ្មាន';
$string['noopen'] = 'គ្មានថ្ងៃបើក';
$string['nooverridedata'] = 'អ្នកត្រូវលើកលែងការកំណត់សម្រាប់កម្រងសំណួរយ៉ាងហោចណាស់មួយ។';
$string['nopossibledatasets'] = 'គ្មានសំណុំទិន្នន័យដែលសមរម្យ';
$string['noquestionintext'] = 'អត្ថបទសំណួរមិនមានសំណួរដែលបានបង្កប់ឡើយ';
$string['noquestions'] = 'គ្មានសំណួរត្រូវបានបន្ថែមនៅឡើយទេ';
$string['noquestionsfound'] = 'រកមិនឃើញសំណួរ';
$string['noquestionsinquiz'] = 'មិនមានសំណួរក្នុងកម្រងសំណួរនេះទេ។';
$string['noquestionsnotinuse'] = 'សំណួរចៃដន្យនេះមិនត្រូវបានប្រើទេដោយសារតែប្រភេទរបស់វាគឺទទេ។';
$string['noquestionsonpage'] = 'ទំព័រទទេ';
$string['noresponse'] = 'គ្មានចម្លើយ';
$string['noreview'] = 'អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យពិនិត្យកម្រងសំណួរនេះឡើងវិញឡើយ';
$string['noreviewattempt'] = 'អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យពិនិត្យការសាកល្បងនេះឡើងវិញឡើយ។';
$string['noreviewshort'] = 'មិនបានអនុញ្ញាត';
$string['noreviewuntil'] = 'អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យពិនិត្យកម្រងសំណួរនេះឡើងវិញបានឡើយរហូតដល់ {$a}';
$string['noreviewuntilshort'] = 'មាន {$a}';
$string['noscript'] = 'ត្រូវតែអនុញ្ញាត JavaScript ដើម្បីបន្ត !';
$string['notavailabletostudents'] = 'ចំណាំ ៖ បច្ចុប្បន្ន កម្រងសំណួរនេះមិនទាន់អាចប្រើបានដោយសិស្សរបស់អ្នកឡើយ';
$string['notenoughrandomquestions'] = 'មិនមានសំណួរគ្រប់គ្រាន់នៅក្នុងប្រភេទ {$a->category} ដើម្បីបង្កើតសំណួរ {$a->name} ({$a->id}) ទេ ។';
$string['notenoughsubquestions'] = 'មិនបានកំណត់សំណួររងគ្រប់គ្រាន់ទេ !<br />តើអ្នកចង់ថយក្រោយវិញ និងកែសំណួរនេះឡើយ ?';
$string['notimedependentitems'] = 'ធាតុអាស្រ័យនឹងពេលវេលាមិនត្រូវបានគាំទ្រដោយម៉ូឌុលកម្រងសំណួរទេ ។ តែអ្នកអាចដាក់ពេលវេលាកំណត់សម្រាប់កម្រងសំណួរទាំងមូល ។ តើអ្នកចង់ជ្រើសធាតុផ្សេង (ឬប្រើធាតុបច្ចុប្បន្នបើទោះជាដូច្នេះក្តី)?';
$string['notyetgraded'] = 'មិនទាន់បានដាក់ពិន្ទុ';
$string['notyetviewed'] = 'មិនទាន់បានមើល';
$string['notyourattempt'] = 'នេះមិនមែនជាការសាកល្បងរបស់អ្នកទេ!';
$string['noview'] = 'អ្នកដែលបានចូលក្នុងគណនីមិនត្រូវបានអនុញ្ញាតឲ្យមើលកម្រងសំណួរនេះទេ';
$string['numattempts'] = '{$a->studentnum} {$a->studentstring} បានធ្វើការសាកល្បង {$a->attemptnum}';
$string['numattemptsmade'] = 'មានការសាកល្បង {$a} សម្រាប់កម្រងសំណួរនេះ';
$string['numberabbr'] = '#';
$string['numerical'] = 'លេខ';
$string['numquestionsx'] = 'សំណួរ៖ {$a}';
$string['oneminute'] = '1 នាទី';
$string['onlyteachersexport'] = 'មានតែគ្រូប៉ុណ្ណោះដែលអាចនាំចេញសំណួរបាន';
$string['onlyteachersimport'] = 'មានតែគ្រូដែលមានសិទ្ធិកែសម្រួលប៉ុណ្ណោះដែលអាចនាំចូលសំណួរបាន';
$string['onthispage'] = 'ទំព័រនេះ';
$string['open'] = 'មិនបានឆ្លើយ';
$string['openafterclose'] = 'មិនអាចកែប្រែកម្រងសំណួរទេ។ អ្នកបានដាក់ថ្ងៃបើកនៅក្រោយថ្ងៃបិទ។';
$string['openclosedatesupdated'] = 'ថ្ងៃបើក និងបិទកម្រងសំណួរត្រូវបានកែប្រែថ្មី';
$string['optional'] = 'ជម្រើស';
$string['orderandpaging'] = 'លំដាប់ និងទំព័រ';
$string['orderandpaging_help'] = 'លេខ 10, 20, 30, ... ពីមុខសំណួរនីមួយៗបង្ហាញពីលំដាប់របស់សំណួរ។ លេខកើនក្នុងចន្លោះដប់ដើម្បីទុកទីតាំងសម្រាប់សំណួរបន្ថែមទៀត ។  ដើម្បីប្តូរលំដាប់សំណួរ ប្តូរលេខ ហើយបន្ទាប់មកចុចប៊ូតុង "ប្តូរលំដាប់សំណួរ" ។

ដើម្បីបន្ថែមធាតុបំបែកទំព័របន្ទាប់ពីសំណួរណា សូមដាក់ធីកលើប្រអប់ធីកជាប់នឹងសំណួរ បន្ទាប់មកចុចលើប៊ូតុង "បន្ថែមទំព័រថ្មីបន្ទាប់ពីសំណួរដែលបានជ្រើស" ។

ដើម្បីតម្រៀបសំណួរលើទំព័រច្រើន សូមចុចលើប៊ូតុង "ដាក់លេខទំព័រ" ហើយជ្រើសចំនួនសំណួរដែលត្រូវបង្ហាញក្នុងមួយទំព័រ ។';
$string['orderingquiz'] = 'លំដាប់ និងទំព័រ';
$string['orderingquizx'] = 'លំដាប់ និងទំព័រ៖ {$a}';
$string['outcomesadvanced'] = 'លទ្ធផលជាការកំណត់កម្រិតខ្ពស់';
$string['outof'] = '{$a->grade} លើពិន្ទុអតិបរមា {$a->maxgrade}';
$string['outofpercent'] = '{$a->grade} លើពិន្ទុអតិបរមា {$a->maxgrade} ({$a->percent}%)';
$string['outofshort'] = '{$a->grade}/{$a->maxgrade}';
$string['overallfeedback'] = 'មូលវិចារណ៍ទូទៅ';
$string['overallfeedback_help'] = 'មូលវិចារណ៍ទូទៅជាអត្ថបទដែលត្រូវបានបង្ហាញបន្ទាប់ពីកម្រងសំណួរត្រូវបានសាកល្បង។ ប្រសិនបើអ្នកកំណត់ដែនកំណត់ពិន្ទុ (ជាភាគរយ ឬជាតម្លៃលេខ) នោះអត្ថបទមូលវិចារណ៍នឹងអាស្រ័យទៅតាមពិន្ទុដែលសិស្សទទួលបាន។';
$string['overdue'] = 'ហួសពេលកំណត់';
$string['overduehandling'] = 'នៅពេលផុតពេលកំណត់';
$string['overduehandlingautoabandon'] = 'ការសាកល្បងត្រូវតែប្រគល់មុនពេលផុតពេលកំណត់ បើមិនដូច្នេះទេការសាកល្បងនឹងត្រូវចាត់ទុកជាមោឃៈ';
$string['overduehandlingautosubmit'] = 'ការសាកល្បងដែលបើកត្រូវប្រគល់ដោយស្វ័យប្រវត្តិ';
$string['overduehandling_desc'] = 'អ្វីដែលត្រូវកើតឡើងជាស្រេចប្រសិនបើសិស្សមិនបានប្រគល់កិច្ចការមុននៅពេលដែលកម្រងសំណួរដល់ពេលកំណត់។';
$string['overduehandlinggraceperiod'] = 'មានពេលអនុគ្រោះនៅពេលដែលការសាកល្បងដែលបើកត្រូវបានប្រគល់ ប៉ុន្តែមិនមានសំណួរត្រូវបានឆ្លើយទៀតទេ';
$string['overduehandling_help'] = 'នេះជាការកំណត់ពីអ្វីដែលត្រូវកើតឡើងប្រសិនបើសិស្សមិនបានប្រគល់ចម្លើយសម្រាប់កម្រងសំណួរមុនពេលផុតពេលកំណត់។ ប្រសិនបើសិស្សកំពុងតែធ្វើកម្រងសំណួរនៅពេលនោះ នោះម៉ោងរាប់ថយក្រោយនឹងប្រគល់កិច្ចការឲ្យពួកគេជានិច្ចដោយស្វ័យប្រវត្តិ។ ប៉ុន្តែប្រសិនបើពួកគេចាកចេញពីគណនីរបស់គេ នោះការកំណត់នេះនឹងកំណត់ពីអ្វីដែលត្រូវកើតឡើង។';
$string['overduemustbesubmittedby'] = 'ការសាកល្បងនេះហួសពេលកំណត់ហើយ។ ការពិតទៅ អ្នកគួរតែបានប្រគល់ចម្លើយឲ្យរួចរាល់។ ប្រសិនបើអ្នកចង់បានពិន្ទុសម្រាប់កម្រងសំណួរនេះ អ្នកត្រូវប្រគល់វាឲ្យបានត្រឹម {$a}។ ប្រសិនបើអ្នកមិនប្រគល់វាឲ្យបានត្រឹមពេលនេះទេ នោះពិន្ទុពីការសាកល្បងនេះនឹងត្រូវចាត់ទុកជាមោឃៈ។';
$string['override'] = 'ការលើកលែង';
$string['overridedeletegroupsure'] = 'តើអ្នកពិតជាចង់លុបការលើកលែងសម្រាប់ក្រុម {$a} មែនទេ?';
$string['overridedeleteusersure'] = 'តើអ្នកពិតជាចង់លុបការលើកលែងសម្រាប់អ្នកប្រើ {$a} មែនទេ?';
$string['overridegroup'] = 'លើកលែងសម្រាប់ក្រុម';
$string['overridegroupeventname'] = '{$a->quiz} - {$a->group}';
$string['overrides'] = 'ការលើកលែង';
$string['overrideuser'] = 'លើកលែងសម្រាប់អ្នកប្រើ';
$string['overrideusereventname'] = '{$a->quiz} - ការលើកលែង';
$string['page-mod-quiz-attempt'] = 'ទំព័រសាកល្បងកម្រងសំណួរ';
$string['page-mod-quiz-edit'] = 'ទំព័រកែសម្រួលកម្រងសំណួរ';
$string['page-mod-quiz-report'] = 'ទំព័ររបាយការណ៍ពីកម្រងសំណួរ';
$string['page-mod-quiz-review'] = 'ទំព័រពិនិត្យការសាកល្បងកម្រងសំណួរ';
$string['page-mod-quiz-summary'] = 'ទំព័រសង្ខេបពីការសាកល្បងកម្រងសំណួរ';
$string['page-mod-quiz-view'] = 'ទំព័រព័ត៌មានពីកម្រងសំណួរ';
$string['page-mod-quiz-x'] = 'គ្រប់ទំព័រម៉ូឌុល "កម្រងសំណួរ"';
$string['pageshort'] = 'ទ';
$string['pagesize'] = 'ទំហំទំព័រ';
$string['parent'] = 'មេ';
$string['parentcategory'] = 'ប្រភេទមេ';
$string['parsingquestions'] = 'ញែកសំណួរពីឯកសារនាំចូល ។';
$string['partiallycorrect'] = 'ត្រឹមត្រូវខ្លះៗ';
$string['penalty'] = 'ពិន័យ';
$string['penaltyscheme'] = 'អនុវត្តការពិន័យ';
$string['penaltyscheme_help'] = 'ប្រសិនបើបើក នោះពិន្ទុពិន័យនឹងត្រូវបានដកចេញពីពិន្ទុចុងក្រោយរបស់សំណួរមួយដែលមានចម្លើយខុស។ តម្លៃពិន្ទុពិន័យត្រូវបានកំណត់ក្នុងការកំណត់សម្រាប់សំណួរ។ ការកំណត់នេះមានប្រសិទ្ធភាពតែនៅពេល "របៀបប្រែប្រួល" ត្រូវបានបើកប៉ុណ្ណោះ។';
$string['percentcorrect'] = 'ភាពត្រឹមត្រូវជាភាគរយ';
$string['pleaseclose'] = 'សំណើរបស់អ្នកត្រូវបានដំណើរការ ។ ឥឡូវ អ្នកអាចបិទផ្ទាំងនេះបាន';
$string['pluginname'] = 'កម្រងសំណួរ';
$string['popup'] = 'បង្ហាញកម្រងសំណួរនៅក្នុងបង្ងួច&quot';
$string['popupblockerwarning'] = 'ផ្នែកនៃការសាកល្បងនេះស្ថិតក្នុងរបៀបសុវត្ថិភាព វាមានន័យថាអ្នកត្រូវយកកម្រងសំណួរនៅក្នុងបង្អួចសុវត្ថិភាព ។ សូមបិទបង្អួចទប់ស្កាត់ដែលលេចឡើង ។ សូមអរគុណ !';
$string['popupnotice'] = 'សិស្សនឹងមើលឃើញកម្រងសំណួរនេះនៅក្នុងបង្អួចសុវត្ថិភាព';
$string['preview'] = 'មើលជាមុន';
$string['previewquestion'] = 'មើលសំណួរជាមុន';
$string['previewquiz'] = 'មើល {$a} ជាមុន';
$string['previewquiznow'] = 'មើលសំណួរជាមុនក្នុងពេលឥឡូវ';
$string['previous'] = 'ស្ថានភាពមុន';
$string['publish'] = 'បោះពុម្ពផ្សាយ';
$string['publishedit'] = 'អ្នកត្រូវតែមានសិទ្ធិក្នុងការបោះពុម្ពផ្សាយវគ្គសិក្សា ដើម្បីបន្ថែម ឬកែសម្រួលសំណួរនៅក្នុងប្រភេទនេះ';
$string['qbrief'] = 'សំ. {$a}';
$string['qname'] = 'ឈ្មោះ';
$string['qti'] = 'ទ្រង់ទ្រាយ IMS QTI';
$string['qtypename'] = 'ប្រភេទ, ឈ្មោះ';
$string['question'] = 'សំណួរ';
$string['questionbank'] = 'ពីឃ្លាំងសំណួរ';
$string['questionbankmanagement'] = 'ការគ្រប់គ្រងឃ្លាំងសំណួរ';
$string['questionbehaviour'] = 'អាកប្បកិរិយារបស់សំណួរ';
$string['questioncats'] = 'ប្រភេទសំណួរ';
$string['questiondeleted'] = 'សំណួរនេះត្រូវបានលុប ។ សូមទាក់ទងគ្រូរបស់អ្នក';
$string['questiondependencyadd'] = 'មិនមានកំហិតទៅលើពេលដែលសំណួរ {$a->thisq} អាចត្រូវបានសាកល្បងទេ • ចុចដើម្បីប្តូរ';
$string['questiondependencyfree'] = 'មិនមានកំហិតលើសំណួរនេះទេ';
$string['questiondependencyremove'] = 'សំណួរ {$a->thisq} មិនអាចត្រូវបានសាកល្បងទេ លុះត្រាតែសំណួរមុន {$a->previousq} ត្រូវបានបញ្ចប់សិន • ចុចដើម្បីប្តូរ';
$string['questiondependsonprevious'] = 'សំណួរនេះមិនអាចត្រូវបានសាកល្បងទេ លុះត្រាតែសំណួរមុនត្រូវបានបញ្ចប់សិន។';
$string['questioninuse'] = 'បច្ចុប្បន្ន សំណួរ \'{$a->questionname}\' គឺកំពុងត្រូវបានប្រើ <br />{$a->quiznames}<br />សំណួរនឹងមិនត្រូវបានលុបពីកម្រងសំណួរទេ ប៉ុន្តែអាចលុបចេញបានតែពីបញ្ជីប្រភេទប៉ុណ្ណោះ ។';
$string['questionmissing'] = 'សំណួរសម្រាប់ការសាកល្បងនេះបានបាត់';
$string['questionname'] = 'ឈ្មោះសំណួរ';
$string['questionnonav'] = '<span class="accesshide">សំណួរ</span>{$a->number}<span class="accesshide"> {$a->attributes}</span>';
$string['questionnonavinfo'] = '<span class="accesshide">ព័ត៌មាន</span>{$a->number}<span class="accesshide"> {$a->attributes}</span>';
$string['questionnotloaded'] = 'សំណួរ {$a} មិនត្រូវបានដំណើរការពីមូលដ្ឋានទិន្នន័យទេ';
$string['questionorder'] = 'លំដាប់សំណួរ';
$string['questionposition'] = 'ទីតាំងលំដាប់ថ្មីសម្រាប់សំណួរ {$a}';
$string['questions'] = 'សំណួរ';
$string['questionsinclhidden'] = 'សំណួរ (រួមទាំងសំណួរដែលលាក់)';
$string['questionsinthisquiz'] = 'សំណួរនៅក្នុងកម្រងសំណួរនេះ';
$string['questionsperpage'] = 'សំណួរក្នុងមួយទំព័រ';
$string['questionsperpagex'] = 'សំណួរក្នុងមួយទំព័រ៖ {$a}';
$string['questiontext'] = 'អត្ថបទសំណួរ';
$string['questiontextisempty'] = '[អត្ថបទសំណួរទទេ]';
$string['questiontype'] = 'ប្រភេទសំណួរ {$a}';
$string['questiontypesetupoptions'] = 'ជម្រើសរៀបចំសម្រាប់ប្រភេទសំណួរ ៖';
$string['quiz:addinstance'] = 'បន្ថែមកម្រងសំណួរថ្មីមួយ';
$string['quiz:attempt'] = 'សាកល្បងកម្រងសំណួរ';
$string['quizavailable'] = 'កម្រងសំណួរគឺអាចសាកល្បងបានដល់៖ {$a}';
$string['quizclose'] = 'បិទកម្រងសំណួរ';
$string['quizclosed'] = 'កម្រងសំណួរនេះបានបិទនៅ {$a}';
$string['quizcloses'] = 'កម្រងសំណួរបិទ';
$string['quizcloseson'] = 'កម្រងសំណួរនេះនឹងបិទនៅ {$a}';
$string['quiz:deleteattempts'] = 'លុបការសាកល្បងលើកម្រងសំណួរ';
$string['quiz:emailconfirmsubmission'] = 'ទទួលសារបញ្ជាក់នៅពេលប្រគល់ចម្លើយ';
$string['quiz:emailnotifysubmission'] = 'ទទួលសារជូនដំណឹងនៅពេលចម្លើយត្រូវបានប្រគល់';
$string['quiz:emailwarnoverdue'] = 'ទទួលសារជូនដំណឹងនៅពេលដែលការសាកល្បងក្លាយជាហួសពេលកំណត់ ហើយត្រូវប្រគល់ឲ្យគ្រូ។';
$string['quizeventcloses'] = '{$a} បិទ';
$string['quizeventopens'] = '{$a} បើក';
$string['quiz:grade'] = 'ដាក់ពិន្ទុកម្រងសំណួរដោយផ្ទាល់';
$string['quiz:ignoretimelimits'] = 'មិនអើពើនឹងពេលវេលាកំណត់នៅលើកម្រងសំណួរ';
$string['quizisclosed'] = 'កម្រងសំណួរនេះត្រូវបានបិទ';
$string['quizisclosedwillopen'] = 'កម្រងសំណួរបានបិទ (បើក {$a})';
$string['quizisopen'] = 'កម្រងសំណួរនេះគឺបើក';
$string['quizisopenwillclose'] = 'កម្រងសំណួរបើក (បិទ {$a})';
$string['quiz:manage'] = 'គ្រប់គ្រងកម្រងសំណួរ';
$string['quiz:manageoverrides'] = 'គ្រប់គ្រងការលើកលែងក្នុងកម្រងសំណួរ';
$string['quiznavigation'] = 'ការផ្លាស់ទីក្នុងកម្រងសំណួរ';
$string['quizopen'] = 'បើកកម្រងសំណួរ';
$string['quizopenclose'] = 'ថ្ងៃបើក និងថ្ងៃបិទ';
$string['quizopenclose_help'] = 'សិស្សអាចចាប់ផ្តើមការសាកល្បងរបស់គេបន្ទាប់ពីថ្ងៃបើកប៉ុណ្ណោះ ហើយពួកគេត្រូវបញ្ចប់ការសាកល្បងរបស់គេមុនពេលបិទ។';
$string['quizopened'] = 'កម្រងសំណួរនេះបើក';
$string['quizopenedon'] = 'កម្រងសំណួរនេះបើកនៅ {$a}';
$string['quizopens'] = 'កម្រងសំណួរបើក';
$string['quizopenwillclose'] = 'កម្រងសំណួរនេះបើក ហើយនឹងបិទនៅ {$a} នៅ';
$string['quizordernotrandom'] = 'លំដាប់នៃកម្រងសំណួរមិនត្រូវបានច្របល់';
$string['quizorderrandom'] = '* លំដាប់នៃកម្រងសំណួរត្រូវបានច្របល់';
$string['quiz:preview'] = 'មើលកម្រងសំណួរជាមុន';
$string['quiz:regrade'] = 'ដាក់ពិន្ទុការសាកល្បងម្តងទៀត';
$string['quiz:reviewmyattempts'] = 'ពិនិត្យចម្លើយរបស់អ្នកឡើងវិញ';
$string['quizsettings'] = 'ការកំណត់កម្រងសំណួរ';
$string['quiztimer'] = 'ឧបករណ៍ពេលសម្រាប់កម្រងសំណួរ';
$string['quiz:view'] = 'មើលព័ត៌មានកម្រងសំណួរ';
$string['quiz:viewreports'] = 'មើលរបាយការណ៍កម្រងសំណួរ';
$string['quizwillopen'] = 'កម្រងសំណួរនេះនឹងបើកនៅ {$a}';
$string['random'] = 'សំណួរចៃដន្យ';
$string['randomcreate'] = 'បង្កើតសំណួរចៃដន្យ';
$string['randomfromcategory'] = 'សំណួរចៃដន្យពីប្រភេទ៖';
$string['randomfromexistingcategory'] = 'សំណួរចៃដន្យពីប្រភេទដែលមានស្រាប់';
$string['randomnosubcat'] = 'សំណួរពីប្រភេទនេះប៉ុណ្ណោះ មិនមែនប្រភេទរងរបស់វាទេ។';
$string['randomnumber'] = 'ចំនួនសំណួរចៃដន្យ';
$string['randomquestionusinganewcategory'] = 'សំណួរចៃដន្យដោយប្រើប្រភេទថ្មីមួយ';
$string['randomwithsubcat'] = 'សំណួរពីប្រភេទនេះនិងប្រភេទរងរបស់វា។';
$string['readytosend'] = 'អ្នករៀបនឹងផ្ញើកម្រងសំណួរទាំងអស់របស់អ្នកដើម្បីដាក់ពិន្ទុ ។ តើអ្នកពិតជាចង់បន្តឬ ?';
$string['reattemptquiz'] = 'ឆ្លើយកម្រងសំណួរម្ដងទៀត';
$string['recentlyaddedquestion'] = 'សំណួរដែលបានបន្ថែមថ្មីៗ !';
$string['recurse'] = 'រួមបញ្ចូលសំណួរពីប្រភេទរងផងដែរ';
$string['redoesofthisquestion'] = 'សំណួរដទៃទៀតដែលបានសាកល្បងទីនេះ៖ {$a}';
$string['redoquestion'] = 'សាកសំណួរមួយទៀតដែលស្រដៀងគ្នា';
$string['regrade'] = 'ដាក់ពិន្ទុការសាកល្បងទាំងអស់ឡើងវិញ';
$string['regradecomplete'] = 'ការសាកល្បងទាំងអស់ត្រូវបានដាក់ពិន្ទុឡើងវិញ';
$string['regradecount'] = 'បានផ្លាស់ប្ដូរ {$a->changed} ក្នុងចំណោមពិន្ទុ {$a->attempt}';
$string['regradedisplayexplanation'] = 'ការសាកល្បងដែលប្តូរនៅពេលដាក់ពិន្ទុឡើងវិញត្រូវបានបង្ហាញជាតំណទៅកាន់ផ្ទាំងពិនិត្យសំណួរ';
$string['regradenotallowed'] = 'អ្នកមិនមានសិទ្ធិដាក់ពិន្ទុឡើងវិញ លើកម្រងសំណួរនេះឡើយ';
$string['regradingquestion'] = 'ដាក់ពិន្ទុ "{$a}" ឡើងវិញ ។';
$string['regradingquiz'] = 'ដាក់ពិន្ទុកម្រងសំណួរ "{$a}" ឡើងវិញ';
$string['remove'] = 'យកចេញ';
$string['removeallgroupoverrides'] = 'លុបការលើកលែងសម្រាប់ក្រុមទាំងអស់';
$string['removeallquizattempts'] = 'លុបការសាកល្បងលើកម្រងសំណួរទាំងអស់ចេញ';
$string['removealluseroverrides'] = 'លុបការលើកលែងសម្រាប់អ្នកប្រើទាំងអស់';
$string['removeemptypage'] = 'ដកទំព័រទទេចេញ';
$string['removepagebreak'] = 'ដកធាតុបំបែកទំព័រចេញ';
$string['removeselected'] = 'ដកធាតុដែលបានជ្រើស';
$string['rename'] = 'ប្ដូរឈ្មោះ';
$string['renderingserverconnectfailed'] = 'ម៉ាស៊ីនបម្រើ {$a} បានបរាជ័យក្នុងការដំណើរការសំណើ RQP ។ ពិនិត្យមើលថាតើ URL ត្រឹមត្រូវឬអត់ ។';
$string['reorderquestions'] = 'រៀបលំដាប់សំណួរឡើងវិញ';
$string['reordertool'] = 'បង្ហាញឧបករណ៍រៀបលំដាប់ឡើងវិញ';
$string['repaginate'] = 'បង់លេខទំព័រឡើងវិញដោយប្រើសំណួរ {$a} ក្នុងមួយទំព័រ';
$string['repaginatecommand'] = 'បង់លេខទំព័រ';
$string['repaginatenow'] = 'បង់លេខទំព័រឥឡូវ';
$string['replace'] = 'ជំនួស';
$string['replacementoptions'] = 'ជម្រើសសម្រាប់ជំនួស';
$string['report'] = 'របាយការណ៍';
$string['reportanalysis'] = 'ការវិភាគធាតុ';
$string['reportattemptsfrom'] = 'ការសាកល្បងពី';
$string['reportattemptsthatare'] = 'ការសាកល្បងដែល';
$string['reportdisplayoptions'] = 'ជម្រើសសម្រាប់ការបង្ហាញ';
$string['reportfullstat'] = 'ស្ថិតិលម្អិត';
$string['reportmulti_percent'] = 'ចំនួនភាគរយច្រើន';
$string['reportmulti_q_x_student'] = 'ជម្រើសសិស្សច្រើន';
$string['reportmulti_resp'] = 'ចម្លើយរៀងៗខ្លួន';
$string['reportmustselectstate'] = 'អ្នកត្រូវជ្រើសយ៉ាងហោចណាស់សភាពមួយ។';
$string['reportnotfound'] = 'របាយការណ៍មិនស្គាល់ ({$a})';
$string['reportoverview'] = 'ទិដ្ឋភាពទូទៅ';
$string['reportregrade'] = 'ដាក់ពិន្ទុការឆ្លើយឡើងវិញ';
$string['reportresponses'] = 'ចម្លើយលម្អិត';
$string['reports'] = 'របាយការណ៍';
$string['reportshowonly'] = 'បង្ហាញតែការសាកល្បង';
$string['reportshowonlyfinished'] = 'បង្ហាញការសាកល្បងដែលបានបញ្ចប់មួយយ៉ាងច្រើនបំផុតសម្រាប់អ្នកប្រើម្នាក់ ({$a})';
$string['reportsimplestat'] = 'ស្ថិតិធម្មតា';
$string['reportusersall'] = 'អ្នកប្រើទាំងអស់ដែលបានសាកល្បងកម្រងសំណួរ';
$string['reportuserswith'] = 'អ្នកដែលបានចុះឈ្មោះចូលរៀនដែលបានសាកល្បងកម្រងសំណួរ';
$string['reportuserswithorwithout'] = 'អ្នកដែលបានចុះឈ្មោះចូលរៀនដែលបាន ឬមិនបានសាកល្បងកម្រងសំណួរ';
$string['reportuserswithout'] = 'អ្នកដែលបានចុះឈ្មោះចូលរៀនដែលមិនបានសាកល្បងកម្រងសំណួរ';
$string['reportwhattoinclude'] = 'អ្វីដែលត្រូវដាក់បញ្ចូលក្នុងរបាយការណ៍';
$string['requirepassword'] = 'ទាមទារពាក្យសម្ងាត់';
$string['requirepassword_help'] = 'ប្រសិនបើពាក្យសម្ងាត់ត្រូវបានបញ្ជាក់ នោះសិស្សត្រូវបញ្ចូលដើម្បីសាកល្បងកម្រងសំណួរ។';
$string['requiresubnet'] = 'ទាមទារអាសយដ្ឋានបណ្ដាញ';
$string['requiresubnet_help'] = 'ការចូលទៅកាន់កម្រងសំណួរអាចត្រូវបានដាក់កំហិតសម្រាប់តែបណ្តាញកុំព្យូទ័រ ឬអ៊ីនធឺណែតជាក់លាក់មួយដោយគ្រាន់តែបញ្ជាក់ពីអាសយដ្ឋាន IP ។ ការធ្វើបែបនេះមានប្រយោជន៍សម្រាប់កម្រងសំណួរតែត្រូវពិនិត្យ ដើម្បីធានាថាមានតែមនុស្សដែលក្នុងទីតាំងជាក់លាក់ណាមួយអាចចូលទៅកាន់កម្រងសំណួរបាន។';
$string['response'] = 'ចម្លើយ';
$string['responses'] = 'ចម្លើយ';
$string['results'] = 'លទ្ធផល';
$string['returnattempt'] = 'ត្រឡប់ទៅការសាកល្បងវិញ';
$string['reuseifpossible'] = 'ប្រើអ្វីដែលបានយកចេញពីមុនឡើងវិញ';
$string['reverttodefaults'] = 'ប្រែទៅជាលំនាំដើមសម្រាប់កម្រងសំណួរវិញ';
$string['review'] = 'ពិនិត្យឡើងវិញ';
$string['reviewafter'] = 'អនុញ្ញាតឲ្យពិនិត្យឡើងវិញបន្ទាប់ពីកម្រងសំណួរបានបិទ';
$string['reviewalways'] = 'អនុញ្ញាតឲ្យពិនិត្យឡើងវិញនៅពេលក៏បាន';
$string['reviewattempt'] = 'ពិនិត្យការសាកល្បងឡើងវិញ';
$string['reviewbefore'] = 'អនុញ្ញាតឲ្យពិនិត្យឡើងវិញនៅខណៈដែលកម្រងសំណួរបើក';
$string['reviewclosed'] = 'បន្ទាប់ពីកម្រងសំណួរបានបិទ';
$string['reviewduring'] = 'ខណៈពេលសាកល្បង';
$string['reviewimmediately'] = 'ភ្លាមៗបន្ទាប់ពីការសាកល្បង';
$string['reviewnever'] = 'កុំអនុញ្ញាតឲ្យពិនិត្យឡើងវិញ';
$string['reviewofattempt'] = 'ការពិនិត្យឡើងវិញនៃការសាកល្បង {$a}';
$string['reviewofpreview'] = 'ការពិនិត្យឡើងវិញនៃការមើលជាមុន';
$string['reviewofquestion'] = 'ការពិនិត្យឡើងវិញនៃសំណួរ {$a->question} ក្នុង {$a->quiz} ដោយ {$a->user}';
$string['reviewopen'] = 'ពេលក្រោយ ខណៈពេលដែលកម្រងសំណួរនៅបើក';
$string['reviewoptions'] = 'សិស្សអាចពិនិត្យឡើងវិញបាន';
$string['reviewoptionsheading'] = 'ជម្រើសសម្រាប់ការពិនិត្យឡើងវិញ';
$string['reviewoptionsheading_help'] = 'ជម្រើសទាំងនេះត្រូតត្រាពីព័ត៌មានដែលសិស្សអាចមើលឃើញនៅពេលដែលពួកគេពិនិត្យការសាកល្បងលើកម្រងសំណួរឡើងវិញ ឬពេលមើលរបាយការណ៍សម្រាប់កម្រងសំណួរ។

**ខណៈពេលសាកល្បង** អាចពាក់ព័ន្ធតែជាមួយនឹងអាកប្បកិរិយាមួយចំនួន ដូចជា "អន្តរកម្មដោយមានការព្យាយាមច្រើនដង" ដែលអាចនឹងបង្ហាញមូលវិចារណ៍នៅពេលសាកល្បង។

**ភ្លាមៗបន្ទាប់ពីការសាកល្បង** អនុវត្តក្នុងពេល ២ នាទីដំបូងបន្ទាប់ពីប៊ូតុង "ប្រគល់ទាំងអស់ ហើយបញ្ចប់" ត្រូវបានចុច។

**ពេលក្រោយ ខណៈពេលដែលកម្រងសំណួរនៅបើក** អនុវត្តបន្ទាប់ពីនេះ និងមុនពេលថ្ងៃបិទកម្រងសំណួរ។

**បន្ទាប់ពីកម្រងសំណួរបានបិទ** អនុវត្តបន្ទាប់ពីថ្ងៃបិទកម្រងសំណួរ។ ប្រសិនបើកម្រងសំណួរមិនមានថ្ងៃបិទទេ សភាពនេះមិនឈានទៅដល់ទេ។';
$string['reviewoverallfeedback'] = 'មូលវិចារណ៍ទូទៅ';
$string['reviewoverallfeedback_help'] = 'មូលវិចារណ៍ដែលត្រូវផ្តល់នៅខាងចុងនៃការសាកល្បង អាស្រ័យលើពិន្ទុសរុបរបស់សិស្ស។';
$string['reviewresponse'] = 'ពិនិត្យមើលចម្លើយឡើងវិញ';
$string['reviewresponsetoq'] = 'ពិនិត្យមើលចម្លើយឡើងវិញ (សំណួរ {$a})';
$string['reviewthisattempt'] = 'ពិនិត្យចម្លើយរបស់អ្នកសម្រាប់ការសាកល្បងនេះឡើងវិញ';
$string['rqp'] = 'សំណួរពីចម្ងាយ';
$string['rqps'] = 'សំណួរពីចម្ងាយ';
$string['sameasoverall'] = 'ដូចគ្នានឹងពិន្ទុរួម';
$string['save'] = 'រក្សាទុក';
$string['saveandedit'] = 'រក្សាទុកការផ្លាស់ប្ដូរ និងកែសម្រួលសំណួរ';
$string['saveattemptfailed'] = 'បរាជ័យក្នុងការរក្សាទុកការសាកល្បងកម្រងសំណួរបច្ចុប្បន្ន។';
$string['savedfromdeletedcourse'] = 'បានរក្សាទុកពីវគ្គសិក្សាដែលបានលុប "{$a}"';
$string['savegrades'] = 'រក្សាទុកពិន្ទុ';
$string['savemyanswers'] = 'រក្សាទុកចម្លើយរបស់ខ្ញុំ';
$string['savenosubmit'] = 'រក្សាទុកដោយមិនប្រគល់';
$string['saveoverrideandstay'] = 'រក្សាទុក និងបញ្ចូលការលើកលែងមួយទៀត';
$string['savequiz'] = 'រក្សាទុកកម្រងសំណួរទាំងមូលនេះ';
$string['saving'] = 'កំពុងរក្សាទុក';
$string['savingnewgradeforquestion'] = 'កំពុងរក្សាទុកពិន្ទុថ្មីសម្រាប់សំណួរដែលមានលេខសម្គាល់ {$a}។';
$string['savingnewmaximumgrade'] = 'កំពុងរក្សាទុកពិន្ទុអតិបរមាថ្មី។';
$string['score'] = 'ពិន្ទុសុទ្ធ';
$string['scores'] = 'ពិន្ទុ';
$string['search:activity'] = 'កម្រងសំណួរ - ព័ត៌មានពីសកម្មភាព';
$string['sectionheadingedit'] = 'កែសម្រួលចំណងជើង "{$a}"';
$string['sectionheadingremove'] = 'ដកចំណងជើង "{$a}"';
$string['seequestions'] = '(មើលសំណួរ)';
$string['select'] = 'ជ្រើស';
$string['selectall'] = 'ជ្រើសទាំងអស់';
$string['selectcategory'] = 'ជ្រើសប្រភេទ';
$string['selectedattempts'] = 'ការសាកល្បងដែលបានជ្រើស...';
$string['selectmultipleitems'] = 'ជ្រើសធាតុច្រើន';
$string['selectmultipletoolbar'] = 'ជ្រើសរបារឧបករណ៍ច្រើន';
$string['selectnone'] = 'មិនជ្រើសទាំងអស់';
$string['selectquestiontype'] = '-- ជ្រើសប្រភេទសំណួរ --';
$string['serveradded'] = 'បានបន្ថែមម៉ាស៊ីនបម្រើ';
$string['serveridentifier'] = 'ឧបករណ៍កំណត់អត្តសញ្ញាណ';
$string['serverinfo'] = 'ព័ត៌មានម៉ាស៊ីនបម្រើ';
$string['servers'] = 'ម៉ាស៊ីនបម្រើ';
$string['serverurl'] = 'URL ម៉ាស៊ីនបម្រើ';
$string['settingsoverrides'] = 'ការលើកលែងសម្រាប់កម្រងសំណួរ';
$string['shortanswer'] = 'ចម្លើយខ្លី';
$string['show'] = 'បង្ហាញ';
$string['showall'] = 'បង្ហាញសំណួរទាំងអស់នៅលើមួយទំព័រ';
$string['showblocks'] = 'បង្ហាញប្លុកពេលសាកល្បងកម្រងសំណួរ';
$string['showblocks_help'] = 'ប្រសិនបើដាក់ "បាទ/ចាស" នោះប្លុកធម្មតានឹងត្រូវបានបង្ហាញនៅពេលសាកល្បងកម្រងសំណួរ';
$string['showbreaks'] = 'បង្ហាញធាតុបំបែកទំព័រ';
$string['showcategorycontents'] = 'បង្ហាញមាតិកាប្រភេទ {$a->arrow}';
$string['showcorrectanswer'] = 'នៅក្នុងមូលវិចារណ៍ បង្ហាញចម្លើយត្រឹមត្រូវ ?';
$string['showdetailedmarks'] = 'បង្ហាញសេចក្ដីលម្អិតអំពីពិន្ទុ';
$string['showeachpage'] = 'បង្ហាញមួយទំព័រម្តង';
$string['showfeedback'] = 'បន្ទាប់ពីឆ្លើយរួច បង្ហាញមូលវិចារណ៍ ?';
$string['showinsecurepopup'] = 'ប្រើផ្ទាំងផុស "សុវត្ថិភាព" សម្រាប់ការសាកល្បង';
$string['showlargeimage'] = 'រូបភាពធំ';
$string['shownoattempts'] = 'បង្ហាញសិស្សដែលគ្មានការសាកល្បង';
$string['shownoattemptsonly'] = 'បង្ហាញតែសិស្សដែលគ្មានការសាកល្បងប៉ុណ្ណោះ';
$string['shownoimage'] = 'គ្មានរូបភាព';
$string['showreport'] = 'បង្ហាញរបាយការណ៍';
$string['showsmallimage'] = 'រូបភាពតូច';
$string['showteacherattempts'] = 'បង្ហាញចម្លើយរបស់គ្រូ';
$string['showuserpicture'] = 'បង្ហាញរូបភាពរបស់អ្នកប្រើ';
$string['showuserpicture_help'] = 'ប្រសិនបើបើក នោះឈ្មោះ និងរូបភាពសិស្សនឹងត្រូវបានបង្ហាញលើអេក្រង់នៅពេលសាកល្បង និងនៅលើអេក្រង់ពិនិត្យឡើងវិញ ដែលធ្វើឲ្យងាយស្រួលក្នុងការបញ្ចាក់ថាសិស្សពិតជាបានប្រើគណនីរបស់គេមែន។';
$string['shuffle'] = 'ច្របល់';
$string['shuffleanswers'] = 'ច្របល់ចម្លើយ';
$string['shuffledrandomly'] = 'ច្របល់ដោយចៃដន្យ';
$string['shufflequestions'] = 'ច្របល់';
$string['shufflequestions_help'] = 'ប្រសិនបើអ្នកបើកជម្រើសនេះ នោះរាល់ពេលដែលកម្រងសំណួរត្រូវបានសាកល្បង លំដាប់សំណួរក្នុងផ្នែកនេះនឹងត្រូវច្របល់ឲ្យមានលំដាប់ចៃដន្យផ្សេងៗគ្នា។

បែបនេះអាចឲ្យសិស្សពិបាកក្នុងការចែករំលែកចម្លើយ ប៉ុន្តែក៏អាចឲ្យមានការលំបាកសម្រាប់សិស្សក្នុងការពិភាក្សាសំណួរណាមួយជាមួយអ្នកដែរ។';
$string['shufflewithin'] = 'ច្របល់ក្នុងសំណួរ';
$string['shufflewithin_help'] = 'ប្រសិនបើបើក នោះផ្នែកទាំងឡាយដែលបង្កើតបានជាសំណួរនីមួយៗនឹងត្រូវច្របល់ដោយចៃដន្យរាល់ពេលដែលសិស្សសាកល្បងកម្រងសំណួរ ប្រសិនបើជម្រើសនេះក៏ត្រូវបានបើកផងដែរក្នុងការកំណត់សម្រាប់សំណួរ។ ការកំណត់នេះប្រើបានសម្រាប់តែសំណួរដែលមានច្រើនផ្នែកប៉ុណ្ណោះដូចជាសំណួរពហុជ្រើសរើស ឬសំណួរផ្គូផ្គងជាដើម។';
$string['singleanswer'] = 'ជ្រើសចម្លើយមួយ ។';
$string['sortage'] = 'តម្រៀបតាមអាយុ';
$string['sortalpha'] = 'តម្រៀបតាមឈ្មោះ';
$string['sortquestionsbyx'] = 'តម្រៀបសំណួរតាម៖ {$a}';
$string['sortsubmit'] = 'តម្រៀបសំណួរ';
$string['sorttypealpha'] = 'តម្រៀបតាមប្រភេទ, ឈ្មោះ';
$string['specificapathnotonquestion'] = 'ទីតាំងឯកសារដែលបានបញ្ជាក់មិនស្ថិតនៅលើសំណួរ';
$string['specificquestionnotonquiz'] = 'សំណួរដែលបានបញ្ជាក់មិនស្ថិតនៅក្នុងកម្រងសំណួរដែលបានបញ្ជាក់ទេ';
$string['startagain'] = 'ចាប់ផ្ដើមម្ដងទៀត';
$string['startattempt'] = 'ចាប់ផ្តើមការសាកល្បង';
$string['startedon'] = 'បានចាប់ផ្ដើមនៅ';
$string['startnewpreview'] = 'ចាប់ផ្តើមការមើលជាមុន';
$string['stateabandoned'] = 'មិនដែលបានប្រគល់';
$string['statefinished'] = 'បានបញ្ចប់';
$string['statefinisheddetails'] = 'បានប្រគល់ {$a}';
$string['stateinprogress'] = 'កំពុងដំណើរការ';
$string['statenotloaded'] = 'សភាពសម្រាប់សំណួរ {$a} មិនត្រូវបានដំណើរការពីមូលដ្ឋានទិន្នន័យ';
$string['stateoverdue'] = 'ហួសកំណត់';
$string['stateoverduedetails'] = 'ត្រូវប្រគល់ត្រឹមថ្ងៃ {$a}';
$string['status'] = 'ស្ថានភាព';
$string['stoponerror'] = 'បញ្ឈប់នៅត្រង់កំហុស';
$string['submitallandfinish'] = 'បញ្ចូនទាំងអស់ ហើយបញ្ចប់';
$string['subneterror'] = 'សូមអភ័យទោស កម្រងសំណួរនេះត្រូវបានចាក់សោ ដូច្នេះវាអាចត្រូវបានចូលដំណើរការបានតែពីទីតាំងជាក់លាក់ប៉ុណ្ណោះ ។ បច្ចុប្បន្ន កុំព្យូទ័ររបស់អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យប្រើកម្រងសំណួរនេះឡើយ ។';
$string['subnetnotice'] = 'កម្រងសំណួរនេះត្រូវបានចាក់សោ ដូច្នេះគឺអាចត្រូវបានចូលដំណើរការបានតែពីទីតាំងជាក់លាក់ប៉ុណ្ណោះ ។ កុំព្យូទ័ររបស់អ្នកគឺមិនស្ថិតនៅលើបណ្ដាញរងដែលបានអនុញ្ញាតឡើយ ។ បើអ្នកជាគ្រូ អ្នកនឹងត្រូវបានអនុញ្ញាតឲ្យមើលជាមុន ។';
$string['subplugintype_quiz'] = 'របាយការណ៍';
$string['subplugintype_quizaccess'] = 'ច្បាប់សម្រាប់ការចូលដំណើរការ';
$string['subplugintype_quizaccess_plural'] = 'ច្បាប់សម្រាប់ការចូលដំណើរការ';
$string['subplugintype_quiz_plural'] = 'របាយការណ៍';
$string['substitutedby'] = 'នឹងត្រូវជំនួសដោយ';
$string['summaryofattempt'] = 'សេចក្តីសង្ខេបនៃការសាកល្បង';
$string['summaryofattempts'] = 'សេចក្តីសង្ខេបនៃការសាកល្បងពីមុនរបស់អ្នក';
$string['temporaryblocked'] = 'អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យសាកល្បងកម្រងសំណួរជាបណ្ដោះអាសន្ន ។<br /> អ្នកនឹងអាចធ្វើការសាកល្បងម្តងទៀតនៅ៖';
$string['theattempt'] = 'ការសាកល្បង';
$string['theattempt_help'] = 'ថាតើសិស្សអាចពិនិត្យការសាកល្បងឡើងវិញឬអត់។';
$string['time'] = 'ពេលវេលា';
$string['timecompleted'] = 'បានបញ្ចប់ទាំងស្រុង';
$string['timedelay'] = 'អ្នកមិនត្រូវបានអនុញ្ញាតឲ្យសាកល្បងកម្រងសំណួរនេះទេដោយសារអ្នកមិនបានឆ្លងផុតពេលវេលាពន្យាមុនពេលឆ្លើយកម្រងសំណួរមួយទៀត';
$string['timeleft'] = 'ពេលវេលានៅសល់';
$string['timelimit'] = 'ពេលវេលាកំណត់';
$string['timelimitexeeded'] = 'សូមអភ័យទោស! បានហួសពេលកំណត់របស់កម្រងសំណួរហើយ!';
$string['timelimit_help'] = 'ប្រសិនបើបើក នោះពេលវេលាកំណត់ត្រូវបានបញ្ជាក់នៅលើទំព័រកម្រងសំណួរដំបូង ហើយម៉ោងរាប់ថយក្រោយត្រូវបានបង្ហាញនៅក្នុងប្លុកសម្រាប់ការផ្លាស់ទីក្នុងកម្រងសំណួរ។';
$string['timestr'] = '%H:%M:%S នៅ %d/%m/%y';
$string['timesup'] = 'ដល់ពេលហើយ!';
$string['timetaken'] = 'ពេលវេលាចំណាយ';
$string['timing'] = 'ពេលវេលា';
$string['tofile'] = 'ទៅកាន់ឯកសារ';
$string['tolerance'] = 'ចម្លើយស្រដៀងៗ';
$string['toomanyrandom'] = 'ចំនួនសំណួរចៃដន្យដែលត្រូវការគឺច្រើនជាងចំនួនសំណួរដែលមានក្នុងប្រភេទ!';
$string['top'] = 'កំពូល';
$string['totalmarksx'] = 'ពិន្ទុសរុប៖ {$a}';
$string['totalquestionsinrandomqcategory'] = 'សំណួរសរុប {$a} ក្នុងប្រភេទ។';
$string['true'] = 'ពិត';
$string['truefalse'] = 'ត្រូវ/ខុស';
$string['type'] = 'ប្រភេទ';
$string['unfinished'] = 'បើក';
$string['ungraded'] = 'មិនបានដាក់ពិន្ទុ';
$string['unit'] = 'មេរៀន';
$string['unknowntype'] = 'ប្រភេទសំណួរមិនបានគាំទ្រទេនៅបន្ទាត់ {$a} ។ សំណួរនឹងត្រូវបានចាត់ទុកជាមោឃៈ';
$string['updatesettings'] = 'កែប្រែការកំណត់សម្រាប់កម្រងសំណួរ';
$string['updatingatttemptgrades'] = 'កំពុងកែប្រែជាថ្មីនូវពិន្ទុសម្រាប់ការសាកល្បង។';
$string['updatingfinalgrades'] = 'កំពុងកែប្រែជាថ្មីនូវពិន្ទុចុងក្រោយ។';
$string['updatingthegradebook'] = 'កំពុងកែប្រែជាថ្មីនូវបញ្ជីពិន្ទុ។';
$string['upgradesure'] = '<div>In particular the quiz module will perform an extensive change of the quiz tables and this upgrade has not yet been sufficiently tested. You are very strongly urged to backup your database tables before proceeding.</div>';
$string['url'] = 'URL';
$string['usedcategorymoved'] = 'ប្រភេទនេះត្រូវបានការពារ និងផ្លាស់ទីទៅកម្រិតតំបន់បណ្ដាញ ព្រោះវាគឺជាប្រភេទដែលបានបោះពុម្ពផ្សាយ ដែលនៅតែប្រើដោយវគ្គសិក្សាផ្សេងទៀត ។';
$string['useroverrides'] = 'ការលើកលែងសម្រាប់អ្នកប្រើ';
$string['useroverridesdeleted'] = 'ការលើកលែងសម្រាប់អ្នកប្រើត្រូវបានលុប';
$string['usersnone'] = 'មិនមានសិស្សណាអាចចូលដំណើរការកម្រងសំណួរនេះទេ';
$string['validate'] = 'ធ្វើឲ្យមានសុពលភាព';
$string['viewallanswers'] = 'មើលការសាកល្បងលើកម្រងសំណួរ {$a}';
$string['viewallreports'] = 'មើលរបាយការណ៍សម្រាប់ការសាកល្បង {$a}';
$string['viewed'] = 'បានមើល';
$string['warningmissingtype'] = '<b>សំណួរនេះគឺជារបស់ប្រភេទមួយដែលមិនទាន់បានដំឡើងនៅលើ Moodle របស់អ្នកនៅឡើយទេ ។<br />សូមជូនដំណឹងដល់អ្នកគ្រប់គ្រង Moodle របស់អ្នក ។</b>';
$string['wheregrade'] = 'ឯណាពិន្ទុរបស់ខ្ញុំ ?';
$string['wildcard'] = 'តួអក្សរជំនួស';
$string['windowclosing'] = 'ផ្ទាំងនេះនឹងបិទនៅពេលបន្តិចទៀតនេះ។';
$string['withsummary'] = 'ជាមួយស្ថិតិសង្ខេប';
$string['wronguse'] = 'អ្នកមិនអាចប្រើទំព័រនេះដូច្នោះបានទេ';
$string['xhtml'] = 'ទ្រង់ទ្រាយ XHTML';
$string['youneedtoenrol'] = 'អ្នកត្រូវតែចុះឈ្មោះក្នុងវគ្គសិក្សានេះ មុនពេលអ្នកអាចឆ្លើយកម្រងសំណួរនេះបាន';
$string['yourfinalgradeis'] = 'ពិន្ទុចុងក្រោយរបស់អ្នកសម្រាប់កម្រងសំណួរនេះគឺ {$a} ។';
