<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'survey', language 'km', branch 'MOODLE_36_STABLE'
 *
 * @package   survey
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['actual'] = 'ពិត';
$string['actualclass'] = 'ថ្នាក់ពិត';
$string['actualstudent'] = '{$a} ពិត';
$string['allquestionrequireanswer'] = 'សំណួរទាំងអស់ត្រូវបានទាមទារ និងត្រូវតែបានឆ្លើយ។';
$string['allquestions'] = 'សំណួរទាំងអស់នៅតាមលំដាប់ សិស្សទាំងអស់';
$string['allscales'] = 'មាត្រដ្ឋានទាំងអស់ សិស្សទាំងអស់';
$string['alreadysubmitted'] = 'អ្នកបានប្រគល់ការស្ទង់មតិនេះរួចហើយ';
$string['analysisof'] = 'ការវិភាគនៃ {$a}';
$string['answers'] = 'ចម្លើយ';
$string['attls1'] = 'ក្នុងការវាយតម្លៃពីអ្វីដែលនរណាម្នាក់និយាយ ខ្ញុំផ្តោតលើគុណភាពនៃសេចក្ដីសំអាងរបស់គេ មិនមែននៅលើអ្នកដែលផ្តល់សេចក្ដីសំអាងនោះទេ។';
$string['attls10'] = 'វាសំខាន់ណាស់សម្រាប់ខ្ញុំ ដែលត្រូវរក្សាភាពសុក្រិតតាមដែលអាចធ្វើបាននៅពេលដែលវិភាគអ្វីមួយ ។';
$string['attls10short'] = 'មានភាពសុក្រិតត្រឹមត្រូវ';
$string['attls11'] = 'ខ្ញុំព្យាយាមគិតជាមួយអ្នកដទៃ ជៀសជាងប្រឆាំងនឹងពួកគេ ។';
$string['attls11short'] = 'គិតជាមួយអ្នកដទៃ';
$string['attls12'] = 'ខ្ញុំមានលក្ខណៈវិនិច្ឆ័យជាក់លាក់ ដែលខ្ញុំប្រើក្នុងការវាយតម្លៃសេចក្ដីសំអាង ។';
$string['attls12short'] = 'ប្រើលក្ខណៈវិនិច្ឆ័យដើម្បីវាយតម្លៃ';
$string['attls13'] = 'ខ្ញុំព្យាយាមស្វែងយល់អំពីគំនិតរបស់នរណាម្នាក់ ជាជាងព្យាយាមវាយតម្លៃវា ។';
$string['attls13short'] = 'ព្យាយាមស្វែងយល់';
$string['attls14'] = 'ខ្ញុំព្យាយាមចង្អុលបង្ហាញពីភាពខ្សោយនៃគំនិតរបស់អ្នកដទៃ ដើម្បីជួយពួកគេក្នុងការបញ្ជាក់ឲ្យច្បាស់ពីសេចក្តីសំអាងរបស់ពួកគេ ។';
$string['attls14short'] = 'ចង្អុលបង្ហាញភាពខ្សោយ';
$string['attls15'] = 'ខ្ញុំតែងតែដាក់ខ្លួនឯងក្នុងស្ថានភាពអ្នកដទៃ នៅពេលពិភាក្សាបញ្ហាចម្រូងចម្រាស់ ដើម្បីឃើញថា ហេតុអ្វីពួកគេគិតឃើញពីវិធីដែលគេធ្វើ ។';
$string['attls15short'] = 'ដាក់ខ្លួនឯងក្នុងស្ថានភាពអ្នកដទៃ';
$string['attls16'] = 'គេអាចហៅវិធីវិភាគរបស់ខ្ញុំថា "ដាក់សម្រាប់ការកាត់ក្តី" ព្រោះខ្ញុំប្រុងប្រយ័ត្នក្នុងការពិចារណាលើភស្តុតាងទាំងអស់។';
$string['attls16short'] = 'ដាក់សម្រាប់ការកាត់ក្តី';
$string['attls17'] = 'ខ្ញុំឲ្យតម្លៃលើការប្រើប្រាស់តក្ក និងហេតុផលជាងការរួមបញ្ចូលនូវការព្រួយបារម្ភរបស់ខ្ញុំ នៅពេលដោះស្រាយបញ្ហា ។';
$string['attls17short'] = 'ខ្ញុំឲ្យតម្លៃលើតក្កបំផុត';
$string['attls18'] = 'ខ្ញុំអាចយល់យ៉ាងច្បាស់អំពីគំនិតដែលខុសគ្នាពីគំនិតរបស់ខ្ញុំដោយតាមការស្វែងយល់ ។';
$string['attls18short'] = 'យល់ច្បាស់តាមការស្វែងយល់';
$string['attls19'] = 'នៅពេលខ្ញុំជួបអ្នកដែលមានគំនិតខុសប្លែកពីខ្ញុំ ខ្ញុំប្រឹងប្រែង \'ពង្រីក\' ខ្លួនខ្ញុំទៅដល់អ្នកនោះ ដើម្បីព្យាយាមមើលថាតើ ពួកគេមានគំនិតទាំងនោះដោយរបៀបណា ។';
$string['attls19short'] = 'ប្រឹងប្រែង "ពង្រីក"';
$string['attls1short'] = 'ផ្ដោតលើគុណភាពនៃសេចក្តីសំអាង';
$string['attls2'] = 'ខ្ញុំចូលចិត្តលេង devil\'s advocate - គឺផ្តល់សេចក្តីសំអាងផ្ទុយពីអ្វីដែលនរណាម្នាក់និយាយ ។';
$string['attls20'] = 'ខ្ញុំចំណាយពេលស្វែងយល់នូវអ្វីដែល \'ខុស\' ជាមួយនឹងអ្វីមួយ ។ ឧទាហរណ៍ ខ្ញុំនឹងស្វែងរកអ្វីមួយនៅក្នុងការបកប្រែត្រង់ ដែលមិនបានផ្តល់សេចក្តីសំអាងល្អគ្រប់គ្រាន់ ។';
$string['attls20short'] = 'មានបញ្ហាអីឬ ?';
$string['attls2short'] = 'លេង devil\'s advocate';
$string['attls3'] = 'ខ្ញុំចូលចិត្តស្វែងយល់អំពីកន្លែងដែលអ្នកដទៃ \'មកពី\' ថាតើបទពិសោធន៍អ្វីដែលធ្វើឲ្យពួកគេគិតឃើញនូវវិធីដែលពួកគេធ្វើ ។';
$string['attls3short'] = 'កន្លែងដែលមនុស្សមកពី';
$string['attls4'] = 'ចំណុចសំខាន់បំផុតនៃការអប់រំរបស់ខ្ញុំ គឺការរៀនស្វែងយល់អំពីមនុស្សដែលខុសប្លែកខ្លាំងពីខ្ញុំ ។';
$string['attls4short'] = 'ស្វែងយល់អំពីមនុស្សផ្សេង';
$string['attls5'] = 'ខ្ញុំមានអារម្មណ៍ថា វិធីប្រសើរបំផុតសម្រាប់ខ្ញុំដើម្បីសម្រេចអត្តសញ្ញាណផ្ទាល់ខ្លួនរបស់ខ្ញុំ គឺត្រូវទំនាក់ទំនងជាមួយប្រភេទមនុស្សផ្សេងៗ ។';
$string['attls5short'] = 'ទំនាក់ទំនងជាមួយភាពផ្សេងគ្នា';
$string['attls6'] = 'ខ្ញុំរីករាយក្នុងការស្ដាប់គំនិតរបស់មនុស្សដែលមានប្រវត្តិផ្សេងពីខ្ញុំ - វាជួយឲ្យខ្ញុំយល់ពីរបៀបដែលរបស់តែមួយអាចត្រូវបានឃើញតាមវិធីផ្សេងគ្នា ។';
$string['attls6short'] = 'រីករាយក្នុងការស្ដាប់គំនិត';
$string['attls7'] = 'ខ្ញុំគិតថា ខ្ញុំអាចពង្រឹងជំហររបស់ខ្ញុំតាមរយៈការពិភាក្សាជាមួយនរណាម្នាក់ដែលមិនយល់ព្រមជាមួយខ្ញុំ ។';
$string['attls7short'] = 'ពង្រឹងដោយពិភាក្សា';
$string['attls8'] = 'ខ្ញុំតែងតែចាប់អារម្មណ៍លើការយល់ដឹងអំពីមូលហេតុដែលគេនិយាយ និងជឿទៅលើអ្វីដែលគេបាននិយាយ និងបានជឿ ។';
$string['attls8short'] = 'ដឹងថាហេតុអ្វីបានជាមនុស្សធ្វើ';
$string['attls9'] = 'ជាញឹកញាប់ ខ្ញុំប្រឆាំងជាមួយនឹងអ្នកនិពន្ធសៀវភៅដែលខ្ញុំអាន ដោយព្យាយាមស្វែងរកពីមូលហេតុដែលគាត់ខុស។';
$string['attls9short'] = 'ប្រឆាំងជាមួយអ្នកនិពន្ធ';
$string['attlsintro'] = 'គោលបំណងនៃកម្រងសំណួរនេះគឺដើម្បីជួយពួកយើងក្នុងការវាយតម្លៃពីការយល់ឃើញរបស់អ្នក ចំពោះការគិត និងការសិក្សា ។

មិនមានចម្លើយ \'ត្រូវ\' ឬ \'ខុស\' ទេ ។ យើងចាប់អារម្មណ៍តែលើគំនិតរបស់អ្នកប៉ុណ្ណោះ ។ យើងសូមធានាថា ចម្លើយរបស់អ្នកនឹងត្រូវបានរក្សាទុកយ៉ាងសម្ងាត់បំផុត ហើយនឹងមិនប៉ះពាល់ដល់ពិន្ទុរបស់អ្នកឡើយ ។';
$string['attlsm1'] = 'ការយល់ឃើញចំពោះការគិត និងការសិក្សា';
$string['attlsm2'] = 'ការសិក្សាដែលបានភ្ជាប់';
$string['attlsm3'] = 'ការសិក្សាដាច់ដោយឡែកពីគ្នា';
$string['attlsmintro'] = 'កំពុងពិភាក្សា ...';
$string['attlsname'] = 'ATTLS (កំណែធាតុ ២០)';
$string['cannotfindanswer'] = 'មិនមានចម្លើយសម្រាប់ការស្ទង់មតិនេះនៅឡើយទេ។';
$string['cannotfindquestion'] = 'មិនមានសំណួរទេ';
$string['cannotfindsurveytmpt'] = 'រកមិនឃើញគំរូស្ទង់មតិទេ';
$string['ciq1'] = 'តើនៅក្នុងថ្នាក់ នៅពេលណាដែលអ្នកផ្តើតអារម្មណ៍លើការសិក្សាបំផុត?';
$string['ciq1short'] = 'ផ្តោតអារម្មណ៍បំផុត';
$string['ciq2'] = 'តើនៅពេលណា ដែលអ្នកនៅក្នុងថ្នាក់អ្នកបែកអារម្មណ៍ពីការសិក្សាបំផុត?';
$string['ciq2short'] = 'បែកអារម្មណ៍បំផុត';
$string['ciq3'] = 'តើសកម្មភាពអ្វីនៅក្នុងវេទិកាដែលអ្នកយល់ឃើញថាច្បាស់លាស់ ឬមានប្រយោជន៍បំផុត ?';
$string['ciq3short'] = 'ខណៈពេលមានប្រយោជន៍';
$string['ciq4'] = 'តើសកម្មភាពអ្វីនៅក្នុងវេទិកា ដែលអ្នកយល់ឃើញថាច្របូកច្របល់ និងភាន់ច្រឡំបំផុត ?';
$string['ciq4short'] = 'ខណៈពេលច្រឡំ';
$string['ciq5'] = 'តើព្រឹត្តិការណ៍អ្វីដែលធ្វើឲ្យអ្នកភ្ញាក់ផ្អើលបំផុត ?';
$string['ciq5short'] = 'ខណៈពេលដែលភ្ញាក់ផ្អើល';
$string['ciqintro'] = 'ខណៈពេលគិតអំពីព្រឹត្តិការណ៍ថ្មីៗក្នុងថ្នាក់ ឆ្លើយសំណួរខាងក្រោម ។';
$string['ciqname'] = 'ឧប្បត្តិហេតុសំខាន់បំផុត';
$string['clicktocontinue'] = 'ចុចទីនេះដើម្បីបន្ត';
$string['clicktocontinuecheck'] = 'ចុចទីនេះដើម្បីពិនិត្យ ហើយបន្ត';
$string['colles1'] = 'ការសិក្សារបស់ខ្ញុំគឺផ្ដោតទៅលើរឿងរ៉ាងដែលខ្ញុំចាប់អារម្មណ៍ ។';
$string['colles10'] = 'ខ្ញុំស្នើឲ្យសិស្សដទៃទៀតពន្យល់អំពីគំនិតរបស់ពួកគេ ។';
$string['colles10short'] = 'ខ្ញុំសុំការពន្យល់';
$string['colles11'] = 'សិស្សដទៃទៀតបានស្នើឲ្យខ្ញុំពន្យល់អំពីគំនិតរបស់ខ្ញុំ ។';
$string['colles11short'] = 'ខ្ញុំត្រូវបានស្នើឲ្យពន្យល់';
$string['colles12'] = 'សិស្សដទៃទៀតឆ្លើយតបនឹងគំនិតរបស់ខ្ញុំ ។';
$string['colles12short'] = 'សិស្សឆ្លើយតបនឹងខ្ញុំ';
$string['colles13'] = 'គ្រូបណ្ដុះការគិតរបស់ខ្ញុំ ។';
$string['colles13short'] = 'គ្រូបណ្ដុះការគិត';
$string['colles14'] = 'គ្រូលើកទឹកចិត្តខ្ញុំឲ្យចូលរួម ។';
$string['colles14short'] = 'គ្រូលើកទឹកចិត្តខ្ញុំ';
$string['colles15'] = 'គ្រូធ្វើជាគំរូថ្លែងសន្ទរកថា';
$string['colles15short'] = 'គ្រូធ្វើជាគំរូក្នុងការប្រើពាក្យសម្តី';
$string['colles16'] = 'គ្រូធ្វើជាគំរូក្នុងការឆ្លុះបញ្ចាំងដ៏សំខាន់ពីខ្លួនឯង';
$string['colles16short'] = 'គ្រូធ្វើជាគំរូឆ្លុះបញ្ចាំងខ្លួនឯង';
$string['colles17'] = 'សិស្សដទៃទៀតលើកទឹកចិត្តការចូលរួមរបស់ខ្ញុំ ។';
$string['colles17short'] = 'សិស្សលើកទឹកចិត្តខ្ញុំ';
$string['colles18'] = 'សិស្សដទៃទៀតកោតសរសើរការរួមចំណែករបស់ខ្ញុំ ។';
$string['colles18short'] = 'សិស្សកោតសរសើរខ្ញុំ';
$string['colles19'] = 'សិស្សដទៃទៀតឲ្យតម្លៃលើការរួមចំណែករបស់ខ្ញុំ ។';
$string['colles19short'] = 'សិស្សឲ្យតម្លៃខ្ញុំ';
$string['colles1short'] = 'ផ្ដោតលើបញ្ហាដែលគួរឲ្យចាប់អារម្មណ៍';
$string['colles2'] = 'អ្វីដែលខ្ញុំបានសិក្សាគឺសំខាន់សម្រាប់ការអនុវត្តជំនាញរបស់ខ្ញុំ ។';
$string['colles20'] = 'សិស្សដទៃទៀតយល់អំពីការលំបាករបស់ខ្ញុំក្នុងការរៀនសូត្រ ។';
$string['colles20short'] = 'សិស្សយល់';
$string['colles21'] = 'ខ្ញុំយល់ច្បាស់អំពីសាររបស់សិស្សដទៃទៀត';
$string['colles21short'] = 'ខ្ញុំយល់អំពីសិស្សដទៃទៀត';
$string['colles22'] = 'សិស្សដទៃទៀតយល់ច្បាស់អំពីសាររបស់ខ្ញុំ ។';
$string['colles22short'] = 'សិស្សយល់អំពីខ្ញុំ';
$string['colles23'] = 'ខ្ញុំយល់ច្បាស់អំពីសាររបស់គ្រូ ។';
$string['colles23short'] = 'ខ្ញុំយល់អំពីគ្រូ';
$string['colles24'] = 'គ្រូយល់ច្បាស់អំពីសាររបស់ខ្ញុំ';
$string['colles24short'] = 'គ្រូយល់អំពីខ្ញុំ';
$string['colles2short'] = 'សំខាន់ចំពោះការអនុវត្តរបស់ខ្ញុំ';
$string['colles3'] = 'ខ្ញុំសិក្សាអំពីវិធីដែលលើកកម្ពស់ការអនុវត្តជំនាញរបស់ខ្ញុំ ។';
$string['colles3short'] = 'លើកកម្ពស់ការអនុវត្តរបស់ខ្ញុំ';
$string['colles4'] = 'អ្វីដែលខ្ញុំសិក្សាទាក់ទងនឹងការអនុវត្តជំនាញរបស់ខ្ញុំ ។';
$string['colles4short'] = 'ទាក់ទងទៅនឹងការអនុវត្តរបស់ខ្ញុំ';
$string['colles5'] = 'ខ្ញុំគិតយ៉ាងដិតដល់អំពីរបៀបដែលខ្ញុំសិក្សា ។';
$string['colles5short'] = 'ខ្ញុំគិតដិតដល់លើការសិក្សារបស់ខ្ញុំ';
$string['colles6'] = 'ខ្ញុំគិតដិតដល់អំពីគំនិតផ្ទាល់ខ្លួនរបស់ខ្ញុំ ។';
$string['colles6short'] = 'ខ្ញុំគិតដិតដល់លើគំនិតខ្លួនឯង';
$string['colles7'] = 'ខ្ញុំគិតយ៉ាងដិតដល់អំពីគំនិតរបស់សិស្សដទៃទៀត ។';
$string['colles7short'] = 'ខ្ញុំគិតដិតដល់ពីសិស្សដទៃទៀត';
$string['colles8'] = 'ខ្ញុំគិតយ៉ាងដិតដល់អំពីគំនិតក្នុងអត្ថបទអំណាន';
$string['colles8short'] = 'ខ្ញុំគិតដិតដល់ពីអត្ថបទអំណាន';
$string['colles9'] = 'ខ្ញុំពន្យល់គំនិតរបស់ខ្ញុំដល់សិស្សដទៃទៀត ។';
$string['colles9short'] = 'ខ្ញុំពន្យល់អំពីគំនិតរបស់ខ្ញុំ';
$string['collesaintro'] = 'គោលបំណងនៃការស្ទង់មតិនេះគឺដើម្បីជួយពួកយើងឲ្យស្វែងយល់ពីរបៀបដែលការចែកចាយលើបណ្ដាញនៃមេរៀននេះជម្រុញឲ្យអ្នករៀនបានប្រសើរ ។

សេចក្តីថ្លែងនីមួយៗទាំង ២៤ ខាងក្រោមសួរអ្នកអំពីបទពិសោធន៍របស់អ្នកនៅក្នុងមេរៀននេះ ។

មិនមានចម្លើយ \'ខុស\' ឬ \'ត្រូវ\' ទេ ។ យើងចាប់អារម្មណ៍តែលើគំនិតរបស់អ្នកប៉ុណ្ណោះ ។ យើងសូមធានាថា ចម្លើយរបស់អ្នកនឹងត្រូវបានរក្សាទុកយ៉ាងសម្ងាត់បំផុត ហើយនឹងមិនប៉ះពាល់ដល់ពិន្ទុរបស់អ្នកឡើយ ។

ចម្លើយដែលបានគិតយ៉ាងល្អិតល្អន់របស់អ្នក នឹងជួយយើងក្នុងការធ្វើឲ្យវិធីបង្ហាញមេរៀននេះនៅលើបណ្ដាញប្រសើរឡើងក្នុងពេលអនាគត ។

សូមអរគុណ !';
$string['collesaname'] = 'COLLES (ពិត)';
$string['collesapintro'] = 'គោលបំណងនៃការស្ទង់មតិនេះគឺដើម្បីជួយពួកយើងឲ្យស្វែងយល់ពីរបៀបដែលការចែកចាយលើបណ្ដាញនៃមេរៀននេះជម្រុញឲ្យអ្នករៀនបានប្រសើរ ។

គូមួយៗនៃសេចក្តីថ្លែងទាំង ២៤ ខាងក្រោមស្នើឲ្យអ្នកប្រៀបធៀបរវាងបទពិសោធន៍ពិត និងបទពិសោធន៍ដែលអ្នកចង់បានក្នុងមេរៀននេះ ។

មិនមានចម្លើយ \'ខុស\' ឬ \'ត្រូវ\' ទេ ។ យើងចាប់អារម្មណ៍តែលើគំនិតរបស់អ្នកប៉ុណ្ណោះ ។ យើងសូមធានាថា ចម្លើយរបស់អ្នកនឹងត្រូវបានរក្សាទុកយ៉ាងសម្ងាត់បំផុត ហើយនឹងមិនប៉ះពាល់ដល់ពិន្ទុរបស់អ្នកឡើយ ។

ចម្លើយដែលបានគិតយ៉ាងល្អិតល្អន់របស់អ្នក នឹងជួយយើងក្នុងការធ្វើឲ្យវិធីបង្ហាញមេរៀននេះនៅលើបណ្ដាញប្រសើរឡើងក្នុងពេលអនាគត ។

សូមអរគុណ !';
$string['collesapname'] = 'COLLES (ដែលចូលចិត្ត និងពិត)';
$string['collesm1'] = 'ភាពទាក់ទង';
$string['collesm1short'] = 'ភាពទាក់ទង';
$string['collesm2'] = 'ការគិតដែលឆ្លុះបញ្ចាំង';
$string['collesm2short'] = 'ការគិតដែលឆ្លុះបញ្ចាំង';
$string['collesm3'] = 'អន្តរសកម្មភាព';
$string['collesm3short'] = 'អន្តរសកម្មភាព';
$string['collesm4'] = 'ជំនួយពីគ្រូ';
$string['collesm4short'] = 'ជំនួយពីគ្រូ';
$string['collesm5'] = 'ជំនួយពីមិត្តភក្ដិ';
$string['collesm5short'] = 'ជំនួយពីមិត្តភក្ដិ';
$string['collesm6'] = 'ការបកស្រាយ';
$string['collesm6short'] = 'ការបកស្រាយ';
$string['collesmintro'] = 'នៅក្នុងមេរៀនលើបណ្ដាញនេះ...';
$string['collespintro'] = 'គោលបំណងនៃការស្ទង់មតិនេះគឺដើម្បីជួយពួកយើងឲ្យស្វែងយល់ពីអ្វីដែលអ្នកឲ្យតម្លៃក្នុងបទពិសោធន៍សិក្សាលើបណ្តាញ ។

គូៗមួយនៃសេចក្តីថ្លែងទាំង ២៤ ខាងក្រោមស្នើឲ្យអ្នកប្រៀបធៀបរវាងបទពិសោធន៍ពិត និងបទពិសោធន៍ដែលអ្នកចង់បានក្នុងមេរៀននេះ ។

មិនមានចម្លើយ \'ខុស\' ឬ \'ត្រូវ\' ទេ ។ យើងចាប់អារម្មណ៍តែលើគំនិតរបស់អ្នកប៉ុណ្ណោះ ។ យើងសូមធានាថា ចម្លើយរបស់អ្នកនឹងត្រូវបានរក្សាទុកយ៉ាងសម្ងាត់បំផុត ហើយនឹងមិនប៉ះពាល់ដល់ពិន្ទុរបស់អ្នកឡើយ ។

ចម្លើយដែលបានគិតយ៉ាងល្អិតល្អន់របស់អ្នក នឹងជួយយើងក្នុងការធ្វើឲ្យវិធីបង្ហាញមេរៀននេះនៅលើបណ្ដាញប្រសើរឡើងក្នុងពេលអនាគត ។

សូមអរគុណ !';
$string['collespname'] = 'COLLES (ដែលចូលចិត្ត)';
$string['completionsubmit'] = 'សិស្សត្រូវប្រគល់ទៅកាន់សកម្មភាពនេះដើម្បីបញ្ចប់វា';
$string['customintro'] = 'សេចក្តីពិពណ៌នា';
$string['deleteallanswers'] = 'លុបចម្លើយស្ទង់មតិទាំងអស់';
$string['deleteanalysis'] = 'លុបការវិភាគចម្លើយ';
$string['done'] = 'រួចរាល់';
$string['download'] = 'ទាញយក';
$string['downloadexcel'] = 'ទាញយកទិន្នន័យជាសៀវភៅបញ្ជី Excel';
$string['downloadinfo'] = 'អ្នកអាចទាញយកទិន្នន័យដើមទាំងស្រុងសម្រាប់ការស្ទង់មតិនេះក្នុងទម្រង់ដែលសមរម្យសម្រាប់ការវិភាគនៅក្នុង Excel, SPSS ឬកញ្ចប់ផ្សេងទៀត ។';
$string['downloadresults'] = 'ទាញយកលទ្ធផល';
$string['downloadtext'] = 'ទាញយកទិន្នន័យជាឯកសារអត្ថបទធម្មតា';
$string['editingasurvey'] = 'កែសម្រួលការស្ទង់មតិ';
$string['errorunabletosavenotes'] = 'កំហុសមួយបានកើតឡើងពេលរក្សាទុកចំណាំរបស់អ្នក។';
$string['eventreportdownloaded'] = 'របាយការណ៍ស្ទង់មតិត្រូវបានទាញយក';
$string['eventreportviewed'] = 'របាយការណ៍ស្ទង់មតិត្រូវបានមើល';
$string['eventresponsesubmitted'] = 'ចម្លើយសម្រាប់ការស្ទង់មតិត្រូវបានប្រគល់';
$string['guestsnotallowed'] = 'មានតែអ្នកដែលបានចុះឈ្មោះទេទើបអាចប្រគល់ចម្លើយបាន';
$string['howlong'] = 'តើអ្នកត្រូវចំណាយពេលប៉ុន្មានដើម្បីបញ្ចប់ការស្ទង់មតិនេះ ?';
$string['howlongoptions'] = 'ក្រោម ១ នាទី ១-២ នាទី ២-៣ នាទី ៣-៤ នាទី ៤-៥ នាទី ៥-១០ នាទី ច្រើនជាង ១០ នាទី';
$string['ifoundthat'] = 'ខ្ញុំយល់ថា';
$string['introtext'] = 'អត្ថបទសេចក្ដីណែនាំ';
$string['invalidsurveyid'] = 'លេខសម្គាល់ការស្ទង់មតិមិនត្រឹមត្រូវ';
$string['invalidtmptid'] = 'លេខសម្គាល់គំរូមិនត្រឹមត្រូវ';
$string['ipreferthat'] = 'ខ្ញុំចូលចិត្តដូចនោះ';
$string['modulename'] = 'ការស្ទង់មតិ';
$string['modulename_help'] = 'ម៉ូឌុលសកម្មភាព "ការស្ទង់មតិ" ផ្តល់ជាឧបករណ៍ស្ទង់មតិជាច្រើនដែលត្រូវបានចាត់ទុកថាមានប្រយោជន៍សម្រាប់ការវាយតម្លៃ និងការជំរុញការរៀនលើបណ្តាញ។ គ្រូអាចប្រើឧបករណ៍ទាំងនេះសម្រាប់ប្រមូលទិន្នន័យពីសិស្សរបស់ពួកគេ ដែលអាចជួយឲ្យពួកគេស្វែងយល់ពីថ្នាក់របស់ពួកគេ ក៏ដូចជាឆ្លុះបញ្ចាំងពីការបង្រៀនរបស់ពួកគេ។

សូមចំណាំថាឧបករណ៍ទាំងនេះត្រូវបានដាក់សំណួររួចជាស្រេចហើយ។ គ្រូដែលចង់បង្កើតការស្ទង់មតិដោយខ្លួនឯងគួរតែប្រើម៉ូឌុលសកម្មភាព "មូលវិចារណ៍" ។';
$string['modulenameplural'] = 'ការស្ទង់មតិ';
$string['name'] = 'ឈ្មោះ';
$string['newsurveyresponses'] = 'ចម្លើយការស្ទង់មតិថ្មី';
$string['nobodyyet'] = 'មិនទាន់មាននរណាបានបញ្ចប់ការស្ទង់មតិនេះនៅឡើយទេ';
$string['notdone'] = 'មិនទាន់បានធ្វើនៅឡើយទេ';
$string['notes'] = 'ការវិភាគ និងកំណត់ចំណាំឯកជនរបស់អ្នក';
$string['notyetanswered'] = 'មិនទាន់បានឆ្លើយ';
$string['othercomments'] = 'តើអ្នកមានមតិយោបល់ផ្សេងទៀតទេ ?';
$string['page-mod-survey-x'] = 'គ្រប់ទំព័រម៉ូឌុល "ការស្ទង់មតិ"';
$string['peoplecompleted'] = 'មនុស្ស {$a} បានបញ្ចប់ការស្ទង់មតិនេះ';
$string['pluginname'] = 'ការស្ទង់មតិ';
$string['preferred'] = 'ដែលចូលចិត្ត';
$string['preferredclass'] = 'ថ្នាក់ដែលចូលចិត្ត';
$string['preferredstudent'] = '{$a} ដែលចូលចិត្ត';
$string['question'] = 'សំណួរ';
$string['questions'] = 'សំណួរ';
$string['questionsnotanswered'] = 'សំណួរពហុជ្រើសរើសមួយចំនួនមិនបានឆ្លើយនៅឡើយទេ ។';
$string['report'] = 'របាយការណ៍ការស្ទង់មតិ';
$string['responsereports'] = 'របាយការណ៍ចម្លើយ';
$string['responses'] = 'ចម្លើយ';
$string['savednotes'] = 'កំណត់ចំណាំរបស់អ្នកត្រូវបានរក្សាទុក';
$string['scaleagree5'] = 'មិនយល់ព្រមដាច់ខាត, មិនយល់ព្រមបន្តិចបន្តួច, យល់ព្រមផង និងមិនយល់ព្រមផង, យល់ព្រមបន្តិចបន្តួច, យល់ព្រមដាច់ខាត';
$string['scales'] = 'មាត្រដ្ឋាន';
$string['scaletimes5'] = 'ស្ទើរតែមិនដែល, កម្រ, ពេលខ្លះ, ជាញឹកញាប់, ស្ទើរតែជានិច្ចជាកាល';
$string['search:activity'] = 'ការស្ទង់មតិ - ព័ត៌មានពីសកម្មភាព';
$string['seemoredetail'] = 'ចុចទីនេះដើម្បីមើលសេចក្ដីលម្អិតបន្ថែម';
$string['selectedquestions'] = 'បានជ្រើសសំណួរពីមាត្រដ្ឋាន សិស្សទាំងអស់';
$string['summary'] = 'សេចក្តីសង្ខប';
$string['survey:addinstance'] = 'បន្ថែមការស្ទង់មតិថ្មីមួយ';
$string['surveycompleted'] = 'អ្នកបានបញ្ចប់ការស្ទង់មតិនេះ ។ ក្រាបខាងក្រោមបង្ហាញអំពីសេចក្ដីសង្ខេបនៃលទ្ធផលរបស់អ្នកដែលបានប្រៀបធៀបទៅនឹងមធ្យមភាគក្នុងថ្នាក់ ។';
$string['surveycompletednograph'] = 'អ្នកបានបញ្ចប់ការស្ទង់មតិនេះ។';
$string['survey:download'] = 'ទាញយកចម្លើយ';
$string['surveygraph'] = 'ក្រាបនៃការស្ទង់មតិ';
$string['surveyname'] = 'ឈ្មោះការស្ទង់មតិ';
$string['survey:participate'] = 'ឆ្លើយតបទៅកាន់ការស្ទង់មតិ';
$string['survey:readresponses'] = 'មើលចម្លើយ';
$string['surveysaved'] = 'បានរក្សាទុកការស្តង់មតិ';
$string['surveytype'] = 'ប្រភេទការស្ទង់មតិ';
$string['surveytype_help'] = 'ការស្ទង់មតិមានបីប្រភេទ៖

* ការស្ទង់មតិអំពីការយល់ឃើញលើការគិតនិងការរៀន (ATTLS) - សម្រាប់វាស់ស្ទង់ពីកម្រិតដែលមនុស្សម្នាក់អាចជា "អ្នកដឹងដែលភ្ជាប់" (ដែលតែងតែចាត់ទុកថាការរៀនគឺសប្បាយ ហើយមានការសហការច្រើន ល្អ និងព្រមប្រើនិងសំយោគគំនិតអ្នកដទៃ) ឬ "អ្នកដឹងដែលដាច់" (ដែលតែងតែមានគោលជំហបែបវិភាគ និងប្រឆាំងទៅកាន់ការរៀន)
* ការស្ទង់មតិឧប្បត្តិហេតុសំខាន់
* ការស្ទង់មតិអំពីការរៀនលើបណ្តាញបែប Constructivist (COLLES) - សម្រាប់ត្រួតពិនិត្យពីកម្រិតដែលសមត្ថភាពក្នុងការធ្វើអន្តរកម្មរបស់អ៊ីនធឺណែតត្រូវបានប្រើប្រាស់សម្រាប់ធ្វើឲ្យសិស្សផ្តោតលើការសិក្សា';
$string['thanksforanswers'] = 'អរគុណចំពោះការឆ្លើយការស្ទង់មតិនេះ {$a}';
$string['time'] = 'ពេលវេលា';
$string['viewsurveyresponses'] = 'មើលចម្លើយសម្រាប់ការស្ទង់មតិ {$a}';
